Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/evp/po/*.po
Languages: fr

source: RC2 encryption algorithm in CBC, ECB, CFB and OFB modes respectively. This is a variable key length cipher with an additional parameter called "effective key bits" or "effective key length". By default both are set to 128 bits.
fr: Algorithme de chiffrement RC2 avec respectivement les modes CBC, ECB, CFB, et OFB. Algorithme avec une longueur de clef variable et un paramètre additionnel « effective key bits » ou « effective key length » (par défaut, défini à 128 bits).

source: EVP_rc2_40_cbc(void), EVP_rc2_64_cbc(void)
fr: B<EVP_rc2_40_cbc>(void), B<EVP_rc2_64_cbc>(void)

source: RC2 algorithm in CBC mode with a default key length and effective key length of 40 and 64 bits. These are obsolete and new code should use EVP_rc2_cbc(), EVP_CIPHER_CTX_set_key_length() and EVP_CIPHER_CTX_ctrl() to set the key length and effective key length.
fr: Algorithme de chiffrement RC2 avec le mode CBC et par défaut, une longueur de clef et une longueur de clef efficace de 40 et 64 bits. Obsolète, de préférence utiliser B<EVP_rc2_cbc>(), B<EVP_CIPHER_CTX_set_key_length>() et B<EVP_CIPHER_CTX_ctrl>() pour définir la longueur de clef et la longueur de clef efficace.

source: EVP_bf_cbc(void), EVP_bf_ecb(void), EVP_bf_cfb(void), EVP_bf_ofb(void);
fr: B<EVP_bf_cbc>(void), B<EVP_bf_ecb>(void), B<EVP_bf_cfb>(void), B<EVP_bf_ofb>(void);

source: Blowfish encryption algorithm in CBC, ECB, CFB and OFB modes respectively. This is a variable key length cipher.
fr: Algorithme de chiffrement Blowfish avec respectivement les modes CBC, ECB, CFB et OFB. Algorithme à longueur de clef variable.

source: EVP_cast5_cbc(void), EVP_cast5_ecb(void), EVP_cast5_cfb(void), EVP_cast5_ofb(void)
fr: B<EVP_cast5_cbc>(void), B<EVP_cast5_ecb>(void), B<EVP_cast5_cfb>(void), B<EVP_cast5_ofb>(void)

source: CAST encryption algorithm in CBC, ECB, CFB and OFB modes respectively. This is a variable key length cipher.
fr: Algorithme de chiffrement CAST avec respectivement les modes CBC, ECB, CFB et OFB. Algorithme à longueur de clef variable.

source: EVP_rc5_32_12_16_cbc(void), EVP_rc5_32_12_16_ecb(void), EVP_rc5_32_12_16_cfb(void), EVP_rc5_32_12_16_ofb(void)
fr: B<EVP_rc5_32_12_16_cbc>(void), B<EVP_rc5_32_12_16_ecb>(void), B<EVP_rc5_32_12_16_cfb>(void), B<EVP_rc5_32_12_16_ofb>(void)

source: RC5 encryption algorithm in CBC, ECB, CFB and OFB modes respectively. This is a variable key length cipher with an additional "number of rounds" parameter. By default the key length is set to 128 bits and 12 rounds.
fr: Algorithme de chiffrement RC5 avec respectivement les modes CBC, ECB, CFB et OFB. Algorithme à longueur de clef variable avec un paramètre additionnel « nombre de tours ». Par défaut, la longueur de clef est de 128 bits et le nombre de tours 12.

source: EVP_aes_128_gcm(void), EVP_aes_192_gcm(void), EVP_aes_256_gcm(void)
fr: B<EVP_aes_128_gcm>(void), B<EVP_aes_192_gcm>(void), B<EVP_aes_256_gcm>(void)

source: AES Galois Counter Mode (GCM) for 128, 192 and 256 bit keys respectively. These ciphers require additional control operations to function correctly: see L<GCM mode> section below for details.
fr: Mode AES Galois Counter (GCM) pour des clefs respectivement de 128, 192 et 256 bits. Ces algorithmes de chiffrement demandent des opérations de contrôle supplémentaires pour fonctionner correctement. Consultez la section B<Mode GCM> ci-dessous pour plus de détails.

source: EVP_aes_128_ccm(void), EVP_aes_192_ccm(void), EVP_aes_256_ccm(void)
fr: B<EVP_aes_128_ccm>(void), B<EVP_aes_192_ccm>(void), B<EVP_aes_256_ccm>(void)

source: AES Counter with CBC-MAC Mode (CCM) for 128, 192 and 256 bit keys respectively. These ciphers require additional control operations to function correctly: see CCM mode section below for details.
fr: Mode AES Counter avec CBC-MAC (CCM) pour des clefs respectivement de 128, 192 et 256 bits. Ces algorithmes de chiffrement demandent des opérations de contrôle supplémentaires pour fonctionner correctement. Consultez la section B<Mode CCM> ci-dessous pour plus de détails.

source: GCM Mode
fr: Mode GCM

source: For GCM mode ciphers the behaviour of the EVP interface is subtly altered and several GCM specific ctrl operations are supported.
fr: Pour les algorithmes de chiffrement en mode GCM, le comportement de l’interface EVP est subtilement modifiée et plusieurs opérations de contrôle spécifiques à GCM sont prises en charge.

source: To specify any additional authenticated data (AAD) a call to EVP_CipherUpdate(), EVP_EncryptUpdate() or EVP_DecryptUpdate() should be made with the output parameter B<out> set to B<NULL>.
fr: Pour indiquer n’importe quelle autre donnée d’authentification (AAD), un appel à B<EVP_CipherUpdate>(), B<EVP_EncryptUpdate>() ou B<EVP_DecryptUpdate>() devrait être fait avec le paramètre de sortie I<out> réglé à NULL.

source: When decrypting the return value of EVP_DecryptFinal() or EVP_CipherFinal() indicates if the operation was successful. If it does not indicate success the authentication operation has failed and any output data B<MUST NOT> be used as it is corrupted.
fr: Lors du déchiffrement, la valeur de retour de B<EVP_DecryptFinal>() ou B<EVP_CipherFinal>() renseigne sur la réussite de l’opération. En cas de non succès, l’opération d’authentification a échoué et aucune donnée de sortie B<ne doit pas> être utilisée car corrompue.

source: The following ctrls are supported in GCM mode:
fr: Les contrôles suivants sont pris en charge dans le mode GCM :

source: Sets the GCM IV length: this call can only be made before specifying an IV. If not called a default IV length is used (96 bits for AES).
fr: Indication de la longueur du vecteur d'initialisation pour GCM. Cet appel peut être fait seulement avant de définir un vecteur d’initialisation Sans appel, une longueur de vecteur GCM est utilisée (96 bits pour AES).

source: Writes B<taglen> bytes of the tag value to the buffer indicated by B<tag>. This call can only be made when encrypting data and B<after> all data has been processed (e.g. after an EVP_EncryptFinal() call).
fr: Écriture de I<taglen> octets de valeur de la balise dans le tampon indiqué par I<tag>. Cet appel peut être fait seulement lors du chiffrement des données et B<après> le traitement de toutes les données (p. ex., après un appel à B<EVP_EncryptFinal>()).

source: Sets the expected tag to B<taglen> bytes from B<tag>. This call is only legal when decrypting data and must be made B<before> any data is processed (e.g. before any EVP_DecryptUpdate() call).
fr: Définition de la balise attendue à I<taglen> octets à partir de I<tag>. Cet appel est seulement possible lors du déchiffrement des données et doit être fait B<avant> le traitement de toute donnée (p. ex., avant n’importe quel appel B<EVP_DecryptUpdate>()).

source: See L<EXAMPLES> below for an example of the use of GCM mode.
fr: Consultez B<EXEMPLES> ci-dessous par un exemple d’utilisation du mode GCM

source: CCM Mode
fr: Mode CCM

source: The behaviour of CCM mode ciphers is similar to CCM mode but with a few additional requirements and different ctrl values.
fr: Le comportement des algorithmes de chiffrement de mode CCM est similaire au mode CCM mais avec quelques obligations supplémentaires et des valeurs de contrôle différentes.

source: Like GCM mode any additional authenticated data (AAD) is passed by calling EVP_CipherUpdate(), EVP_EncryptUpdate() or EVP_DecryptUpdate() with the output parameter B<out> set to B<NULL>. Additionally the total plaintext or ciphertext length B<MUST> be passed to EVP_CipherUpdate(), EVP_EncryptUpdate() or EVP_DecryptUpdate() with the output and input parameters (B<in> and B<out>) set to B<NULL> and the length passed in the B<inl> parameter.
fr: Comme pour le mode GCM, n’importe quelle autre donnée d’authentification (AAD) est fournie en appelant B<EVP_CipherUpdate>(), B<EVP_EncryptUpdate>() ou B<EVP_DecryptUpdate>() avec le paramètre I<out> défini à NULL. En plus, la longueur du texte chiffré ou non B<doit> être fournie à B<EVP_CipherUpdate>(), B<EVP_EncryptUpdate>() ou B<EVP_DecryptUpdate>() avec les paramètres d’entrée et de sortie (I<in> et I<out>) définis à NULL et la longueur indiquée dans le paramètre I<inl>.

source: The following ctrls are supported in CCM mode:
fr: Les contrôles suivants sont pris en charge dans le mode CCM :

source: This call is made to set the expected B<CCM> tag value when decrypting or the length of the tag (with the B<tag> parameter set to NULL) when encrypting. The tag length is often referred to as B<M>. If not set a default value is used (12 for AES).
fr: Cet appel est fait pour définir la valeur de la balise attendue I<CCM> lors du déchiffrement, ou la longueur de la balise (avec le paramètre I<tag> réglé à NULL) lors du chiffrement. La longueur de la balise est souvent B<M>. Si elle n’est pas précisée, une valeur par défaut est utilisée (12 pour AES).

source: Sets the CCM B<L> value. If not set a default is used (8 for AES).
fr: Définition de la valeur I<L> du CCM. Non définie, une valeur par défaut est utilisée (8 pour AES).

source: Sets the CCM nonce (IV) length: this call can only be made before specifying an nonce value. The nonce length is given by B<15 - L> so it is 7 by default for AES.
fr: Définition de la longueur (vecteur d'initialisation) circonstancielle du CGM. Cet appel peut seulement être fait avant de préciser la valeur du moment. La valeur du moment est donné par I<15 - L>, ainsi c’est sept par défaut pour AES.

source: Where possible the B<EVP> interface to symmetric ciphers should be used in preference to the low level interfaces. This is because the code then becomes transparent to the cipher used and much more flexible. Additionally, the B<EVP> interface will ensure the use of platform specific cryptographic acceleration such as AES-NI (the low level interfaces do not provide the guarantee).
fr: Lorsque cela est possible, l’interface EVP pour les algorithmes symétriques devrait être utilisée de préférence aux interfaces de bas niveau. Cela parce que le code devient évident pour l’algorithme utilisé et plus souple. De plus, l’interface EVP garantit l’utilisation de l’accélération de chiffrement particulière à certaines plateformes telles que AES-NI (l’interface de bas niveau n’offre aucune garantie).

source: PKCS padding works by adding B<n> padding bytes of value B<n> to make the total length of the encrypted data a multiple of the block size. Padding is always added so if the data is already a multiple of the block size B<n> will equal the block size. For example if the block size is 8 and 11 bytes are to be encrypted then 5 padding bytes of value 5 will be added.
fr: Le remplissage PKCS est réalisé en ajoutant I<n> octets de valeur I<n> pour que la longueur totale des données chiffrées soit un multiple de la taille de bloc. Comme le remplissage est toujours réalisé, si la taille des données est déjà un multiple de la taille de bloc, I<n> sera égal à la taille de bloc. Par exemple, si la taille de bloc est B<8> et B<11> octets sont à chiffrés, alors B<5> bits de remplissage de valeur B<5> seront ajoutés.

source: When decrypting the final block is checked to see if it has the correct form.
fr: Lors du déchiffrement, le bloc terminal est contrôlé pour s’assurer de sa forme correcte.

source: Although the decryption operation can produce an error if padding is enabled, it is not a strong test that the input data or key is correct. A random block has better than 1 in 256 chance of being of the correct format and problems with the input data earlier on will not produce a final decrypt error.
fr: Bien que l’opération de déchiffrement puisse produire une erreur si le remplissage est activé, cela n’est pas un test fort pour l’exactitude des données d’entrée ou de la clef. Un bloc aléatoire a au mieux une chance sur 256 d’être d’un format correct et les problèmes avec les données précédentes ne provoqueront pas une erreur finale de déchiffrement.

source: If padding is disabled then the decryption operation will always succeed if the total amount of data decrypted is a multiple of the block size.
fr: Si le remplissage est activé, l’opération de déchiffrement sera toujours réussie si le total des données est un multiple de la taille de bloc.

source: The functions EVP_EncryptInit(), EVP_EncryptFinal(), EVP_DecryptInit(), EVP_CipherInit() and EVP_CipherFinal() are obsolete but are retained for compatibility with existing code. New code should use EVP_EncryptInit_ex(), EVP_EncryptFinal_ex(), EVP_DecryptInit_ex(), EVP_DecryptFinal_ex(), EVP_CipherInit_ex() and EVP_CipherFinal_ex() because they can reuse an existing context without allocating and freeing it up on each call.
fr: Les fonctions B<EVP_EncryptInit>(), B<EVP_EncryptFinal>(), B<EVP_DecryptInit>(), B<EVP_CipherInit>() et B<EVP_CipherFinal>() sont obsolètes mais sont conservées pour des raisons de compatibilité avec le code existant. B<EVP_EncryptInit_ex>(), B<EVP_EncryptFinal_ex>(), B<EVP_DecryptInit_ex>(), B<EVP_DecryptFinal_ex>(), B<EVP_CipherInit_ex>() et B<EVP_CipherFinal_ex>() doivent être utilisées car elles peuvent réutiliser le contexte existant sans avoir à allouer ou libérer à chaque appel.

source: BUGS
fr: BOGUES

source: For RC5 the number of rounds can currently only be set to 8, 12 or 16. This is a limitation of the current RC5 code rather than the EVP interface.
fr: Pour RC5, le nombre de tours peut être actuellement être 8, 12 ou 16. C’est une limitation du code RC5 actuel plutôt que de l’interface EVP.

source: EVP_MAX_KEY_LENGTH and EVP_MAX_IV_LENGTH only refer to the internal ciphers with default key lengths. If custom ciphers exceed these values the results are unpredictable. This is because it has become standard practice to define a generic key as a fixed unsigned char array containing EVP_MAX_KEY_LENGTH bytes.
fr: B<EVP_MAX_KEY_LENGTH> et B<EVP_MAX_IV_LENGTH> font seulement référence aux algorithmes internes de chiffrement avec des longueurs de clef par défaut. Si des algorithmes personnalisés dépassent ces longueurs, les résultats sont imprévisibles. Cela est dû au fait qu’en pratique une clef générique est définie en un tableau « unsigned char » contenant B<EVP_MAX_KEY_LENGTH>.

source: The ASN1 code is incomplete (and sometimes inaccurate) it has only been tested for certain common S/MIME ciphers (RC2, DES, triple DES) in CBC mode.
fr: Le code ASN1 est incomplet (et parfois inexact), il a été testé pour certains algorithmes communs S/MIME (RC2, DES, triple DES) avec le mode CBC.

source: EXAMPLES
fr: EXEMPLES

source: Encrypt a string using IDEA:
fr: Chiffrer une chaîne en utilisant IDEA :

source: int do_crypt(char *outfile) { unsigned char outbuf[1024]; int outlen, tmplen; /* Bogus key and IV: we'd normally set these from * another source. */ unsigned char key[] = {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15}; unsigned char iv[] = {1,2,3,4,5,6,7,8}; char intext[] = "Some Crypto Text"; EVP_CIPHER_CTX ctx; FILE *out;
fr: int do_crypt(char *outfile) { unsigned char outbuf[1024]; int outlen, tmplen; /* Clef et VI bogués : normalement définis à partir * d’une autre source. */ unsigned char key[] = {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15}; unsigned char iv[] = {1,2,3,4,5,6,7,8}; char intext[] = "Un texte chiffré"; EVP_CIPHER_CTX ctx; FILE *out;

source: if(!EVP_EncryptUpdate(&ctx, outbuf, &outlen, intext, strlen(intext))) { /* Error */ return 0; } /* Buffer passed to EVP_EncryptFinal() must be after data just * encrypted to avoid overwriting it. */ if(!EVP_EncryptFinal_ex(&ctx, outbuf + outlen, &tmplen)) { /* Error */ return 0; } outlen += tmplen; EVP_CIPHER_CTX_cleanup(&ctx); /* Need binary mode for fopen because encrypted data is * binary data. Also cannot use strlen() on it because * it wont be null terminated and may contain embedded * nulls. */ out = fopen(outfile, "wb"); fwrite(outbuf, 1, outlen, out); fclose(out); return 1; }
fr: if(!EVP_EncryptUpdate(&ctx, outbuf, &outlen, intext, strlen(intext))) { /* Erreur */ return 0; } /* Le tampon fourni à EVP_EncryptFinal() doit, après les données * être juste chiffré pour éviter d’être surchargé. */ if(!EVP_EncryptFinal_ex(&ctx, outbuf + outlen, &tmplen)) { /* Erreur */ return 0; } outlen += tmplen; EVP_CIPHER_CTX_cleanup(&ctx); /* Mode binaire nécessaire pour fopen car les données chiffrées sont * des données binaires. strlen() ne peut être utilisée car * elles peuvent n’être terminées par NULL et peuvent comporter des * NULL. */ out = fopen(outfile, "wb"); fwrite(outbuf, 1, outlen, out); fclose(out); return 1; }

source: The ciphertext from the above example can be decrypted using the B<openssl> utility with the command line (shown on two lines for clarity):
fr: Le texte chiffré de l’exemple ci-dessus peut être décodé en utilisant l’utilitaire openssl avec la ligne de commande (montrée sur deux lignes par souci de clarté) :

source: openssl idea -d <filename -K 000102030405060708090A0B0C0D0E0F -iv 0102030405060708
fr: openssl idea -d <fichier -K 000102030405060708090A0B0C0D0E0F -iv 0102030405060708

source: General encryption and decryption function example using FILE I/O and AES128 with a 128-bit key:
fr: Exemple général de chiffrement et déchiffrement utilisant FILE I/O et AES128 avec une clef de 128 bits :

source: int do_crypt(FILE *in, FILE *out, int do_encrypt) { /* Allow enough space in output buffer for additional block */ unsigned char inbuf[1024], outbuf[1024 + EVP_MAX_BLOCK_LENGTH]; int inlen, outlen; EVP_CIPHER_CTX ctx; /* Bogus key and IV: we'd normally set these from * another source. */ unsigned char key[] = "0123456789abcdeF"; unsigned char iv[] = "1234567887654321";
fr: int do_crypt(FILE *in, FILE *out, int do_encrypt) { /* Allocation d’assez d’espace dans tampon sortie pour bloc additionnel */ unsigned char inbuf[1024], outbuf[1024 + EVP_MAX_BLOCK_LENGTH]; int inlen, outlen; EVP_CIPHER_CTX ctx; /* Clef et VI bogués : normalement définis à partir * d’une autre source. */ unsigned char key[] = "0123456789abcdeF"; unsigned char iv[] = "1234567887654321";

source: /* Don't set key or IV right away; we want to check lengths */ EVP_CIPHER_CTX_init(&ctx); EVP_CipherInit_ex(&ctx, EVP_aes_128_cbc(), NULL, NULL, NULL, do_encrypt); OPENSSL_assert(EVP_CIPHER_CTX_key_length(&ctx) == 16); OPENSSL_assert(EVP_CIPHER_CTX_iv_length(&ctx) == 16);
fr: /* Ne pas définir maintenant la clef ou le vecteur, vérif des longueurs */ EVP_CIPHER_CTX_init(&ctx); EVP_CipherInit_ex(&ctx, EVP_aes_128_cbc(), NULL, NULL, NULL, do_encrypt); OPENSSL_assert(EVP_CIPHER_CTX_key_length(&ctx) == 16); OPENSSL_assert(EVP_CIPHER_CTX_iv_length(&ctx) == 16);

source: /* Now we can set key and IV */ EVP_CipherInit_ex(&ctx, NULL, NULL, key, iv, do_encrypt);
fr: /* Maintenant définir la clef et le vecteur d'initialisation */ EVP_CipherInit_ex(&ctx, NULL, NULL, key, iv, do_encrypt);

source: for(;;) { inlen = fread(inbuf, 1, 1024, in); if(inlen <= 0) break; if(!EVP_CipherUpdate(&ctx, outbuf, &outlen, inbuf, inlen)) { /* Error */ EVP_CIPHER_CTX_cleanup(&ctx); return 0; } fwrite(outbuf, 1, outlen, out); } if(!EVP_CipherFinal_ex(&ctx, outbuf, &outlen)) { /* Error */ EVP_CIPHER_CTX_cleanup(&ctx); return 0; } fwrite(outbuf, 1, outlen, out);
fr: for(;;) { inlen = fread(inbuf, 1, 1024, in); if(inlen <= 0) break; if(!EVP_CipherUpdate(&ctx, outbuf, &outlen, inbuf, inlen)) { /* Erreur */ EVP_CIPHER_CTX_cleanup(&ctx); return 0; } fwrite(outbuf, 1, outlen, out); } if(!EVP_CipherFinal_ex(&ctx, outbuf, &outlen)) { /* Erreur */ EVP_CIPHER_CTX_cleanup(&ctx); return 0; } fwrite(outbuf, 1, outlen, out);

source: L<evp(3)|evp(3)>
fr: L<B<evp>(3)|evp(3)>

source: EVP_CIPHER_CTX_init(), EVP_EncryptInit_ex(), EVP_EncryptFinal_ex(), EVP_DecryptInit_ex(), EVP_DecryptFinal_ex(), EVP_CipherInit_ex(), EVP_CipherFinal_ex() and EVP_CIPHER_CTX_set_padding() appeared in OpenSSL 0.9.7.
fr: B<EVP_CIPHER_CTX_init>(), B<EVP_EncryptInit_ex>(), B<EVP_EncryptFinal_ex>(), B<EVP_DecryptInit_ex>(), B<EVP_DecryptFinal_ex>(), B<EVP_CipherInit_ex>(), B<EVP_CipherFinal_ex>() et B<EVP_CIPHER_CTX_set_padding>() sont apparues dans OpenSSL 0.9.7.

source: IDEA appeared in OpenSSL 0.9.7 but was often disabled due to patent concerns; the last patents expired in 2012.
fr: IDEA est apparu dans OpenSSL 0.9.7 mais a été souvent désactivé dû à des problèmes de droits ; le dernier brevet a expiré en 2012.

source: EVP_OpenInit, EVP_OpenUpdate, EVP_OpenFinal - EVP envelope decryption
fr: EVP_OpenInit, EVP_OpenUpdate, EVP_OpenFinal - Déchiffrement d'enveloppe EVP

source: int EVP_OpenInit(EVP_CIPHER_CTX *ctx,EVP_CIPHER *type,unsigned char *ek, int ekl,unsigned char *iv,EVP_PKEY *priv); int EVP_OpenUpdate(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl, unsigned char *in, int inl); int EVP_OpenFinal(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl);
fr: B< int EVP_OpenInit(EVP_CIPHER_CTX *>I<ctx>B<,EVP_CIPHER *>I<type>B<,unsigned char *>I<ek>B<,> B<int> I<ekl>B<,unsigned char *>I<iv>B<,EVP_PKEY *>I<priv>B<);> B<int EVP_OpenUpdate(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *out,> B<int *outl, unsigned char *in, int inl);> B<int EVP_OpenFinal(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *out,> B<int *outl);>

source: The EVP envelope routines are a high level interface to envelope decryption. They decrypt a public key encrypted symmetric key and then decrypt data using it.
fr: Les routines d'enveloppe EVP sont une interface haut niveau pour envelopper le déchiffrement. Elles déchiffrent une clef symétrique chiffrée par clef publique puis déchiffrent les données en l'utilisant.

source: EVP_OpenInit() initializes a cipher context B<ctx> for decryption with cipher B<type>. It decrypts the encrypted symmetric key of length B<ekl> bytes passed in the B<ek> parameter using the private key B<priv>. The IV is supplied in the B<iv> parameter.
fr: B<EVP_OpenInit>() initialise un contexte d'algorithme de chiffrement I<ctx> pour le déchiffrement avec l'algorithme de chiffrement I<type>. Elle déchiffre la clef symétrique de taille I<ekl> octets passée dans le paramètre I<ek> en utilisant la clef privée I<priv>. Le vecteur d'initialisation est fourni dans le paramètre I<iv>.

source: EVP_OpenUpdate() and EVP_OpenFinal() have exactly the same properties as the EVP_DecryptUpdate() and EVP_DecryptFinal() routines, as documented on the L<EVP_EncryptInit(3)|EVP_EncryptInit(3)> manual page.
fr: B<EVP_OpenUpdate>() et B<EVP_OpenFinal>() ont exactement les mêmes propriétés que les routines B<EVP_DecryptUpdate>() et B<EVP_DecryptFinal>(), conformément à la documentation de la page de manuel L<B<EVP_EncryptInit>(3)|EVP_EncryptInit(3)>.

source: It is possible to call EVP_OpenInit() twice in the same way as EVP_DecryptInit(). The first call should have B<priv> set to NULL and (after setting any cipher parameters) it should be called again with B<type> set to NULL.
fr: B<EVP_OpenInit>() peut être appelée deux fois de la même façon que B<EVP_DecryptInit>(). Le premier appel devrait avoir I<priv> défini à NULL et (après le réglage des paramètres d'algorithme de chiffrement) elle devrait être encore appelée avec le I<type> défini à NULL.

source: If the cipher passed in the B<type> parameter is a variable length cipher then the key length will be set to the value of the recovered key length. If the cipher is a fixed length cipher then the recovered key length must match the fixed cipher length.
fr: Si l'algorithme de chiffrement passé dans le paramètre I<type> est à taille variable, alors la taille de clef sera définie à la valeur de la taille de clef récupérée. Si l'algorithme de chiffrement est à taille fixe, alors la taille de clef récupérée doit correspondre à la taille fixe de l'algorithme de chiffrement.

source: EVP_OpenInit() returns 0 on error or a non zero integer (actually the recovered secret key size) if successful.
fr: B<EVP_OpenInit>() renvoie B<0> en cas d'erreur ou un entier non nul (en fait la taille de la clef secrète) en cas de réussite.
