Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/evp/po/*.po
Languages: fr

source: #define EVP_CIPHER_CTX_cipher(e) ((e)->cipher) #define EVP_CIPHER_CTX_nid(e) ((e)->cipher->nid) #define EVP_CIPHER_CTX_block_size(e) ((e)->cipher->block_size) #define EVP_CIPHER_CTX_key_length(e) ((e)->key_len) #define EVP_CIPHER_CTX_iv_length(e) ((e)->cipher->iv_len) #define EVP_CIPHER_CTX_get_app_data(e) ((e)->app_data) #define EVP_CIPHER_CTX_set_app_data(e,d) ((e)->app_data=(char *)(d)) #define EVP_CIPHER_CTX_type(c) EVP_CIPHER_type(EVP_CIPHER_CTX_cipher(c)) #define EVP_CIPHER_CTX_flags(e) ((e)->cipher->flags) #define EVP_CIPHER_CTX_mode(e) ((e)->cipher->flags & EVP_CIPH_MODE)
fr: B< #define EVP_CIPHER_CTX_cipher(e) ((e)-E<gt>cipher)> B<#define EVP_CIPHER_CTX_nid(e) ((e)-E<gt>cipher-E<gt>nid)> B<#define EVP_CIPHER_CTX_block_size(e) ((e)-E<gt>cipher-E<gt>block_size)> B<#define EVP_CIPHER_CTX_key_length(e) ((e)-E<gt>key_len)> B<#define EVP_CIPHER_CTX_iv_length(e) ((e)-E<gt>cipher-E<gt>iv_len)> B<#define EVP_CIPHER_CTX_get_app_data(e) ((e)-E<gt>app_data)> B<#define EVP_CIPHER_CTX_set_app_data(e,d) ((e)-E<gt>app_data=(char *)(d))> B<#define EVP_CIPHER_CTX_type(c) EVP_CIPHER_type(EVP_CIPHER_CTX_cipher(c))> B<#define EVP_CIPHER_CTX_flags(e) ((e)-E<gt>cipher-E<gt>flags)> B<#define EVP_CIPHER_CTX_mode(e) ((e)-E<gt>cipher-E<gt>flags & EVP_CIPH_MODE)>

source: int EVP_CIPHER_param_to_asn1(EVP_CIPHER_CTX *c, ASN1_TYPE *type); int EVP_CIPHER_asn1_to_param(EVP_CIPHER_CTX *c, ASN1_TYPE *type);
fr: B< int EVP_CIPHER_param_to_asn1(EVP_CIPHER_CTX *c, ASN1_TYPE *>I<type>B<);> B<int EVP_CIPHER_asn1_to_param(EVP_CIPHER_CTX *c, ASN1_TYPE *>I<type>B<);>

source: The EVP cipher routines are a high level interface to certain symmetric ciphers.
fr: Les routines de chiffrement EVP sont des interfaces de haut niveau pour certains algorithmes de chiffrement symétrique.

source: EVP_CIPHER_CTX_init() initializes cipher contex B<ctx>.
fr: B<EVP_CIPHER_CTX_init>() initialise le contexte de chiffrement I<ctx>.

source: EVP_EncryptInit_ex() sets up cipher context B<ctx> for encryption with cipher B<type> from ENGINE B<impl>. B<ctx> must be initialized before calling this function. B<type> is normally supplied by a function such as EVP_des_cbc(). If B<impl> is NULL then the default implementation is used. B<key> is the symmetric key to use and B<iv> is the IV to use (if necessary), the actual number of bytes used for the key and IV depends on the cipher. It is possible to set all parameters to NULL except B<type> in an initial call and supply the remaining parameters in subsequent calls, all of which have B<type> set to NULL. This is done when the default cipher parameters are not appropriate.
fr: B<EVP_EncryptInit_ex>() définit le contexte de chiffrement I<ctx> pour un chiffrement avec l’algorithme de I<type> de l’ENGINE I<impl>. I<ctx> doit être initialisé avant l’appel de cette fonction. I<type> est normalement fourni par une fonction telle que B<EVP_des_cbc>(). Si I<impl> est NULL, alors l’implémentation par défaut est utilisée. I<key> est la clef symétrique à utiliser et I<iv> est le vecteur d'initialisation à utiliser (si nécessaire) ; le nombre réel d’octets à utiliser pour la clef et le vecteur dépend de l’algorithme. Il est possible de définir tous les paramètres à NULL à l’exception de I<type> lors de l’appel initial et fournir les paramètres restants lors les prochains appels en ayant tous I<type> définis à NULL. Cela est fait quand les paramètres de l’algorithme ne sont pas adéquats.

source: EVP_EncryptUpdate() encrypts B<inl> bytes from the buffer B<in> and writes the encrypted version to B<out>. This function can be called multiple times to encrypt successive blocks of data. The amount of data written depends on the block alignment of the encrypted data: as a result the amount of data written may be anything from zero bytes to (inl + cipher_block_size - 1) so B<out> should contain sufficient room. The actual number of bytes written is placed in B<outl>.
fr: B<EVP_EncryptUpdate>() chiffre I<inl> octets du tampon I<in> et écrit le résultat dans I<out>. Cette fonction peut être appelée de multiples fois pour chiffrer des blocs successifs de données. Le total des données écrites est fonction de l’alignement des blocs : par conséquent, le total des données écrites peut être de zéro octet jusqu’à (inl + cipher_block_size − 1), aussi I<out> doit être suffisamment grand. Le nombre réel d’octets écrits est placé dans I<outl>.

source: If padding is enabled (the default) then EVP_EncryptFinal_ex() encrypts the "final" data, that is any data that remains in a partial block. It uses L<standard block padding|/NOTES> (aka PKCS padding). The encrypted final data is written to B<out> which should have sufficient space for one cipher block. The number of bytes written is placed in B<outl>. After this function is called the encryption operation is finished and no further calls to EVP_EncryptUpdate() should be made.
fr: Si le remplissage est activé (action par défaut), alors B<EVP_EncryptFinal_ex>() chiffre les données « finales », c’est-à-dire les données restantes dans un bloc incomplet. Pour cela, le L<remplissage par bloc standard|/NOTES> (alias remplissage PKCS) est utilisé. Les données finales chiffrées sont écrites dans I<out> qui doit être suffisamment grand pour un bloc chiffré. Le nombre d’octets écrits est placé dans I<outl>. Après l’appel de cette fonction l’opération de chiffrement est terminée et aucun appel ne peut plus être fait à B<EVP_EncryptUpdate>().

source: If padding is disabled then EVP_EncryptFinal_ex() will not encrypt any more data and it will return an error if any data remains in a partial block: that is if the total data length is not a multiple of the block size.
fr: Si le remplissage n’est pas activé, alors B<EVP_EncryptFinal_ex>() ne chiffrera plus aucune donnée et une erreur sera renvoyée si quelques données subsistent dans un bloc incomplet : c’est-à-dire, la taille totale des données n’est pas un multiple de la taille du bloc.

source: EVP_DecryptInit_ex(), EVP_DecryptUpdate() and EVP_DecryptFinal_ex() are the corresponding decryption operations. EVP_DecryptFinal() will return an error code if padding is enabled and the final block is not correctly formatted. The parameters and restrictions are identical to the encryption operations except that if padding is enabled the decrypted data buffer B<out> passed to EVP_DecryptUpdate() should have sufficient room for (B<inl> + cipher_block_size) bytes unless the cipher block size is 1 in which case B<inl> bytes is sufficient.
fr: B<EVP_DecryptInit_ex>(), B<EVP_DecryptUpdate>()et B<EVP_DecryptFinal_ex>() sont les opérations de déchiffrement correspondantes. B<EVP_DecryptFinal>() renverra un code d’erreur si le remplissage est activé et le bloc final non correctement formaté. Les paramètres et limitations sont identiques aux opérations de chiffrement à l’exception que, si le remplissage est activé, le tampon I<out> des données déchiffrées transmis pour B<EVP_DecryptUpdate>() doit être de taille suffisante pour (I<inl + cipher_block_size>) octets, à moins que la taille du bloc de chiffrement soit B<1>, auquel cas I<inl> octets sont suffisants.

source: EVP_CipherInit_ex(), EVP_CipherUpdate() and EVP_CipherFinal_ex() are functions that can be used for decryption or encryption. The operation performed depends on the value of the B<enc> parameter. It should be set to 1 for encryption, 0 for decryption and -1 to leave the value unchanged (the actual value of 'enc' being supplied in a previous call).
fr: B<EVP_CipherInit_ex>(), B<EVP_CipherUpdate>() et B<EVP_CipherFinal_ex>() sont des fonctions qui peuvent être utilisées pour le chiffrement et le déchiffrement. L’opération réalisée dépend de la valeur du paramètre I<enc>. Il doit être défini à B<1> pour le chiffrement, B<0> pour le déchiffrement et B<-1> pour ne pas changer sa valeur (la valeur du moment de « enc » fournie par un précédent appel).

source: EVP_CIPHER_CTX_cleanup() clears all information from a cipher context and free up any allocated memory associate with it. It should be called after all operations using a cipher are complete so sensitive information does not remain in memory.
fr: B<EVP_CIPHER_CTX_cleanup>() supprime toute donnée d’un contexte de chiffrement et libère toute mémoire qui lui soit allouée. Cette fonction doit être appelée après toute opération de chiffrement de façon qu’aucune donnée sensible ne subsiste en mémoire.

source: EVP_EncryptInit(), EVP_DecryptInit() and EVP_CipherInit() behave in a similar way to EVP_EncryptInit_ex(), EVP_DecryptInit_ex and EVP_CipherInit_ex() except the B<ctx> parameter does not need to be initialized and they always use the default cipher implementation.
fr: B<EVP_EncryptInit>(), B<EVP_DecryptInit>() et B<EVP_CipherInit>() se comportent de manière similaire à B<EVP_EncryptInit_ex>(), B<EVP_DecryptInit_ex> et B<EVP_CipherInit_ex>() à l’exception que les paramètres de I<ctx> n’ont nul besoin d’être initialisés et utilisent toujours l’implémentation par défaut de l’algorithme de chiffrement.

source: EVP_EncryptFinal(), EVP_DecryptFinal() and EVP_CipherFinal() behave in a similar way to EVP_EncryptFinal_ex(), EVP_DecryptFinal_ex() and EVP_CipherFinal_ex() except B<ctx> is automatically cleaned up after the call.
fr: B<EVP_EncryptFinal>(), B<EVP_DecryptFinal>() et B<EVP_CipherFinal>() se comportent de manière similaire à B<EVP_EncryptFinal_ex>(), B<EVP_DecryptFinal_ex>() et B<EVP_CipherFinal_ex>() à l’exception que I<ctx> est automatiquement nettoyé après l’appel.

source: EVP_get_cipherbyname(), EVP_get_cipherbynid() and EVP_get_cipherbyobj() return an EVP_CIPHER structure when passed a cipher name, a NID or an ASN1_OBJECT structure.
fr: B<EVP_get_cipherbyname>(), B<EVP_get_cipherbynid>() et B<EVP_get_cipherbyobj>() renvoient une structure B<EVP_CIPHER> lorsqu’un nom d’algorithme de chiffrement, un NID ou une structure B<ASN1_OBJECT> est fourni.

source: EVP_CIPHER_nid() and EVP_CIPHER_CTX_nid() return the NID of a cipher when passed an B<EVP_CIPHER> or B<EVP_CIPHER_CTX> structure. The actual NID value is an internal value which may not have a corresponding OBJECT IDENTIFIER.
fr: B<EVP_CIPHER_nid>() et B<EVP_CIPHER_CTX_nid>() renvoie l’identifiant NID d’un chiffrement lorsqu’une structure B<EVP_CIPHER> ou B<EVP_CIPHER_CTX> est fournie. La valeur courante du NID est une valeur interne qui pourrait ne pas avoir un OBJECT IDENTIFIER correspondant.

source: EVP_CIPHER_CTX_set_padding() enables or disables padding. By default encryption operations are padded using standard block padding and the padding is checked and removed when decrypting. If the B<pad> parameter is zero then no padding is performed, the total amount of data encrypted or decrypted must then be a multiple of the block size or an error will occur.
fr: B<EVP_CIPHER_CTX_set_padding>() autorise ou non le remplissage. Par défaut le remplissage des opérations de chiffrement est fait en utilisant le remplissage de bloc standard et est contrôlé puis supprimé lors du déchiffrement. Si le paramètre I<pad> vaut zéro, alors aucun remplissage n’est réalisé, le total des données chiffrées ou déchiffrées doit alors être un multiple de la taille de bloc ou une erreur s’ensuivra.

source: EVP_CIPHER_key_length() and EVP_CIPHER_CTX_key_length() return the key length of a cipher when passed an B<EVP_CIPHER> or B<EVP_CIPHER_CTX> structure. The constant B<EVP_MAX_KEY_LENGTH> is the maximum key length for all ciphers. Note: although EVP_CIPHER_key_length() is fixed for a given cipher, the value of EVP_CIPHER_CTX_key_length() may be different for variable key length ciphers.
fr: B<EVP_CIPHER_key_length>() et B<EVP_CIPHER_CTX_key_length>() renvoient la longueur de clef d’un chiffrement quand une structure B<EVP_CIPHER> ou B<EVP_CIPHER_CTX> est fournie. La constante B<EVP_MAX_KEY_LENGTH> est la longueur maximale de clef pour tous les algorithmes de chiffrement. Remarque : bien que B<EVP_CIPHER_key_length>() est déterminée pour un algorithme de chiffrement, la valeur de B<EVP_CIPHER_CTX_key_length>() peut être différente pour des longueurs de clef variables d’algorithme de chiffrement.

source: EVP_CIPHER_CTX_set_key_length() sets the key length of the cipher ctx. If the cipher is a fixed length cipher then attempting to set the key length to any value other than the fixed value is an error.
fr: B<EVP_CIPHER_CTX_set_key_length>() définit la longueur de clef d’un contexte de chiffrement. Si le chiffrement a une longueur fixe de clef, alors essayer de définir la longueur de clef à une valeur différente est fautif.

source: EVP_CIPHER_iv_length() and EVP_CIPHER_CTX_iv_length() return the IV length of a cipher when passed an B<EVP_CIPHER> or B<EVP_CIPHER_CTX>. It will return zero if the cipher does not use an IV. The constant B<EVP_MAX_IV_LENGTH> is the maximum IV length for all ciphers.
fr: B<EVP_CIPHER_iv_length>() et B<EVP_CIPHER_CTX_iv_length>() renvoient la longueur du vecteur d'initialisation du chiffrement lorsque est fournie B<EVP_CIPHER> ou B<EVP_CIPHER_CTX>. Zéro sera renvoyé si l’algorithme de chiffrement n’utilise pas de vecteur d'initialisation. La constante B<EVP_MAX_IV_LENGTH> est la longueur maximale du vecteur d'initialisation de tous les algorithmes de chiffrement.

source: EVP_CIPHER_block_size() and EVP_CIPHER_CTX_block_size() return the block size of a cipher when passed an B<EVP_CIPHER> or B<EVP_CIPHER_CTX> structure. The constant B<EVP_MAX_IV_LENGTH> is also the maximum block length for all ciphers.
fr: B<EVP_CIPHER_block_size>() et B<EVP_CIPHER_CTX_block_size3>() renvoie la taille de bloc d’un chiffrement lorsqu'est fourni une structure B<EVP_CIPHER> ou B<EVP_CIPHER_CTX>. La constante B<EVP_MAX_IV_LENGTH> est aussi la longueur maximale pour les algorithmes de chiffrement.

source: EVP_CIPHER_type() and EVP_CIPHER_CTX_type() return the type of the passed cipher or context. This "type" is the actual NID of the cipher OBJECT IDENTIFIER as such it ignores the cipher parameters and 40 bit RC2 and 128 bit RC2 have the same NID. If the cipher does not have an object identifier or does not have ASN1 support this function will return B<NID_undef>.
fr: B<EVP_CIPHER_type>() et B<EVP_CIPHER_CTX_type>() renvoient le type des algorithmes de chiffrement ou de contexte. Ce « type » est l’identifiant NID réel de OBJECT IDENTIFIER du chiffrement et donc ignore les paramètres de l’algorithme, et RC2 40 bits et RC2 128 bits ont le même NID. Si l’algorithme n’a pas d’identifiant objet ou n’est pas pris en charge par ASN1, cette fonction renverra B<NID_undef>.

source: EVP_CIPHER_CTX_cipher() returns the B<EVP_CIPHER> structure when passed an B<EVP_CIPHER_CTX> structure.
fr: B<EVP_CIPHER_CTX_cipher>() renvoie la structure B<EVP_CIPHER> lorsqu’est fournie une structure B<EVP_CIPHER_CTX>.

source: EVP_CIPHER_mode() and EVP_CIPHER_CTX_mode() return the block cipher mode: EVP_CIPH_ECB_MODE, EVP_CIPH_CBC_MODE, EVP_CIPH_CFB_MODE or EVP_CIPH_OFB_MODE. If the cipher is a stream cipher then EVP_CIPH_STREAM_CIPHER is returned.
fr: B<EVP_CIPHER_mode>() et B<EVP_CIPHER_CTX_mode>() renvoient le mode de chiffrement par bloc : B<EVP_CIPH_ECB_MODE>, B<EVP_CIPH_CBC_MODE>, B<EVP_CIPH_CFB_MODE> ou B<EVP_CIPH_OFB_MODE>. Si le chiffrement est un chiffrement par flot, alors B<EVP_CIPH_STREAM_CIPHER> est renvoyé.

source: EVP_CIPHER_param_to_asn1() sets the AlgorithmIdentifier "parameter" based on the passed cipher. This will typically include any parameters and an IV. The cipher IV (if any) must be set when this call is made. This call should be made before the cipher is actually "used" (before any EVP_EncryptUpdate(), EVP_DecryptUpdate() calls for example). This function may fail if the cipher does not have any ASN1 support.
fr: B<EVP_CIPHER_param_to_asn1>() définit le « paramètre » B<AlgorithmIdentifier> en fonction de l’algorithme de chiffrement fourni. Classiquement, cela inclut n’importe quel paramètre et un vecteur d'initialisation. Le vecteur du chiffrement (s’il existe) doit être défini quand cet appel est fait. Cet appel doit être fait avant que l’algorithme soit pratiquement « utilisé » (avant n’importe quel appel B<EVP_EncryptUpdate>(), B<EVP_DecryptUpdate>() par exemple). Cette fonction peut échouer si l’algorithme n’est nullement pris en charge par ASN1.

source: EVP_CIPHER_asn1_to_param() sets the cipher parameters based on an ASN1 AlgorithmIdentifier "parameter". The precise effect depends on the cipher In the case of RC2, for example, it will set the IV and effective key length. This function should be called after the base cipher type is set but before the key is set. For example EVP_CipherInit() will be called with the IV and key set to NULL, EVP_CIPHER_asn1_to_param() will be called and finally EVP_CipherInit() again with all parameters except the key set to NULL. It is possible for this function to fail if the cipher does not have any ASN1 support or the parameters cannot be set (for example the RC2 effective key length is not supported.
fr: B<EVP_CIPHER_asn1_to_param>() définit les paramètres de l’algorithme de chiffrement en fonction des « paramètres » ASN1 B<AlgorithmIdentifier>. L’effet exact dépend de l’algorithme. Dans le cas de RC2 par exemple, le vecteur d'initialisation et la clef utilisée seront définis. Cette fonction devrait être appelée après que le type de l’algorithme de base soit défini mais avant que la clef ne soit définie. Par exemple B<EVP_CipherInit>() sera appelée avec le vecteur et la clef définis à NULL, B<EVP_CIPHER_asn1_to_param>() sera appelée puis finalement B<EVP_CipherInit>() le sera avec tous les paramètres sauf la clef définie à NULL. Il est possible que cette fonction échoue si l’algorithme n’est nullement pris en charge par ASN1 ou que les paramètres ne peuvent être définis (par exemple, la longueur réelle de la clef RC2 n’est pas prise en charge).

source: EVP_CIPHER_CTX_ctrl() allows various cipher specific parameters to be determined and set.
fr: B<EVP_CIPHER_CTX_ctrl>() permet de déterminer et définir les paramètres particuliers de différents algorithmes.

source: EVP_EncryptInit_ex(), EVP_EncryptUpdate() and EVP_EncryptFinal_ex() return 1 for success and 0 for failure.
fr: B<EVP_EncryptInit_ex>(), B<EVP_EncryptUpdate>() et B<EVP_EncryptFinal_ex>() renvoient B<1> lors d’un succès et B<0> lors d’un échec.

source: EVP_DecryptInit_ex() and EVP_DecryptUpdate() return 1 for success and 0 for failure. EVP_DecryptFinal_ex() returns 0 if the decrypt failed or 1 for success.
fr: B<EVP_DecryptInit_ex>() et B<EVP_DecryptUpdate>() renvoient B<1> lors d’un succès et B<0> lors d’un échec. B<EVP_DecryptFinal_ex>() renvoie B<0> si le déchiffrement est un échec ou B<1> si c’est une réussite.

source: EVP_CipherInit_ex() and EVP_CipherUpdate() return 1 for success and 0 for failure. EVP_CipherFinal_ex() returns 0 for a decryption failure or 1 for success.
fr: B<EVP_CipherInit_ex>() et B<EVP_CipherUpdate>() renvoient B<1> pour un succès et B<0> pour un échec. B<EVP_CipherFinal_ex>() renvoie B<0> pour un échec de déchiffrement et B<1> pour une réussite.

source: EVP_CIPHER_CTX_cleanup() returns 1 for success and 0 for failure.
fr: B<EVP_CIPHER_CTX_cleanup>() renvoie B<1> pour un succès et B<0> pour un échec.

source: EVP_get_cipherbyname(), EVP_get_cipherbynid() and EVP_get_cipherbyobj() return an B<EVP_CIPHER> structure or NULL on error.
fr: B<EVP_get_cipherbyname>(), B<EVP_get_cipherbynid>() et B<EVP_get_cipherbyobj>() renvoient une structure B<EVP_CIPHER> ou NULL en cas d’erreur.

source: EVP_CIPHER_nid() and EVP_CIPHER_CTX_nid() return a NID.
fr: B<EVP_CIPHER_nid>() et B<EVP_CIPHER_CTX_nid>() renvoient un identifiant NID.

source: EVP_CIPHER_block_size() and EVP_CIPHER_CTX_block_size() return the block size.
fr: B<EVP_CIPHER_block_size>() et B<EVP_CIPHER_CTX_block_size>() renvoient la taille de bloc.

source: EVP_CIPHER_key_length() and EVP_CIPHER_CTX_key_length() return the key length.
fr: B<EVP_CIPHER_key_length>() et B<EVP_CIPHER_CTX_key_length>() renvoient la longueur de clef.

source: EVP_CIPHER_CTX_set_padding() always returns 1.
fr: B<EVP_CIPHER_CTX_set_padding>() renvoie toujours B<1>.

source: EVP_CIPHER_iv_length() and EVP_CIPHER_CTX_iv_length() return the IV length or zero if the cipher does not use an IV.
fr: B<EVP_CIPHER_iv_length>() et B<EVP_CIPHER_CTX_iv_length>() renvoient la longueur du vecteur d'initialisation ou B<0> si l’algorithme de chiffrement n’utilise pas de vecteur.

source: EVP_CIPHER_type() and EVP_CIPHER_CTX_type() return the NID of the cipher's OBJECT IDENTIFIER or NID_undef if it has no defined OBJECT IDENTIFIER.
fr: B<EVP_CIPHER_type>() et B<EVP_CIPHER_CTX_type>() renvoient le NID du OBJECT IDENTIFIER de l’algorithme de chiffrement ou B<NID_undef> s’il n’a aucun OBJECT IDENTIFIER de défini.

source: EVP_CIPHER_CTX_cipher() returns an B<EVP_CIPHER> structure.
fr: B<EVP_CIPHER_CTX_cipher>() renvoie une structure B<EVP_CIPHER>.

source: EVP_CIPHER_param_to_asn1() and EVP_CIPHER_asn1_to_param() return 1 for success or zero for failure.
fr: B<EVP_CIPHER_param_to_asn1>() et B<EVP_CIPHER_asn1_to_param>() renvoient B<1> pour une réussite ou zéro pour un échec.

source: CIPHER LISTING
fr: LISTE DES ALGORITHMES DE CHIFFREMENT

source: All algorithms have a fixed key length unless otherwise stated.
fr: Tous les algorithmes ont une longueur fixe de clef sauf stipulation contraire.

source: EVP_enc_null()
fr: B<EVP_enc_null>()

source: Null cipher: does nothing.
fr: Algorithme NULL, sans action

source: EVP_des_cbc(void), EVP_des_ecb(void), EVP_des_cfb(void), EVP_des_ofb(void)
fr: B<EVP_des_cbc>(void), B<EVP_des_ecb>(void), B<EVP_des_cfb>(void), B<EVP_des_ofb>(void)

source: DES in CBC, ECB, CFB and OFB modes respectively.
fr: Respectivement, DES avec les modes CBC, ECB, CFB et OFB.

source: EVP_des_ede_cbc(void), EVP_des_ede(), EVP_des_ede_ofb(void), EVP_des_ede_cfb(void)
fr: B<EVP_des_ede_cbc>(void), B<EVP_des_ede>(), B<EVP_des_ede_ofb>(void), B<EVP_des_ede_cfb>(void)

source: Two key triple DES in CBC, ECB, CFB and OFB modes respectively.
fr: Respectivement, triple DES à deux clefs avec les modes CBC, ECB, CFB et OFB.

source: EVP_des_ede3_cbc(void), EVP_des_ede3(), EVP_des_ede3_ofb(void), EVP_des_ede3_cfb(void)
fr: B<EVP_des_ede3_cbc>(void), B<EVP_des_ede3>(), B<EVP_des_ede3_ofb>(void), B<EVP_des_ede3_cfb>(void)

source: Three key triple DES in CBC, ECB, CFB and OFB modes respectively.
fr: Respectivement, triple DES à trois clefs avec les modes CBC, ECB, CFB et OFB.

source: EVP_desx_cbc(void)
fr: B<EVP_desx_cbc>(void)

source: DESX algorithm in CBC mode.
fr: Algorithme DESX avec le mode CBC.

source: EVP_rc4(void)
fr: B<EVP_rc4>(void)

source: RC4 stream cipher. This is a variable key length cipher with default key length 128 bits.
fr: Chiffrement par flot RC4. Algorithme avec une longueur de clef variable, par défaut 128 bits.

source: EVP_rc4_40(void)
fr: B<EVP_rc4_40>(void)

source: RC4 stream cipher with 40 bit key length. This is obsolete and new code should use EVP_rc4() and the EVP_CIPHER_CTX_set_key_length() function.
fr: Algorithme de chiffrement RC4 avec une longueur de clef de 40 bits. Obsolète, de préférence utiliser B<EVP_rc4>() et la fonction B<EVP_CIPHER_CTX_set_key_length>().

source: EVP_idea_cbc() EVP_idea_ecb(void), EVP_idea_cfb(void), EVP_idea_ofb(void), EVP_idea_cbc(void)
fr: B<EVP_idea_cbc>() B<EVP_idea_ecb>(void), B<EVP_idea_cfb>(void), B<EVP_idea_ofb>(void), B<EVP_idea_cbc>(void)

source: IDEA encryption algorithm in CBC, ECB, CFB and OFB modes respectively.
fr: Algorithme de chiffrement IDEA avec les modes CBC, ECB, CFB et OFB respectivement.

source: EVP_rc2_cbc(void), EVP_rc2_ecb(void), EVP_rc2_cfb(void), EVP_rc2_ofb(void)
fr: B<EVP_rc2_cbc>(void), B<EVP_rc2_ecb>(void), B<EVP_rc2_cfb>(void), B<EVP_rc2_ofb>(void)
