Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/evp/po/*.po
Languages: fr

source: EVP_OpenUpdate() returns 1 for success or 0 for failure.
fr: B<EVP_OpenUpdate>() renvoie B<1> en cas de réussite et B<0> en cas d'échec.

source: EVP_OpenFinal() returns 0 if the decrypt failed or 1 for success.
fr: B<EVP_OpenFinal>() renvoie B<0> en cas de déchiffrement raté et B<1> en cas de réussite.

source: L<evp(3)|evp(3)>, L<rand(3)|rand(3)>, L<EVP_EncryptInit(3)|EVP_EncryptInit(3)>, L<EVP_SealInit(3)|EVP_SealInit(3)>
fr: L<B<evp>(3)|evp(3)>, L<B<rand>(3)|rand(3)>, L<B<EVP_EncryptInit>(3)|EVP_EncryptInit(3)>, L<B<EVP_SealInit>(3)|EVP_SealInit(3)>

source: EVP_SealInit, EVP_SealUpdate, EVP_SealFinal - EVP envelope encryption
fr: EVP_SealInit, EVP_SealUpdate, EVP_SealFinal - Chiffrement d’enveloppe EVP

source: int EVP_SealInit(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, unsigned char **ek, int *ekl, unsigned char *iv, EVP_PKEY **pubk, int npubk); int EVP_SealUpdate(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl, unsigned char *in, int inl); int EVP_SealFinal(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl);
fr: B< int EVP_SealInit(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<unsigned char **>I<ek>B<, int *>I<ekl>B<, unsigned char *>I<iv>B<,> B<EVP_PKEY **>I<pubk>B<, int> I<npubk>B<);> B<int EVP_SealUpdate(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<out>B<,> B<int *outl, unsigned char *in, int inl);> B<int EVP_SealFinal(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *out,> B<int *outl);>

source: The EVP envelope routines are a high level interface to envelope encryption. They generate a random key and IV (if required) then "envelope" it by using public key encryption. Data can then be encrypted using this key.
fr: Les routines d’enveloppe EVP sont des interfaces de haut niveau pour le chiffrement d’enveloppe. Elles produisent une clef aléatoire et un vecteur d'initialisation (si nécessaire) puis les « enveloppent » en utilisant une clef de chiffrement publique. Les données peuvent être chiffrées en utilisant cette clef.

source: EVP_SealInit() initializes a cipher context B<ctx> for encryption with cipher B<type> using a random secret key and IV. B<type> is normally supplied by a function such as EVP_des_cbc(). The secret key is encrypted using one or more public keys, this allows the same encrypted data to be decrypted using any of the corresponding private keys. B<ek> is an array of buffers where the public key encrypted secret key will be written, each buffer must contain enough room for the corresponding encrypted key: that is B<ek[i]> must have room for B<EVP_PKEY_size(pubk[i])> bytes. The actual size of each encrypted secret key is written to the array B<ekl>. B<pubk> is an array of B<npubk> public keys.
fr: B<EVP_SealInit>() initialise un contexte de chiffrement I<ctx> pour un chiffrement avec l’algorithme I<type> en utilisant une clef secrète et un vecteur d'initialisation. I<type> est normalement fourni par une fonction telle que B<EVP_des_cbc>(). La clef secrète est chiffrée en utilisant une ou plusieurs clefs publiques, permettant aux mêmes données d’être déchiffrées avec n’importe quelle clef privée correspondante. I<ek> est un tableau de tampons où la clef secrète, chiffrée avec la clef publique, sera écrite, chaque tampon étant suffisamment grand pour la clef chiffrée correspondante : I<ek[i]> doit pouvoir contenir EVP_PKEY_size(pubk[i]) octets. La taille réelle de chaque clef chiffrée est écrite dans le tableau I<ekl>. I<pubk> est un tableau de I<npubk> clefs publiques.

source: The B<iv> parameter is a buffer where the generated IV is written to. It must contain enough room for the corresponding cipher's IV, as determined by (for example) EVP_CIPHER_iv_length(type).
fr: Le paramètre I<iv> est un tampon où le vecteur d'initialisation créé est écrit. Il doit pouvoir contenir le vecteur d'initialisation correspondant de l’algorithme de chiffrement, tel qu’il est déterminé par (par exemple) EVP_CIPHER_iv_length(type).

source: If the cipher does not require an IV then the B<iv> parameter is ignored and can be B<NULL>.
fr: Si l’algorithme de chiffrement ne demande pas de vecteur d'initialisation, alors le paramètre I<iv> est ignoré et peut être NULL.

source: EVP_SealUpdate() and EVP_SealFinal() have exactly the same properties as the EVP_EncryptUpdate() and EVP_EncryptFinal() routines, as documented on the L<EVP_EncryptInit(3)|EVP_EncryptInit(3)> manual page.
fr: B<EVP_SealUpdate>() et B<EVP_SealFinal>() ont exactement les mêmes propriétés que les routines B<EVP_EncryptUpdate>() et B<EVP_EncryptFinal>(), comme documentées dans la page de manuel L<B<EVP_EncryptInit>(3)|EVP_EncryptInit(3)>.

source: EVP_SealInit() returns 0 on error or B<npubk> if successful.
fr: B<EVP_SealInit>() renvoie B<0> lors d’une erreur ou I<npubk> en cas de réussite.

source: EVP_SealUpdate() and EVP_SealFinal() return 1 for success and 0 for failure.
fr: B<EVP_SealUpdate>() et B<EVP_SealFinal>() renvoient B<1> en cas de réussite et B<0> lors d’une erreur.

source: Because a random secret key is generated the random number generator must be seeded before calling EVP_SealInit().
fr: Parce qu’une clef secrète est créée, la graine du générateur de nombre aléatoire doit être enlevée avant l’appel à B<EVP_SealInit>().

source: The public key must be RSA because it is the only OpenSSL public key algorithm that supports key transport.
fr: La clef publique doit être RSA car c’est le seul algorithme à clef publique d’OpenSSl qui prend en charge l’acheminement de clef.

source: Envelope encryption is the usual method of using public key encryption on large amounts of data, this is because public key encryption is slow but symmetric encryption is fast. So symmetric encryption is used for bulk encryption and the small random symmetric key used is transferred using public key encryption.
fr: Le chiffrement d’enveloppe est la méthode habituelle pour le chiffrement à clef publique de grandes quantités de données, cela parce que le chiffrement à clef publique est lent mais le chiffrement symétrique est rapide. Aussi le chiffrement symétrique est utilisé pour la majeure partie du chiffrement et la petite clef symétrique aléatoire utilisée est transférée en utilisant le chiffrement à clef publique.

source: It is possible to call EVP_SealInit() twice in the same way as EVP_EncryptInit(). The first call should have B<npubk> set to 0 and (after setting any cipher parameters) it should be called again with B<type> set to NULL.
fr: Il est possible d’appeler B<EVP_SealInit>() deux fois de la même façon que B<EVP_EncryptInit>(). Le premier appel devrait avoir I<npubk> défini à B<0> et (après avoir défini tous les paramètres du chiffrement) l’appel devrait être fait avec I<type> défini à NULL.

source: L<evp(3)|evp(3)>, L<rand(3)|rand(3)>, L<EVP_EncryptInit(3)|EVP_EncryptInit(3)>, L<EVP_OpenInit(3)|EVP_OpenInit(3)>
fr: L<B<evp>(3)|evp(3)>, L<B<rand>(3)|rand(3)>, L<B<EVP_EncryptInit>(3)|EVP_EncryptInit(3)>, L<B<EVP_OpenInit>(3)|EVP_OpenInit(3)>

source: EVP_SealFinal() did not return a value before OpenSSL 0.9.7.
fr: B<EVP_SealFinal>() ne renvoyait pas de valeur avant OpenSSL 0.9.7.

source: EVP_SignInit, EVP_SignUpdate, EVP_SignFinal - EVP signing functions
fr: EVP_SignInit, EVP_SignUpdate, EVP_SignFinal - Fonctions de signature EVP

source: int EVP_SignInit_ex(EVP_MD_CTX *ctx, const EVP_MD *type, ENGINE *impl); int EVP_SignUpdate(EVP_MD_CTX *ctx, const void *d, unsigned int cnt); int EVP_SignFinal(EVP_MD_CTX *ctx,unsigned char *sig,unsigned int *s, EVP_PKEY *pkey);
fr: B< int EVP_SignInit_ex(EVP_MD_CTX *>I<ctx>B<, const EVP_MD *>I<type>B<, ENGINE *>I<impl>B<);> B<int EVP_SignUpdate(EVP_MD_CTX *>I<ctx>B<, const void *>I<d>B<, unsigned int> I<cnt>B<);> B<int EVP_SignFinal(EVP_MD_CTX *>I<ctx>B<,unsigned char *>I<sig>B<,unsigned int *>I<s>B<, EVP_PKEY *>I<pkey>B<);>

source: void EVP_SignInit(EVP_MD_CTX *ctx, const EVP_MD *type);
fr: B< void EVP_SignInit(EVP_MD_CTX *>I<ctx>B<, const EVP_MD *>I<type>B<);>

source: int EVP_PKEY_size(EVP_PKEY *pkey);
fr: B< int EVP_PKEY_size(EVP_PKEY *>I<pkey>B<);>

source: EVP_SignInit_ex() sets up signing context B<ctx> to use digest B<type> from ENGINE B<impl>. B<ctx> must be initialized with EVP_MD_CTX_init() before calling this function.
fr: B<EVP_SignInit_ex>() configure le contexte de signature I<ctx> pour utiliser l’algorithme de hachage I<type> à partir de l’ENGINE I<impl>. I<ctx> doit être initialisé avec B<EVP_MD_CTX_init>() avant d’appeler cette fonction.

source: EVP_SignUpdate() hashes B<cnt> bytes of data at B<d> into the signature context B<ctx>. This function can be called several times on the same B<ctx> to include additional data.
fr: B<EVP_SignUpdate>() produit un hachage de I<cnt> octets de I<d> dans le contexte de signature I<ctx>. Cette fonction peut être appelée plusieurs fois sur le même contexte pour incorporer des données supplémentaires.

source: EVP_SignFinal() signs the data in B<ctx> using the private key B<pkey> and places the signature in B<sig>. B<sig> must be at least EVP_PKEY_size(pkey) bytes in size. B<s> is an OUT paramter, and not used as an IN parameter. The number of bytes of data written (i.e. the length of the signature) will be written to the integer at B<s>, at most EVP_PKEY_size(pkey) bytes will be written.
fr: B<EVP_SignFinal>() signe les données dans le I<ctx> en utilisant la clef privée I<pkey> et met la signature dans I<sig>. I<sig> doit être au moins de taille EVP_PKEY_size(pkey) octets. I<s> est un paramètre OUT, et n’est pas utilisé comme un paramètre IN. Le nombre d’octets de données écrits (par exemple la longueur de la signature) sera écrit en nombre entier à I<s>, au plus EVP_PKEY_size(pkey) octets seront écrits.

source: EVP_SignInit() initializes a signing context B<ctx> to use the default implementation of digest B<type>.
fr: B<EVP_SignInit>() initialise un contexte de signature I<ctx> pour utiliser l’implémentation par défaut de l’algorithme de hachage I<type>.

source: EVP_PKEY_size() returns the maximum size of a signature in bytes. The actual signature returned by EVP_SignFinal() may be smaller.
fr: B<EVP_PKEY_size>() renvoie la taille maximale de signature en octet. La signature réelle renvoyée par B<EVP_SignFinal>() peut être plus petite.

source: EVP_SignInit_ex(), EVP_SignUpdate() and EVP_SignFinal() return 1 for success and 0 for failure.
fr: B<EVP_SignInit_ex>(), B<EVP_SignUpdate>() et B<EVP_SignFinal>() renvoient B<1> en cas de réussite et B<0> en cas d'échec.

source: EVP_PKEY_size() returns the maximum size of a signature in bytes.
fr: B<EVP_PKEY_size>() renvoie la taille maximale de la signature en octet.

source: The error codes can be obtained by L<ERR_get_error(3)|ERR_get_error(3)>.
fr: Les codes d'erreur peuvent être obtenus par L<B<ERR_get_error>(3)|ERR_get_error(3)>.

source: Due to the link between message digests and public key algorithms the correct digest algorithm must be used with the correct public key type. A list of algorithms and associated public key algorithms appears in L<EVP_DigestInit(3)|EVP_DigestInit(3)>.
fr: En raison du lien entre les algorithmes de hachage de message et les algorithmes à clef publique, l’algorithme de hachage adéquat doit être utilisé avec le bon type de clef publique. Une liste d’algorithmes et leurs algorithmes à clef publique associés est incluse dans L<B<EVP_DigestInit>(3)|EVP_DigestInit(3)>.

source: When signing with DSA private keys the random number generator must be seeded or the operation will fail. The random number generator does not need to be seeded for RSA signatures.
fr: Lors de la signature avec les clefs privées DSA, le générateur de nombre aléatoire doit être égrainé sinon l’opération échouera. Le générateur n’a nul besoin de graine pour les signatures RSA.

source: The call to EVP_SignFinal() internally finalizes a copy of the digest context. This means that calls to EVP_SignUpdate() and EVP_SignFinal() can be called later to digest and sign additional data.
fr: L’appel à B<EVP_SignFinal>(), de manière interne, réalise une copie du contexte du hachage. Cela signifie que des appels à B<EVP_SignUpdate>() et B<EVP_SignFinal>() peuvent être faits ultérieurement pour un hachage et une signature de données additionnelles.

source: Older versions of this documentation wrongly stated that calls to EVP_SignUpdate() could not be made after calling EVP_SignFinal().
fr: De vieilles versions de cette documentation affirment faussement que des appels à B<EVP_SignUpdate>() ne peuvent être réalisés après l’appel à B<EVP_SignFinal>().

source: Since the private key is passed in the call to EVP_SignFinal() any error relating to the private key (for example an unsuitable key and digest combination) will not be indicated until after potentially large amounts of data have been passed through EVP_SignUpdate().
fr: Puisque la clef privée est fournie dans l’appel à B<EVP_SignFinal>(), aucune erreur en rapport avec la clef privée (par exemple une association impropre de clef et d’algorithme de hachage) ne sera signalée avant que de grandes quantités potentielles ne soient fournies par B<EVP_SignUpdate>().

source: It is not possible to change the signing parameters using these function.
fr: Changer les paramètres de signature n’est pas possible avec ces fonctions.

source: The previous two bugs are fixed in the newer EVP_SignDigest*() function.
fr: Ces deux bogues sont corrigés dans la nouvelle fonction B<EVP_SignDigest*>().

source: L<EVP_VerifyInit(3)|EVP_VerifyInit(3)>, L<EVP_DigestInit(3)|EVP_DigestInit(3)>, L<err(3)|err(3)>, L<evp(3)|evp(3)>, L<hmac(3)|hmac(3)>, L<md2(3)|md2(3)>, L<md5(3)|md5(3)>, L<mdc2(3)|mdc2(3)>, L<ripemd(3)|ripemd(3)>, L<sha(3)|sha(3)>, L<dgst(1)|dgst(1)>
fr: L<B<EVP_VerifyInit>(3)|EVP_VerifyInit(3)>, L<B<EVP_DigestInit>(3)|EVP_DigestInit(3)>, L<B<err>(3)|err(3)>, L<B<evp>(3)|evp(3)>, L<B<hmac>(3)|hmac(3)>, L<B<md2>(3)|md2(3)>, L<B<md5>(3)|md5(3)>, L<B<mdc2>(3)|mdc2(3)>, L<<ripemd>(3)|ripemd(3)>, L<B<sha>(3)|sha(3)>, L<B<dgst>(1)|dgst(1)>

source: EVP_SignInit(), EVP_SignUpdate() and EVP_SignFinal() are available in all versions of SSLeay and OpenSSL.
fr: B<EVP_SignInit>(), B<EVP_SignUpdate>() et B<EVP_SignFinal>() sont disponibles dans toutes les versions de SSLeay et OpenSSL.

source: EVP_SignInit_ex() was added in OpenSSL 0.9.7.
fr: B<EVP_SignInit_ex>() a été ajoutée dans OpenSSL 0.9.7.

source: EVP_VerifyInit, EVP_VerifyUpdate, EVP_VerifyFinal - EVP signature verification functions
fr: EVP_VerifyInit, EVP_VerifyUpdate, EVP_VerifyFinal - Fonctions de vérification de signature EVP

source: int EVP_VerifyInit_ex(EVP_MD_CTX *ctx, const EVP_MD *type, ENGINE *impl); int EVP_VerifyUpdate(EVP_MD_CTX *ctx, const void *d, unsigned int cnt); int EVP_VerifyFinal(EVP_MD_CTX *ctx,unsigned char *sigbuf, unsigned int siglen,EVP_PKEY *pkey);
fr: B< int EVP_VerifyInit_ex(EVP_MD_CTX *>I<ctx>B<, const EVP_MD *>I<type>B<, ENGINE *>I<impl>B<);> B<int EVP_VerifyUpdate(EVP_MD_CTX *>I<ctx>B<, const void *>I<d>B<, unsigned int> I<cnt>B<);> B<int EVP_VerifyFinal(EVP_MD_CTX *>I<ctx>B<,unsigned char *>I<sigbuf>B<, unsigned int> I<siglen>B<,EVP_PKEY *>I<pkey>B<);>

source: int EVP_VerifyInit(EVP_MD_CTX *ctx, const EVP_MD *type);
fr: B< int EVP_VerifyInit(EVP_MD_CTX *>I<ctx>B<, const EVP_MD *>I<type>B<);>

source: The EVP signature verification routines are a high level interface to digital signatures.
fr: Les routines de vérification de signature constituent une interface de haut niveau pour les signatures numériques.

source: EVP_VerifyInit_ex() sets up verification context B<ctx> to use digest B<type> from ENGINE B<impl>. B<ctx> must be initialized by calling EVP_MD_CTX_init() before calling this function.
fr: B<EVP_VerifyInit_ex>() configure le contexte de vérification I<ctx> pour utiliser l’algorithme de hachage de I<type> à partir de l’ENGINE I<impl>. I<ctx> doit être initialisé en appelant B<EVP_MD_CTX_init>() avant cette fonction.

source: EVP_VerifyUpdate() hashes B<cnt> bytes of data at B<d> into the verification context B<ctx>. This function can be called several times on the same B<ctx> to include additional data.
fr: B<EVP_VerifyUpdate>() produit un hachage de I<cnt> octets de données à I<d> dans le contexte de vérification I<ctx>. Cette fonction peut être appelée plusieurs fois sur le même contexte I<ctx> pour incorporer des données additionnelles.

source: EVP_VerifyFinal() verifies the data in B<ctx> using the public key B<pkey> and against the B<siglen> bytes at B<sigbuf>.
fr: B<EVP_VerifyFinal>() vérifie les données dans le I<ctx> en utilisant la clef publique I<pkey> et par rapport à I<siglen> octets de I<sigbuf>.

source: EVP_VerifyInit() initializes verification context B<ctx> to use the default implementation of digest B<type>.
fr: B<EVP_VerifyInit>() initialise le contexte de vérification I<ctx> pour utiliser l’implémentation par défaut de l’algorithme de hachage I<type>.

source: EVP_VerifyInit_ex() and EVP_VerifyUpdate() return 1 for success and 0 for failure.
fr: B<EVP_VerifyInit_ex>() et B<EVP_VerifyUpdate>() renvoient B<1> en cas de réussite et B<0> en cas d’échec.

source: EVP_VerifyFinal() returns 1 for a correct signature, 0 for failure and -1 if some other error occurred.
fr: B<EVP_VerifyFinal>() renvoie B<1> si la signature est correcte, B<0> si elle est incorrecte et B<-1> pour tout autre erreur.

source: The call to EVP_VerifyFinal() internally finalizes a copy of the digest context. This means that calls to EVP_VerifyUpdate() and EVP_VerifyFinal() can be called later to digest and verify additional data.
fr: L’appel à B<EVP_VerifyFinal>(), de manière interne, réalise une copie du contexte de hachage. Cela signifie que des appels à B<EVP_VerifyUpdate>() et B<EVP_VerifyFinal>() peuvent être faits ultérieurement pour un hachage et une vérification de données additionnelles.

source: Older versions of this documentation wrongly stated that calls to EVP_VerifyUpdate() could not be made after calling EVP_VerifyFinal().
fr: De vieilles versions de cette documentation affirment faussement que des appels à B<EVP_VerifyUpdate>() ne peuvent être réalisés après l’appel à B<EVP_VerifyFinal>().

source: Since the public key is passed in the call to EVP_SignFinal() any error relating to the private key (for example an unsuitable key and digest combination) will not be indicated until after potentially large amounts of data have been passed through EVP_SignUpdate().
fr: Puisque la clef privée est fournie dans l’appel à B<EVP_SignFinal>(), aucune erreur en rapport avec la clef privée (par exemple une association impropre de clef et d’algorithme de hachage) ne sera signalée avant que de grandes quantités potentielles ne soient fournies par B<EVP_SignUpdate>().

source: The previous two bugs are fixed in the newer EVP_VerifyDigest*() function.
fr: Les deux bogues précédents sont corrigés dans la nouvelle fonction B<EVP_VerifyDigest*>().

source: L<evp(3)|evp(3)>, L<EVP_SignInit(3)|EVP_SignInit(3)>, L<EVP_DigestInit(3)|EVP_DigestInit(3)>, L<err(3)|err(3)>, L<evp(3)|evp(3)>, L<hmac(3)|hmac(3)>, L<md2(3)|md2(3)>, L<md5(3)|md5(3)>, L<mdc2(3)|mdc2(3)>, L<ripemd(3)|ripemd(3)>, L<sha(3)|sha(3)>, L<dgst(1)|dgst(1)>
fr: L<B<evp>(3)|evp(3)>, L<B<EVP_SignInit>(3)|EVP_SignInit(3)>, L<B<EVP_DigestInit>(3)|EVP_DigestInit(3)>, L<B<err>(3)|err(3)>, L<B<evp>(3)|evp(3)>, L<B<hmac>(3)|hmac(3)>, L<B<md2>(3)|md2(3)>, L<B<md5>(3)|md5(3)>, L<B<mdc2>(3)|mdc2(3)>, L<B<ripemd>(3)|ripemd(3)>, L<B<sha>(3)|sha(3)>, L<B<dgst>(1)|dgst(1)>

source: EVP_VerifyInit(), EVP_VerifyUpdate() and EVP_VerifyFinal() are available in all versions of SSLeay and OpenSSL.
fr: B<EVP_VerifyInit>(), B<EVP_VerifyUpdate>() et B<EVP_VerifyFinal>() sont disponibles dans toutes les versions de SSLeay et OpenSSL.

source: EVP_VerifyInit_ex() was added in OpenSSL 0.9.7
fr: B<EVP_VerifyInit_ex>() a été ajoutée dans OpenSSL 0.9.7

source: evp - high-level cryptographic functions
fr: evp - Fonctions cryptographiques de haut niveau

source: The EVP library provides a high-level interface to cryptographic functions.
fr: La bibliothèque EVP fournit une interface haut niveau aux fonctions cryptographiques.

source: L<B<EVP_Seal>I<...>|EVP_SealInit(3)> and L<B<EVP_Open>I<...>|EVP_OpenInit(3)> provide public key encryption and decryption to implement digital "envelopes".
fr: L<B<EVP_Seal>I<...>|EVP_SealInit(3)> et L<B<EVP_Open>I<...>|EVP_OpenInit(3)> fournissent le chiffrement et le déchiffrement à clef publique pour implémenter des « enveloppes » numériques.

source: The L<B<EVP_DigestSign>I<...>|EVP_DigestSignInit(3)> and L<B<EVP_DigestVerify>I<...>|EVP_DigestVerifyInit(3)> functions implement digital signatures and Message Authentication Codes (MACs). Also see the older L<B<EVP_Sign>I<...>|EVP_SignInit(3)> and L<B<EVP_Verify>I<...>|EVP_VerifyInit(3)> functions.
fr: Les fonctions L<B<EVP_DigestSign>I<...>|EVP_DigestSignInit(3)> et L<B<EVP_DigestVerify>I<...>|EVP_DigestVerifyInit(3)> mettent en œuvre des signatures numériques et des codes d’authentification de message (MAC). Aussi les fonctions anciennes L<B<EVP_Sign>I<...>|EVP_SignInit(3)> et L<B<EVP_Verify>I<...>|EVP_VerifyInit(3)> sont à considérer.

source: Symmetric encryption is available with the L<B<EVP_Encrypt>I<...>|EVP_EncryptInit(3)> functions. The L<B<EVP_Digest>I<...>|EVP_DigestInit(3)> functions provide message digests.
fr: Le chiffrement symétrique est disponible avec les fonctions L<B<EVP_Encrypt>I<...>|EVP_EncryptInit(3)>. Les fonctions L<B<EVP_Digest>I<...>|EVP_DigestInit(3)> fournissent les signatures de message.

source: The B<EVP_PKEY>I<...> functions provide a high level interface to asymmetric algorithms. To create a new EVP_PKEY see L<EVP_PKEY_new(3)|EVP_PKEY_new(3)>. EVP_PKEYs can be associated with a private key of a particular algorithm by using the functions described on the L<EVP_PKEY_set1_RSA(3)|EVP_PKEY_set1_RSA(3)> page, or new keys can be generated using L<EVP_PKEY_keygen(3)|EVP_PKEY_keygen(3)>. EVP_PKEYs can be compared using L<EVP_PKEY_cmp(3)|EVP_PKEY_cmp(3)>, or printed using L<EVP_PKEY_print_private(3)|EVP_PKEY_print_private(3)>.
fr: Les fonctions B<EVP_PKEY>I<...> fournissent une interface haut niveau pour les algorithmes asymétriques. Pour créer un nouveau B<EVP_PKEY>, consulter B<EVP_PKEY_new>(3)|EVP_PKEY_new(3)>. B<EVP_PKEY> peut être associé avec une clef privée d’un algorithme particulier en utilisant les fonctions décrites dans les pages L<B<EVP_PKEY_set1_RSA)>(3)|EVP_PKEY_set1_RSA(3)>, ou de nouvelles clefs peuvent être créées en utilisant L<B<EVP_PKEY_keygen>(3)|EVP_PKEY_keygen(3)>. Des B<EVP_PKEY> peuvent être comparées en utilisant L<B<EVP_PKEY_cmp>(3)|EVP_PKEY_cmp(3)>, ou affichées avec L<B<EVP_PKEY_print_private>(3)|EVP_PKEY_print_private(3)>.

source: The EVP_PKEY functions support the full range of asymmetric algorithm operations:
fr: Les fonctions B<EVP_PKEY> prennent en charge toutes les opérations d’algorithme asymétrique :

source: For key agreement see L<EVP_PKEY_derive(3)|EVP_PKEY_derive(3)>
fr: Pour l’accord de clef, consultez L<B<EVP_PKEY_derive>(3)|EVP_PKEY_derive(3)>.

source: For signing and verifying see L<EVP_PKEY_sign(3)|EVP_PKEY_sign(3)>, L<EVP_PKEY_verify(3)|EVP_PKEY_verify(3)> and L<EVP_PKEY_verify_recover(3)|EVP_PKEY_verify_recover(3)>. However, note that these functions do not perform a digest of the data to be signed. Therefore normally you would use the L<B<EVP_DigestSign>I<...>|EVP_DigestSignInit(3)> functions for this purpose.
fr: Pour une signature ou une vérification, consultez L<B<EVP_PKEY_sign>(3)|EVP_PKEY_sign(3)>, L<B<EVP_PKEY_verify>(3)|EVP_PKEY_verify(3)> et L<B<EVP_PKEY_verify_recover>(3)|EVP_PKEY_verify_recover(3)>. Cependant, ces fonctions ne réalisent pas un condensat des données à signer. Par conséquent les fonctions L<B<EVP_DigestSign>I<...>|EVP_DigestSignInit(3)> sont à utiliser.
