Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/evp/po/*.po
Languages: fr

source: NAME
fr: NOM

source: EVP_BytesToKey - password based encryption routine
fr: EVP_BytesToKey - Routine de chiffrement à base de mot de passe

source: #include <openssl/evp.h>
fr: B< #include E<lt>openssl/evp.hE<gt>>

source: int EVP_BytesToKey(const EVP_CIPHER *type,const EVP_MD *md, const unsigned char *salt, const unsigned char *data, int datal, int count, unsigned char *key,unsigned char *iv);
fr: B< int EVP_BytesToKey(const EVP_CIPHER *>I<type>B<,const EVP_MD *>I<md>B<,> B<const unsigned char *>I<salt>B<,> B<const unsigned char *>I<data>B<, int> I<datal>B<, int> I<count>B<,> B<unsigned char *>I<key>B<,unsigned char *>I<iv>B<);>

source: EVP_BytesToKey() derives a key and IV from various parameters. B<type> is the cipher to derive the key and IV for. B<md> is the message digest to use. The B<salt> parameter is used as a salt in the derivation: it should point to an 8 byte buffer or NULL if no salt is used. B<data> is a buffer containing B<datal> bytes which is used to derive the keying data. B<count> is the iteration count to use. The derived key and IV will be written to B<key> and B<iv> respectively.
fr: B<EVP_BytesToKey>() dérive (fournit) une clef et un vecteur d'initialisation à partir de plusieurs paramètres. I<type> est l'algorithme de chiffrement pour dériver la clef et le vecteur d'initialisation. I<md> est l'algorithme de signature de message à utiliser. Le paramètre I<salt> est utilisé comme sel dans la dérivation : il devrait pointer vers un tampon de 8 octets ou NULL s'il ne faut pas utiliser de sel. I<data> est un tampon contenant I<datal> octets utilisé pour dériver les données de clef. I<count> est le nombre d'itérations à utiliser. La clef et le vecteur d'initialisation dérivés seront respectivement écrits dans I<key> et I<iv>.

source: A typical application of this function is to derive keying material for an encryption algorithm from a password in the B<data> parameter.
fr: Une application typique de cette fonction est de dériver du matériel de clef pour un algorithme de chiffrement à partir d'un mot de passe dans le paramètre I<data>.

source: Increasing the B<count> parameter slows down the algorithm which makes it harder for an attacker to peform a brute force attack using a large number of candidate passwords.
fr: Augmenter le paramètre I<count> ralentit l'algorithme, ce qui rend plus difficile pour un attaquant de réaliser une attaque par force brute utilisant un grand nombre de mots de passe candidats.

source: If the total key and IV length is less than the digest length and B<MD5> is used then the derivation algorithm is compatible with PKCS#5 v1.5 otherwise a non standard extension is used to derive the extra data.
fr: Si la taille totale de la clef et du vecteur d'initialisation est inférieure à la taille de l'algorithme de signature est que B<MD5> est utilisé, alors l'algorithme de dérivation est compatible avec PKCS#5 v1.5, sinon une extension non normalisée est utilisée pour fournir les données supplémentaires.

source: KEY DERIVATION ALGORITHM
fr: ALGORITHME DE DÉRIVATION DE CLEF

source: The key and IV is derived by concatenating D_1, D_2, etc until enough data is available for the key and IV. D_i is defined as:
fr: La clef et le vecteur d'initialisation sont dérivés en concaténant D_1, D_2, etc., jusqu'à ce que suffisamment de données soient disponibles pour la clef et le vecteur d'initialisation. D_i est défini comme :

source: where || denotes concatentaion, D_0 is empty, HASH is the digest algorithm in use, HASH^1(data) is simply HASH(data), HASH^2(data) is HASH(HASH(data)) and so on.
fr: où || indique la concaténation, D_0 est vide, HASH est l'algorithme de signature utilisé, HASH^1(data) est simplement HASH(data), HASH^2(data) est HASH(HASH(data)) et ainsi de suite.

source: The initial bytes are used for the key and the subsequent bytes for the IV.
fr: Les octets initiaux sont utilisés pour la clef et les octets suivants pour le vecteur d'initialisation.

source: RETURN VALUES
fr: VALEURS DE RETOUR

source: If B<data> is NULL, then EVP_BytesToKey() returns the number of bytes needed to store the derived key. Otherwise, EVP_BytesToKey() returns the size of the derived key in bytes, or 0 on error.
fr: Si I<data> est NULL, alors B<EVP_BytesToKey>() renvoie le nombre d’octets nécessaires pour enregistrer la clef dérivée. Autrement, B<EVP_BytesToKey>() renvoie la taille de la clef en octets, ou B<0> en cas d’erreur.

source: SEE ALSO
fr: VOIR AUSSI

source: L<evp(3)|evp(3)>, L<rand(3)|rand(3)>, L<EVP_EncryptInit(3)|EVP_EncryptInit(3)>
fr: L<B<evp>(3)|evp(3)>, L<B<rand>(3)|rand(3)>, L<B<EVP_EncryptInit>(3)|EVP_EncryptInit(3)>

source: HISTORY
fr: HISTORIQUE

source: EVP_MD_CTX_init, EVP_MD_CTX_create, EVP_DigestInit_ex, EVP_DigestUpdate, EVP_DigestFinal_ex, EVP_MD_CTX_cleanup, EVP_MD_CTX_destroy, EVP_MAX_MD_SIZE, EVP_MD_CTX_copy_ex, EVP_DigestInit, EVP_DigestFinal, EVP_MD_CTX_copy, EVP_MD_type, EVP_MD_pkey_type, EVP_MD_size, EVP_MD_block_size, EVP_MD_CTX_md, EVP_MD_CTX_size, EVP_MD_CTX_block_size, EVP_MD_CTX_type, EVP_md_null, EVP_md2, EVP_md5, EVP_sha, EVP_sha1, EVP_sha224, EVP_sha256, EVP_sha384, EVP_sha512, EVP_dss, EVP_dss1, EVP_mdc2, EVP_ripemd160, EVP_get_digestbyname, EVP_get_digestbynid, EVP_get_digestbyobj - EVP digest routines
fr: EVP_MD_CTX_init, EVP_MD_CTX_create, EVP_DigestInit_ex, EVP_DigestUpdate, EVP_DigestFinal_ex, EVP_MD_CTX_cleanup, EVP_MD_CTX_destroy, EVP_MAX_MD_SIZE, EVP_MD_CTX_copy_ex, EVP_DigestInit, EVP_DigestFinal, EVP_MD_CTX_copy, EVP_MD_type, EVP_MD_pkey_type, EVP_MD_size, EVP_MD_block_size, EVP_MD_CTX_md, EVP_MD_CTX_size, EVP_MD_CTX_block_size, EVP_MD_CTX_type, EVP_md_null, EVP_md2, EVP_md5, EVP_sha, EVP_sha1, EVP_sha224, EVP_sha256, EVP_sha384, EVP_sha512, EVP_dss, EVP_dss1, EVP_mdc2, EVP_ripemd160, EVP_get_digestbyname, EVP_get_digestbynid, EVP_get_digestbyobj - Routines EVP d’algorithme de hachage

source: void EVP_MD_CTX_init(EVP_MD_CTX *ctx); EVP_MD_CTX *EVP_MD_CTX_create(void);
fr: B< void EVP_MD_CTX_init(EVP_MD_CTX *>I<ctx>B<);> B<EVP_MD_CTX *EVP_MD_CTX_create(void);>

source: int EVP_DigestInit_ex(EVP_MD_CTX *ctx, const EVP_MD *type, ENGINE *impl); int EVP_DigestUpdate(EVP_MD_CTX *ctx, const void *d, size_t cnt); int EVP_DigestFinal_ex(EVP_MD_CTX *ctx, unsigned char *md, unsigned int *s);
fr: B< int EVP_DigestInit_ex(EVP_MD_CTX *>I<ctx>B<, const EVP_MD *>I<type>B<, ENGINE *>I<impl>B<);> B<int EVP_DigestUpdate(EVP_MD_CTX *>I<ctx>B<, const void *>I<d>B<, size_t> I<cnt>B<);> B<int EVP_DigestFinal_ex(EVP_MD_CTX *>I<ctx>B<, unsigned char *>I<md>B<,> B<unsigned int *>I<s>B<);>

source: int EVP_MD_CTX_cleanup(EVP_MD_CTX *ctx); void EVP_MD_CTX_destroy(EVP_MD_CTX *ctx);
fr: B< int EVP_MD_CTX_cleanup(EVP_MD_CTX *>I<ctx>B<);> B<void EVP_MD_CTX_destroy(EVP_MD_CTX *>I<ctx>B<);>

source: int EVP_MD_CTX_copy_ex(EVP_MD_CTX *out,const EVP_MD_CTX *in);
fr: B< int EVP_MD_CTX_copy_ex(EVP_MD_CTX *>I<out>B<,const EVP_MD_CTX *>I<in>B<);>

source: int EVP_DigestInit(EVP_MD_CTX *ctx, const EVP_MD *type); int EVP_DigestFinal(EVP_MD_CTX *ctx, unsigned char *md, unsigned int *s);
fr: B< int EVP_DigestInit(EVP_MD_CTX *>I<ctx>B<, const EVP_MD *>I<type>B<);> B<int EVP_DigestFinal(EVP_MD_CTX *>I<ctx>B<, unsigned char *>I<md>B<,> B<unsigned int *>I<s>B<);>

source: int EVP_MD_CTX_copy(EVP_MD_CTX *out,EVP_MD_CTX *in);
fr: B< int EVP_MD_CTX_copy(EVP_MD_CTX *>I<out>B<,EVP_MD_CTX *>I<in>B<);>

source: #define EVP_MAX_MD_SIZE 64 /* SHA512 */
fr: B< #define EVP_MAX_MD_SIZE 64 /* SHA512 *>/

source: int EVP_MD_type(const EVP_MD *md); int EVP_MD_pkey_type(const EVP_MD *md); int EVP_MD_size(const EVP_MD *md); int EVP_MD_block_size(const EVP_MD *md);
fr: B< int EVP_MD_type(const EVP_MD *>I<md>B<);> B<int EVP_MD_pkey_type(const EVP_MD *>I<md>B<);> B<int EVP_MD_size(const EVP_MD *>I<md>B<);> B<int EVP_MD_block_size(const EVP_MD *>I<md>B<)>;

source: const EVP_MD *EVP_MD_CTX_md(const EVP_MD_CTX *ctx); #define EVP_MD_CTX_size(e) EVP_MD_size(EVP_MD_CTX_md(e)) #define EVP_MD_CTX_block_size(e) EVP_MD_block_size((e)->digest) #define EVP_MD_CTX_type(e) EVP_MD_type((e)->digest)
fr: B< const EVP_MD *EVP_MD_CTX_md(const EVP_MD_CTX *>I<ctx>B<);> B<#define EVP_MD_CTX_size(e) EVP_MD_size(EVP_MD_CTX_md(e))> B<#define EVP_MD_CTX_block_size(e) EVP_MD_block_size((e)-E<gt>digest)> B<#define EVP_MD_CTX_type(e) EVP_MD_type((e)-E<gt>digest)>

source: const EVP_MD *EVP_md_null(void); const EVP_MD *EVP_md2(void); const EVP_MD *EVP_md5(void); const EVP_MD *EVP_sha(void); const EVP_MD *EVP_sha1(void); const EVP_MD *EVP_dss(void); const EVP_MD *EVP_dss1(void); const EVP_MD *EVP_mdc2(void); const EVP_MD *EVP_ripemd160(void);
fr: B< const EVP_MD *EVP_md_null(void);> B<const EVP_MD *EVP_md2(void);> B<const EVP_MD *EVP_md5(void);> B<const EVP_MD *EVP_sha(void);> B<const EVP_MD *EVP_sha1(void);> B<const EVP_MD *EVP_dss(void);> B<const EVP_MD *EVP_dss1(void);> B<const EVP_MD *EVP_mdc2(void);> B<const EVP_MD *EVP_ripemd160(void);>

source: const EVP_MD *EVP_sha224(void); const EVP_MD *EVP_sha256(void); const EVP_MD *EVP_sha384(void); const EVP_MD *EVP_sha512(void);
fr: B< const EVP_MD *EVP_sha224(void);> B<const EVP_MD *EVP_sha256(void);> B<const EVP_MD *EVP_sha384(void);> B<const EVP_MD *EVP_sha512(void);>

source: const EVP_MD *EVP_get_digestbyname(const char *name); #define EVP_get_digestbynid(a) EVP_get_digestbyname(OBJ_nid2sn(a)) #define EVP_get_digestbyobj(a) EVP_get_digestbynid(OBJ_obj2nid(a))
fr: B< const EVP_MD *EVP_get_digestbyname(const char *>I<name>B<);> B<#define EVP_get_digestbynid(a) EVP_get_digestbyname(OBJ_nid2sn(a))> B<#define EVP_get_digestbyobj(a) EVP_get_digestbynid(OBJ_obj2nid(a))>

source: The EVP digest routines are a high level interface to message digests.
fr: Les routines EVP pour algorithme de hachage sont des interfaces de haut niveau pour les condensés de message.

source: EVP_MD_CTX_init() initializes digest context B<ctx>.
fr: B<EVP_MD_CTX_init>() initialise le contexte I<ctx> du condensé de message.

source: EVP_MD_CTX_create() allocates, initializes and returns a digest context.
fr: B<EVP_MD_CTX_create>() alloue, initialise et renvoie un contexte de condensé de message.

source: EVP_DigestInit_ex() sets up digest context B<ctx> to use a digest B<type> from ENGINE B<impl>. B<ctx> must be initialized before calling this function. B<type> will typically be supplied by a functionsuch as EVP_sha1(). If B<impl> is NULL then the default implementation of digest B<type> is used.
fr: B<EVP_DigestInit_ex>() définit un contexte de condensé de message I<ctx> pour utiliser un I<type> d’algorithme à partir de l’ENGINE I<impl>. I<ctx> doit être initialisé avant d’appeler cette fonction. I<type> est habituellement fourni par une fonction telle que B<EVP_sha1>(). Si I<impl> est NULL, alors l’implémentation du I<type> par défaut est utilisée.

source: EVP_DigestUpdate() hashes B<cnt> bytes of data at B<d> into the digest context B<ctx>. This function can be called several times on the same B<ctx> to hash additional data.
fr: B<EVP_DigestUpdate>() produit un hachage de I<cnt> octets de données vers I<d> dans le contexte de condensé de message I<ctx>. Cette fonction peut être appelée plusieurs fois pour produire un hachage de données supplémentaires.

source: EVP_DigestFinal_ex() retrieves the digest value from B<ctx> and places it in B<md>. If the B<s> parameter is not NULL then the number of bytes of data written (i.e. the length of the digest) will be written to the integer at B<s>, at most B<EVP_MAX_MD_SIZE> bytes will be written. After calling EVP_DigestFinal_ex() no additional calls to EVP_DigestUpdate() can be made, but EVP_DigestInit_ex() can be called to initialize a new digest operation.
fr: B<EVP_DigestFinal_ex>() récupère la valeur de condensé de message de I<ctx> et la place dans I<md>. Si le paramètre I<s> n’est pas NULL, le nombre d’octets de données sera écrit (c’est-à-dire la dimension du condensé de message) sur I<s> (de type entier), au maximum B<EVP_MAX_MD_SIZE> octets seront écrits. Après l’appel de B<EVP_DigestFinal_ex>(), aucun appel supplémentaire à B<EVP_DigestUpdate>() ne pourra être fait, mais B<EVP_DigestInit_ex>() pourra être appelée pour initialiser une nouvelle opération de condensé de message.

source: EVP_MD_CTX_cleanup() cleans up digest context B<ctx>, it should be called after a digest context is no longer needed.
fr: B<EVP_MD_CTX_cleanup>() nettoie le contexte I<ctx> du condensé de message et devrait être appelée si ce contexte n’est plus nécessaire.

source: EVP_MD_CTX_destroy() cleans up digest context B<ctx> and frees up the space allocated to it, it should be called only on a context created using EVP_MD_CTX_create().
fr: B<EVP_MD_CTX_destroy>() nettoie le contexte I<ctx> du condensé de message et libère l’espace qui lui était alloué. Elle devrait être appelée seulement pour un contexte créé en utilisant B<EVP_MD_CTX_create>().

source: EVP_MD_CTX_copy_ex() can be used to copy the message digest state from B<in> to B<out>. This is useful if large amounts of data are to be hashed which only differ in the last few bytes. B<out> must be initialized before calling this function.
fr: B<EVP_MD_CTX_copy_ex>() peut être utilisée pour copier l’état du condensé de message de I<in> vers I<out>. Cela est utile si le hachage de grandes quantités de données, qui différent seulement par leurs derniers octets, est à réaliser. I<out> doit être initialisée avant d’appeler cette fonction.

source: EVP_DigestInit() behaves in the same way as EVP_DigestInit_ex() except the passed context B<ctx> does not have to be initialized, and it always uses the default digest implementation.
fr: B<EVP_DigestInit>() fonctionne comme B<EVP_DigestInit_ex>() sauf que le contexte indiqué I<ctx> n’a nul besoin d’être initialisé et qu’elle utilise toujours l’algorithme implémenté par défaut.

source: EVP_DigestFinal() is similar to EVP_DigestFinal_ex() except the digest context B<ctx> is automatically cleaned up.
fr: B<EVP_DigestFinal>() est similaire à B<EVP_DigestFinal_ex>() sauf que le contexte du condensé de message I<ctx> est automatiquement nettoyé.

source: EVP_MD_CTX_copy() is similar to EVP_MD_CTX_copy_ex() except the destination B<out> does not have to be initialized.
fr: B<EVP_MD_CTX_copy>() est similaire à B<EVP_MD_CTX_copy_ex>() sauf que la destination I<out> ne doit pas être initialisée.

source: EVP_MD_size() and EVP_MD_CTX_size() return the size of the message digest when passed an B<EVP_MD> or an B<EVP_MD_CTX> structure, i.e. the size of the hash.
fr: B<EVP_MD_size>() et B<EVP_MD_CTX_size>() renvoient la taille d’un condensé de message lorsqu’il est fourni à une structure B<EVP_MD> ou B<EVP_MD_CTX>, c’est-à-dire la taille de l’empreinte numérique.

source: EVP_MD_block_size() and EVP_MD_CTX_block_size() return the block size of the message digest when passed an B<EVP_MD> or an B<EVP_MD_CTX> structure.
fr: B<EVP_MD_block_size>() et B<EVP_MD_CTX_block_size>() renvoient la taille de bloc du condensé de message lorsqu’il est fourni à une structure B<EVP_MD> ou B<EVP_MD_CTX>.

source: EVP_MD_type() and EVP_MD_CTX_type() return the NID of the OBJECT IDENTIFIER representing the given message digest when passed an B<EVP_MD> structure. For example EVP_MD_type(EVP_sha1()) returns B<NID_sha1>. This function is normally used when setting ASN1 OIDs.
fr: B<EVP_MD_type>() et B<EVP_MD_CTX_type>() renvoient le NID de OBJECT IDENTIFIER représentant le condensé de message indiqué lorsqu’il est fourni à une structure B<EVP_MD>. Par exemple, B<EVP_MD_type(EVP_sha1>() renvoie B<NID_sha1>. Cette fonction est généralement utilisée pour définir les OID ASN1.

source: EVP_MD_CTX_md() returns the B<EVP_MD> structure corresponding to the passed B<EVP_MD_CTX>.
fr: B<EVP_MD_CTX_md>() renvoie la structure B<EVP_MD> correspondant à celle fournie : B<EVP_MD_CTX>.

source: EVP_MD_pkey_type() returns the NID of the public key signing algorithm associated with this digest. For example EVP_sha1() is associated with RSA so this will return B<NID_sha1WithRSAEncryption>. Since digests and signature algorithms are no longer linked this function is only retained for compatibility reasons.
fr: B<EVP_MD_pkey_type>() renvoie le NID de la clef publique signant l’algorithme associé avec ce condensé de message. Par exemple, B<EVP_sha1>() est associée avec RSA, et renverra B<NID_sha1WithRSAEncryption>. Puisque les condensés de message et les algorithmes ne sont plus liés, cette fonction n’est plus conservée que pour des raisons de compatibilité.

source: EVP_md2(), EVP_md5(), EVP_sha(), EVP_sha1(), EVP_sha224(), EVP_sha256(), EVP_sha384(), EVP_sha512(), EVP_mdc2() and EVP_ripemd160() return B<EVP_MD> structures for the MD2, MD5, SHA, SHA1, SHA224, SHA256, SHA384, SHA512, MDC2 and RIPEMD160 digest algorithms respectively.
fr: B<EVP_md2>(), B<EVP_md5>(), B<EVP_sha>(), B<EVP_sha1>(), B<EVP_sha224>(), B<EVP_sha256>(), B<EVP_sha384>(), B<EVP_sha512>(), B<EVP_mdc2>() et B<EVP_ripemd160>() renvoient des structures B<EVP_MD> pour leurs algorithmes respectifs : MD2, MD5, SHA, SHA1, SHA224, SHA256, SHA384, SHA512, MDC2 ou RIPEMD160.

source: EVP_dss() and EVP_dss1() return B<EVP_MD> structures for SHA and SHA1 digest algorithms but using DSS (DSA) for the signature algorithm. Note: there is no need to use these pseudo-digests in OpenSSL 1.0.0 and later, they are however retained for compatibility.
fr: B<EVP_dss>() et B<EVP_dss1>() renvoient des structures B<EVP_MD> pour leurs algorithmes de hachage SHA et SHA1 en utilisant DSS (DSA) comme algorithme de signature. Remarque : il n’est nul besoin d’utiliser ces pseudo-condensés de message dans OpenSSL 1.0.0 ou postérieur ; ces fonctions ne sont plus conservées que pour des raisons de compatibilité.

source: EVP_md_null() is a "null" message digest that does nothing: i.e. the hash it returns is of zero length.
fr: B<EVP_md_null>() est un condensé de message « null » sans aucun effet : c’est-à-dire la valeur renvoyée est de longueur zéro.

source: EVP_get_digestbyname(), EVP_get_digestbynid() and EVP_get_digestbyobj() return an B<EVP_MD> structure when passed a digest name, a digest NID or an ASN1_OBJECT structure respectively. The digest table must be initialized using, for example, OpenSSL_add_all_digests() for these functions to work.
fr: B<EVP_get_digestbyname>(), B<EVP_get_digestbynid>() et B<EVP_get_digestbyobj>() renvoient une structure B<EVP_MD> lorsque sont fournis un nom d’algorithme de hachage, un NID ou une structure ASN1_OBJECT, respectivement. La table du hachage doit être initialisée en utilisant, par exemple, B<OpenSSL_add_all_digests>() pour que ces fonctions agissent.

source: EVP_DigestInit_ex(), EVP_DigestUpdate() and EVP_DigestFinal_ex() return 1 for success and 0 for failure.
fr: B<EVP_DigestInit_ex>(), B<EVP_DigestUpdate>() et B<EVP_DigestFinal_ex>() renvoient B<1> en cas de réussite et B<0> en cas d’échec.

source: EVP_MD_CTX_copy_ex() returns 1 if successful or 0 for failure.
fr: B<EVP_MD_CTX_copy_ex>() renvoie B<1> en cas de réussite et B<0> en cas d’échec.

source: EVP_MD_type(), EVP_MD_pkey_type() and EVP_MD_type() return the NID of the corresponding OBJECT IDENTIFIER or NID_undef if none exists.
fr: B<EVP_MD_type>(), B<EVP_MD_pkey_type>() et B<EVP_MD_type>() renvoient le NID du OBJECT IDENTIFIER correspondant ou B<NID_undef> si absent.

source: EVP_MD_size(), EVP_MD_block_size(), EVP_MD_CTX_size() and EVP_MD_CTX_block_size() return the digest or block size in bytes.
fr: B<EVP_MD_size>(), B<EVP_MD_block_size>(), B<EVP_MD_CTX_size>() et B<EVP_MD_CTX_block_size>() renvoient les tailles de condensé de message ou de bloc en octet.

source: EVP_md_null(), EVP_md2(), EVP_md5(), EVP_sha(), EVP_sha1(), EVP_dss(), EVP_dss1(), EVP_mdc2() and EVP_ripemd160() return pointers to the corresponding EVP_MD structures.
fr: B<EVP_md_null>(), B<EVP_md2>(), B<EVP_md5>(), B<EVP_sha>(), B<EVP_sha1>(), B<EVP_dss>(), B<EVP_dss1>(), B<EVP_mdc2>() et B<EVP_ripemd160>() renvoient des pointeurs vers les structures B<EVP_MD> correspondantes.

source: EVP_get_digestbyname(), EVP_get_digestbynid() and EVP_get_digestbyobj() return either an B<EVP_MD> structure or NULL if an error occurs.
fr: B<EVP_get_digestbyname>(), B<EVP_get_digestbynid>() et B<EVP_get_digestbyobj>() renvoient soit une structure B<EVP_MD> ou NULL en cas d’erreur.

source: The B<EVP> interface to message digests should almost always be used in preference to the low level interfaces. This is because the code then becomes transparent to the digest used and much more flexible.
fr: L’interface B<EVP> pour les condensés de message devrait presque toujours être utilisée de préférence aux interfaces de bas niveau. Cela est ainsi parce que le code devient évident pour l’algorithme de hachage utilisé et bien plus souple.

source: New applications should use the SHA2 digest algorithms such as SHA256. The other digest algorithms are still in common use.
fr: Les nouvelles applications devraient utiliser les algorithmes de hachage SHA2 tels que SHA256. Les autres algorithmes de hachage sont encore communément utilisés.

source: For most applications the B<impl> parameter to EVP_DigestInit_ex() will be set to NULL to use the default digest implementation.
fr: Pour la plupart des applications, le paramètre I<impl> pour B<EVP_DigestInit_ex>() doit être défini à NULL pour utiliser l’implémentation par défaut de condensé de message.

source: The functions EVP_DigestInit(), EVP_DigestFinal() and EVP_MD_CTX_copy() are obsolete but are retained to maintain compatibility with existing code. New applications should use EVP_DigestInit_ex(), EVP_DigestFinal_ex() and EVP_MD_CTX_copy_ex() because they can efficiently reuse a digest context instead of initializing and cleaning it up on each call and allow non default implementations of digests to be specified.
fr: Les fonctions B<EVP_DigestInit>(), B<EVP_DigestFinal>() et B<EVP_MD_CTX_copy>() sont obsolètes mais sont conservées pour compatibilité avec le code existant. Les nouvelles applications devraient utiliser B<EVP_DigestInit_ex>(), B<EVP_DigestFinal_ex>() et B<EVP_MD_CTX_copy_ex>() car elles peuvent, de manière efficace, utiliser de nouveau un contexte de condensé de message au lieu de l’initialiser et le nettoyer à chaque appel, et permettent aux implémentations non installées de l’être.

source: In OpenSSL 0.9.7 and later if digest contexts are not cleaned up after use memory leaks will occur.
fr: Dans OpenSSL 0.9.7 et postérieur, si un contexte de condensé de message n’est pas nettoyé après son utilisation, une fuite de mémoire se produira.

source: Stack allocation of EVP_MD_CTX structures is common, for example:
fr: L’allocation de mémoire pour des structures B<EVP_MD_CTX> est courant, par exemple :

source: This will cause binary compatibility issues if the size of EVP_MD_CTX structure changes (this will only happen with a major release of OpenSSL). Applications wishing to avoid this should use EVP_MD_CTX_create() instead:
fr: Cela conduira à des problèmes de compatibilité si la taille de la structure B<EVP_MD_CTX> change (cela ne peut arriver que lors d’une nouvelle mise à jour majeure d’OpenSSL). Les applications souhaitant éviter ce problème doivent plutôt utiliser B<EVP_MD_CTX_create>() :

source: EXAMPLE
fr: EXEMPLE

source: This example digests the data "Test Message\n" and "Hello World\n", using the digest name passed on the command line.
fr: Cet exemple hache les données « Message de test » et « Hello World », en utilisant le nom d’algorithme de hachage fourni sur la ligne de commande.

source: main(int argc, char *argv[]) { EVP_MD_CTX *mdctx; const EVP_MD *md; char mess1[] = "Test Message\n"; char mess2[] = "Hello World\n"; unsigned char md_value[EVP_MAX_MD_SIZE]; int md_len, i;
fr: main(int argc, char *argv[]) { EVP_MD_CTX *mdctx; const EVP_MD *md; char mess1[] = "Message de test\n"; char mess2[] = "Hello World\n"; unsigned char md_value[EVP_MAX_MD_SIZE]; int md_len, i;
