Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/evp/po/*.po
Languages: fr

source: For encryption and decryption see L<EVP_PKEY_encrypt(3)|EVP_PKEY_encrypt(3)> and L<EVP_PKEY_decrypt(3)|EVP_PKEY_decrypt(3)> respectively. However, note that these functions perform encryption and decryption only. As public key encryption is an expensive operation, normally you would wrap an encrypted message in a "digital envelope" using the L<B<EVP_Seal>I<...>|EVP_SealInit(3)> and L<B<EVP_Open>I<...>|EVP_OpenInit(3)> functions.
fr: Pour le chiffrement et le déchiffrement, consultez L<B<EVP_PKEY_encrypt>(3)|EVP_PKEY_encrypt(3)> et L<B<EVP_PKEY_decrypt>(3)|EVP_PKEY_decrypt(3)> respectivement. Cependant, ces fonctions réalisent uniquement un chiffrement et un déchiffrement. Comme le chiffrement par clef publique est une opération coûteuse, habituellement le message chiffré est enveloppé dans une « enveloppe numérique » en utilisant les fonctions L<B<EVP_Seal>I<...>|EVP_SealInit(3)> et L<B<EVP_Open>I<...>|EVP_OpenInit(3)>.

source: The L<EVP_BytesToKey(3)|EVP_BytesToKey(3)> function provides some limited support for password based encryption. Careful selection of the parameters will provide a PKCS#5 PBKDF1 compatible implementation. However, new applications should not typically use this (preferring, for example, PBKDF2 from PCKS#5).
fr: La fonction L<B<EVP_BytesToKey>(3)|EVP_BytesToKey(3)> fournit une prise en charge limitée pour un chiffrement du mot de passe. Un choix méticuleux des paramètres fournit une prise en charge compatible avec PBKDF1 pour PKCS#5. Cependant, les nouvelles applications ne devraient pas normalement utiliser cela (en préférant, par exemple, PBKDF2 de PCKS#5).

source: Algorithms are loaded with L<OpenSSL_add_all_algorithms(3)|OpenSSL_add_all_algorithms(3)>.
fr: Les algorithmes sont chargés avec L<B<OpenSSL_add_all_algorithms>(3)|OpenSSL_add_all_algorithms(3)>.

source: All the symmetric algorithms (ciphers), digests and asymmetric algorithms (public key algorithms) can be replaced by L<ENGINE|engine(3)> modules providing alternative implementations. If ENGINE implementations of ciphers or digests are registered as defaults, then the various EVP functions will automatically use those implementations automatically in preference to built in software implementations. For more information, consult the engine(3) man page.
fr: Tous les algorithmes symétriques (pour le chiffrement), les algorithmes de signature et les algorithmes asymétriques (algorithmes à clef publique) peuvent être remplacés par les modules L<ENGINE|engine(3)> fournissant des implémentations alternatives. Si des implémentations ENGINE d'algorithmes de chiffrement ou de signature sont enregistrées par défaut, alors les diverses fonctions EVP utiliseront automatiquement ces implémentations de préférence pour les intégrer aux implémentations logicielles. Pour plus de renseignements, consultez la page de manuel B<engine>(3).

source: Although low level algorithm specific functions exist for many algorithms their use is discouraged. They cannot be used with an ENGINE and ENGINE versions of new algorithms cannot be accessed using the low level functions. Also makes code harder to adapt to new algorithms and some options are not cleanly supported at the low level and some operations are more efficient using the high level interface.
fr: Bien que des fonctions bas niveau spécifiques aux algorithmes existent pour plusieurs algorithmes, leur utilisation n'est pas recommandée. Elles ne peuvent pas être utilisées avec un ENGINE, et les versions d'ENGINE des nouveaux algorithmes ne sont pas accessibles en utilisant les fonctions bas niveau. De plus, cela rend le code plus difficile à adapter aux nouveaux algorithmes, certaines options ne sont pas proprement prises en charge au bas niveau, et certaines opérations sont plus efficaces en utilisant l'interface haut niveau.

source: L<EVP_DigestInit(3)|EVP_DigestInit(3)>, L<EVP_EncryptInit(3)|EVP_EncryptInit(3)>, L<EVP_OpenInit(3)|EVP_OpenInit(3)>, L<EVP_SealInit(3)|EVP_SealInit(3)>, L<EVP_DigestSignInit(3)|EVP_DigestSignInit(3)>, L<EVP_SignInit(3)|EVP_SignInit(3)>, L<EVP_VerifyInit(3)|EVP_VerifyInit(3)>, L<EVP_PKEY_new(3)|EVP_PKEY_new(3)>, L<EVP_PKEY_set1_RSA(3)|EVP_PKEY_set1_RSA(3)>, L<EVP_PKEY_keygen(3)|EVP_PKEY_keygen(3)>, L<EVP_PKEY_print_private(3)|EVP_PKEY_print_private(3)>, L<EVP_PKEY_decrypt(3)|EVP_PKEY_decrypt(3)>, L<EVP_PKEY_encrypt(3)|EVP_PKEY_encrypt(3)>, L<EVP_PKEY_sign(3)|EVP_PKEY_sign(3)>, L<EVP_PKEY_verify(3)|EVP_PKEY_verify(3)>, L<EVP_PKEY_verify_recover(3)|EVP_PKEY_verify_recover(3)>, L<EVP_PKEY_derive(3)|EVP_PKEY_derive(3)>, L<EVP_BytesToKey(3)|EVP_BytesToKey(3)>, L<OpenSSL_add_all_algorithms(3)|OpenSSL_add_all_algorithms(3)>, L<engine(3)|engine(3)>
fr: L<B<EVP_DigestInit>(3)|EVP_DigestInit(3)>, L<B<EVP_EncryptInit>(3)|EVP_EncryptInit(3)>, L<B<EVP_OpenInit>(3)|EVP_OpenInit(3)>, L<B<EVP_SealInit>(3)|EVP_SealInit(3)>, L<B<EVP_DigestSignInit>(3)|EVP_DigestSignInit(3)>, L<B<EVP_SignInit>(3)|EVP_SignInit(3)>, L<B<EVP_VerifyInit>(3)|EVP_VerifyInit(3)>, L<B<EVP_PKEY_new>(3)|EVP_PKEY_new(3)>, L<B<EVP_PKEY_set1_RSA>(3)|EVP_PKEY_set1_RSA(3)>, L<B<EVP_PKEY_keygen>(3)|EVP_PKEY_keygen(3)>, L<B<EVP_PKEY_print_private>(3)|EVP_PKEY_print_private(3)>, L<B<EVP_PKEY_decrypt>(3)|EVP_PKEY_decrypt(3)>, L<B<EVP_PKEY_encrypt>(3)|EVP_PKEY_encrypt(3)>, L<B<EVP_PKEY_sign>(3)|EVP_PKEY_sign(3)>, L<B<EVP_PKEY_verify>(3)|EVP_PKEY_verify(3)>, L<B<EVP_PKEY_verify_recover>(3)|EVP_PKEY_verify_recover(3)>, L<B<EVP_PKEY_derive>(3)|EVP_PKEY_derive(3)>, L<B<EVP_BytesToKey>(3)|EVP_BytesToKey(3)>, L<B<OpenSSL_add_all_algorithms>(3)|OpenSSL_add_all_algorithms(3)>, L<B<engine>(3)|engine(3)>
