Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/evp/po/*.po
Languages: fr

source: if(!argv[1]) { printf("Usage: mdtest digestname\n"); exit(1); }
fr: if(!argv[1]) { printf("Usage : mdtest digestname\n"); B<exit>(1); }

source: if(!md) { printf("Unknown message digest %s\n", argv[1]); exit(1); }
fr: if(!md) { printf("Algorithme de hachage inconnu %s\n", argv[1]); B<exit>(1); }

source: /* Call this once before exit. */ EVP_cleanup(); exit(0); }
fr: /* Exécuter ceci avant de quitter. */ EVP_cleanup(); exit(0); }

source: L<dgst(1)|dgst(1)>, L<evp(3)|evp(3)>
fr: L<B<dgst>(1)|dgst(1)>, L<B<evp>(3)|evp(3)>

source: EVP_DigestInit(), EVP_DigestUpdate() and EVP_DigestFinal() are available in all versions of SSLeay and OpenSSL.
fr: B<EVP_DigestInit>(), B<EVP_DigestUpdate>() et B<EVP_DigestFinal>() sont disponibles dans toutes les versions de SSLeay et OpenSSL.

source: EVP_MD_CTX_init(), EVP_MD_CTX_create(), EVP_MD_CTX_copy_ex(), EVP_MD_CTX_cleanup(), EVP_MD_CTX_destroy(), EVP_DigestInit_ex() and EVP_DigestFinal_ex() were added in OpenSSL 0.9.7.
fr: B<EVP_MD_CTX_init>(), B<EVP_MD_CTX_create>(), B<EVP_MD_CTX_copy_ex>(), B<EVP_MD_CTX_cleanup>(), B<EVP_MD_CTX_destroy>(), B<EVP_DigestInit_ex>() et B<EVP_DigestFinal_ex>() ont été ajoutées dans OpenSSL 0.9.7.

source: EVP_md_null(), EVP_md2(), EVP_md5(), EVP_sha(), EVP_sha1(), EVP_dss(), EVP_dss1(), EVP_mdc2() and EVP_ripemd160() were changed to return truly const EVP_MD * in OpenSSL 0.9.7.
fr: B<EVP_md_null>(), B<EVP_md2>(), B<EVP_md5>(), B<EVP_sha>(), B<EVP_sha1>(), B<EVP_dss>(), B<EVP_dss1>(), B<EVP_mdc2>() et B<EVP_ripemd160>() ont été modifiées pour renvoyer correctement I<const EVP_MD *> dans OpenSSL 0.9.7.

source: The link between digests and signing algorithms was fixed in OpenSSL 1.0 and later, so now EVP_sha1() can be used with RSA and DSA; there is no need to use EVP_dss1() any more.
fr: Le problème de lien entre les algorithmes de condensé de message et de signature a été corrigé dans OpenSSL 1.0 et postérieur, et maintenant B<EVP_sha1>() peut être utilisée avec RSA et DSA ; B<EVP_dss1>() n’est plus nécessaire.

source: OpenSSL 1.0 and later does not include the MD2 digest algorithm in the default configuration due to its security weaknesses.
fr: OpenSSL 1.0 et postérieurs n’intègrent pas l’algorithme de hachage MD2 dans leur configuration par défaut à cause de ses problèmes de faiblesse de sécurité.

source: EVP_DigestSignInit, EVP_DigestSignUpdate, EVP_DigestSignFinal - EVP signing functions
fr: EVP_DigestSignInit, EVP_DigestSignUpdate, EVP_DigestSignFinal - Fonctions EVP d’empreinte numérique

source: int EVP_DigestSignInit(EVP_MD_CTX *ctx, EVP_PKEY_CTX **pctx, const EVP_MD *type, ENGINE *e, EVP_PKEY *pkey); int EVP_DigestSignUpdate(EVP_MD_CTX *ctx, const void *d, unsigned int cnt); int EVP_DigestSignFinal(EVP_MD_CTX *ctx, unsigned char *sig, size_t *siglen);
fr: B< int EVP_DigestSignInit(EVP_MD_CTX *>I<ctx>B<, EVP_PKEY_CTX **>I<pctx>B<,> B<const EVP_MD *>I<type>B<, ENGINE *e, EVP_PKEY *>I<pkey>B<);> B<int EVP_DigestSignUpdate(EVP_MD_CTX *>I<ctx>B<, const void *>I<d>B<, unsigned int cnt);> B<int EVP_DigestSignFinal(EVP_MD_CTX *>I<ctx>B<, unsigned char *>I<sig>B<, size_t *>I<siglen>B<);>

source: The EVP signature routines are a high level interface to digital signatures.
fr: Les routines de signature EVP constituent une interface de haut niveau pour les signatures numériques.

source: EVP_DigestSignInit() sets up signing context B<ctx> to use digest B<type> from ENGINE B<impl> and private key B<pkey>. B<ctx> must be initialized with EVP_MD_CTX_init() before calling this function. If B<pctx> is not NULL the EVP_PKEY_CTX of the signing operation will be written to B<*pctx>: this can be used to set alternative signing options.
fr: B<EVP_DigestSignInit>() définit de contexte de signature I<ctx> à utiliser avec le B<type> d’empreinte numérique à partir de l’ENGINE I<impl> et la clef privée I<pkey>. I<ctx> doit être initialisé avec B<EVP_MD_CTX_init>() avant l’appel de cette fonction. Si <pctx> n’est pas NULL, B<EVP_PKEY_CTX> de cette opération de signature sera écrit dans I<*pctx> : cela peut être utilisé pour définir des options alternatives de signature.

source: EVP_DigestSignUpdate() hashes B<cnt> bytes of data at B<d> into the signature context B<ctx>. This function can be called several times on the same B<ctx> to include additional data. This function is currently implemented usig a macro.
fr: B<EVP_DigestSignUpdate>() calcule un hachage de I<cnt> octets de données vers I<d> dans le contexte de signature I<ctx>. Cette fonction peut être appelée plusieurs fois dans le même I<ctx> pour tenir compte de données additionnelles. Cette fonction est actuellement implémentée en utilisant une macro.

source: EVP_DigestSignFinal() signs the data in B<ctx> places the signature in B<sig>. If B<sig> is B<NULL> then the maximum size of the output buffer is written to the B<siglen> parameter. If B<sig> is not B<NULL> then before the call the B<siglen> parameter should contain the length of the B<sig> buffer, if the call is successful the signature is written to B<sig> and the amount of data written to B<siglen>.
fr: B<EVP_DigestSignFinal>() signe les données dans I<ctx> et place l’empreinte numérique dans I<sig>. Si I<sig> est NULL, alors la taille maximale du tampon de sortie est écrite dans le paramètre I<siglen>. Si I<sig> n’est pas NULL, alors avant l’appel, le paramètre I<siglen> doit contenir la taille du tampon I<sig> ; si l’appel est réussi, l’empreinte numérique est écrite dans I<sig> et le total de données écrites dans I<siglen>.

source: EVP_DigestSignInit() EVP_DigestSignUpdate() and EVP_DigestSignaFinal() return 1 for success and 0 or a negative value for failure. In particular a return value of -2 indicates the operation is not supported by the public key algorithm.
fr: B<EVP_DigestSignInit>(), B<EVP_DigestSignUpdate>() et B<EVP_DigestSignaFinal>() renvoient B<1> en cas de succès ou une valeur négative en cas d’échec. En particulier, une valeur de retour de B<-2> signifie que l’opération n’est pas permise par l’algorithme de clef publique.

source: The error codes can be obtained from L<ERR_get_error(3)|ERR_get_error(3)>.
fr: Les codes d'erreur peuvent être obtenus par L<B<ERR_get_error>(3)|ERR_get_error(3)>.

source: The B<EVP> interface to digital signatures should almost always be used in preference to the low level interfaces. This is because the code then becomes transparent to the algorithm used and much more flexible.
fr: L’interface B<EVP> pour les signatures numériques devrait presque toujours être utilisée de préférence à des interfaces de bas niveaux. Cela est ainsi parce que le code devient évident pour l’algorithme utilisé et bien plus souple.

source: In previous versions of OpenSSL there was a link between message digest types and public key algorithms. This meant that "clone" digests such as EVP_dss1() needed to be used to sign using SHA1 and DSA. This is no longer necessary and the use of clone digest is now discouraged.
fr: Dans les versions précédentes d’OpenSSL, un lien existait entre les empreintes numériques et les algorithmes de clef publique. Cela signifiait que les « clones » d’algorithmes de hachage tels que B<EVP_dss1>() devaient être utilisés pour les empreintes numériques SHA1 et DSA. Cela n’est plus nécessaire et l’utilisation de clone est maintenant déconseillée.

source: For some key types and parameters the random number generator must be seeded or the operation will fail.
fr: Pour quelques sortes de clefs et de paramètres, la graine du générateur de nombre aléatoire doit être fournie ou l’opération échouera.

source: The call to EVP_DigestSignFinal() internally finalizes a copy of the digest context. This means that calls to EVP_DigestSignUpdate() and EVP_DigestSignFinal() can be called later to digest and sign additional data.
fr: L’appel à B<EVP_DigestSignFinal>() de manière interne fait une copie du contexte de signature. Cela signifie que des appels à B<EVP_DigestSignUpdate>() et B<EVP_DigestSignFinal>() peuvent être faits en cas de données additionnelles.

source: Since only a copy of the digest context is ever finalized the context must be cleaned up after use by calling EVP_MD_CTX_cleanup() or a memory leak will occur.
fr: Puisqu’une seule copie est réalisée, le contexte de l’empreinte numérique doit être nettoyé après utilisation en appelant B<EVP_MD_CTX_cleanup>() ou une fuite de mémoire se produira.

source: The use of EVP_PKEY_size() with these functions is discouraged because some signature operations may have a signature length which depends on the parameters set. As a result EVP_PKEY_size() would have to return a value which indicates the maximum possible signature for any set of parameters.
fr: L’utilisation de B<EVP_PKEY_size>() avec ces fonctions est déconseillée car quelques opérations de signature peuvent avoir une taille d’empreinte numérique dépendant de paramètres. Par conséquent, B<EVP_PKEY_size>() devrait renvoyer une valeur donnant la taille maximale possible d’empreinte numérique pour n’importe quelles définitions des paramètres.

source: L<EVP_DigestVerifyInit(3)|EVP_DigestVerifyInit(3)>, L<EVP_DigestInit(3)|EVP_DigestInit(3)>, L<err(3)|err(3)>, L<evp(3)|evp(3)>, L<hmac(3)|hmac(3)>, L<md2(3)|md2(3)>, L<md5(3)|md5(3)>, L<mdc2(3)|mdc2(3)>, L<ripemd(3)|ripemd(3)>, L<sha(3)|sha(3)>, L<dgst(1)|dgst(1)>
fr: L<B<EVP_DigestVerifyInit>(3)|EVP_DigestVerifyInit(3)>, L<B<EVP_DigestInit>(3)|EVP_DigestInit(3)>, L<B<err>(3)|err(3)>, L<B<evp>(3)|evp(3)>, L<B<hmac>(3)|hmac(3)>, L<B<md2>(3)|md2(3)>, L<B<md5>(3)|md5(3)>, L<B<mdc2>(3)|mdc2(3)>, L<B<ripemd>(3)|ripemd(3)>, L<B<sha>(3)|sha(3)>, L<B<dgst>(1)|dgst(1)>

source: EVP_DigestSignInit(), EVP_DigestSignUpdate() and EVP_DigestSignFinal() were first added to OpenSSL 1.0.0.
fr: B<EVP_DigestSignInit>(), B<EVP_DigestSignUpdate>() et B<EVP_DigestSignFinal>() ont été ajoutées pour la première fois à OpenSSL 1.0.0.

source: EVP_DigestVerifyInit, EVP_DigestVerifyUpdate, EVP_DigestVerifyFinal - EVP signature verification functions
fr: EVP_DigestVerifyInit, EVP_DigestVerifyUpdate, EVP_DigestVerifyFinal - Fonctions EVP de vérification de signature

source: int EVP_DigestVerifyInit(EVP_MD_CTX *ctx, EVP_PKEY_CTX **pctx, const EVP_MD *type, ENGINE *e, EVP_PKEY *pkey); int EVP_DigestVerifyUpdate(EVP_MD_CTX *ctx, const void *d, unsigned int cnt); int EVP_DigestVerifyFinal(EVP_MD_CTX *ctx, const unsigned char *sig, size_t siglen);
fr: B< int EVP_DigestVerifyInit(EVP_MD_CTX *>I<ctx>B<, EVP_PKEY_CTX **>I<pctx>B<,> B<const EVP_MD *>I<type>B<, ENGINE *e, EVP_PKEY *>I<pkey>B<);> B<int EVP_DigestVerifyUpdate(EVP_MD_CTX *>I<ctx>B<, const void *>I<d>B<, unsigned int> I<cnt>B<);> B<int EVP_DigestVerifyFinal(EVP_MD_CTX *>I<ctx>B<, const unsigned char *>I<sig>B<, size_t> I<siglen>B<);>

source: EVP_DigestVerifyInit() sets up verification context B<ctx> to use digest B<type> from ENGINE B<impl> and public key B<pkey>. B<ctx> must be initialized with EVP_MD_CTX_init() before calling this function. If B<pctx> is not NULL the EVP_PKEY_CTX of the verification operation will be written to B<*pctx>: this can be used to set alternative verification options.
fr: B<EVP_DigestVerifyInit>() définit le contexte de vérification I<ctx> pour le condensé de message de I<type> à partir de l’ENGINE I<impl> et de la clef publique I<pkey>. I<ctx> doit être initialisé avec B<EVP_MD_CTX_init>() avant d’appeler cette fonction. Si I<pctx> n’est pas NULL, B<EVP_PKEY_CTX> de l’opération de vérification sera écrite dans I<*pctx> : cela peut être utilisé pour définir des options alternatives de vérification.

source: EVP_DigestVerifyUpdate() hashes B<cnt> bytes of data at B<d> into the verification context B<ctx>. This function can be called several times on the same B<ctx> to include additional data. This function is currently implemented using a macro.
fr: B<EVP_DigestVerifyUpdate>() produit un hachage de I<cnt> octets de données vers I<d> dans le contexte de vérification I<ctx>. Cette fonction peut être appelée plusieurs fois sur le même I<ctx> pour intégrer des données additionnelles. Cette fonction est actuellement mise en œuvre en utilisant une macro.

source: EVP_DigestVerifyFinal() verifies the data in B<ctx> against the signature in B<sig> of length B<siglen>.
fr: B<EVP_DigestVerifyFinal>() vérifie les données dans I<ctx> par rapport à la signature dans I<sig> de longueur I<siglen>.

source: EVP_DigestVerifyInit() and EVP_DigestVerifyUpdate() return 1 for success and 0 or a negative value for failure. In particular a return value of -2 indicates the operation is not supported by the public key algorithm.
fr: B<EVP_DigestVerifyInit>() et B<EVP_DigestVerifyUpdate>() renvoient B<1> en cas de réussite et B<0> ou une valeur négative en cas d’échec. En particulier, une valeur de retour de B<-2> signifie que l’opération n’est pas prise en charge par l’algorithme de clef publique.

source: Unlike other functions the return value 0 from EVP_DigestVerifyFinal() only indicates that the signature did not verify successfully (that is tbs did not match the original data or the signature was of invalid form) it is not an indication of a more serious error.
fr: Contrairement à d’autres fonctions, la valeur B<0> de retour de B<EVP_DigestVerifyFinal>() signifie seulement que la signature n’a pas conduit à une réussite de la vérification (c’est-à-dire, ce qui est à signer ne correspond pas aux données originelles ou la signature était de forme incorrecte) ; ce n’est pas une indication d’une erreur plus sérieuse.

source: The call to EVP_DigestVerifyFinal() internally finalizes a copy of the digest context. This means that EVP_VerifyUpdate() and EVP_VerifyFinal() can be called later to digest and verify additional data.
fr: L’appel à B<EVP_DigestVerifyFinal>() en interne réalise une copie du contexte du condensé de message. Cela signifie que B<EVP_VerifyUpdate>() et B<EVP_VerifyFinal>() peuvent être ensuite appelées pour incorporer et vérifier des données additionnelles.

source: L<EVP_DigestSignInit(3)|EVP_DigestSignInit(3)>, L<EVP_DigestInit(3)|EVP_DigestInit(3)>, L<err(3)|err(3)>, L<evp(3)|evp(3)>, L<hmac(3)|hmac(3)>, L<md2(3)|md2(3)>, L<md5(3)|md5(3)>, L<mdc2(3)|mdc2(3)>, L<ripemd(3)|ripemd(3)>, L<sha(3)|sha(3)>, L<dgst(1)|dgst(1)>
fr: L<B<EVP_DigestSignInit>(3)|EVP_DigestSignInit(3)>, L<B<EVP_DigestInit>(3)|EVP_DigestInit(3)>, L<B<err>(3)|err(3)>, L<B<evp>(3)|evp(3)>, L<B<hmac>(3)|hmac(3)>, L<B<md2>(3)|md2(3)>, L<B<md5>(3)|md5(3)>, L<B<mdc2>(3)|mdc2(3)>, L<B<ripemd>(3)|ripemd(3)>, L<B<sha>(3)|sha(3)>, L<B<dgst>(1)|dgst(1)>

source: EVP_DigestVerifyInit(), EVP_DigestVerifyUpdate() and EVP_DigestVerifyFinal() were first added to OpenSSL 1.0.0.
fr: B<EVP_DigestVerifyInit>(), B<EVP_DigestVerifyUpdate>() et B<EVP_DigestVerifyFinal>() ont été ajoutées pour la première fois à OpenSSL 1.0.0.

source: EVP_CIPHER_CTX_init, EVP_EncryptInit_ex, EVP_EncryptUpdate, EVP_EncryptFinal_ex, EVP_DecryptInit_ex, EVP_DecryptUpdate, EVP_DecryptFinal_ex, EVP_CipherInit_ex, EVP_CipherUpdate, EVP_CipherFinal_ex, EVP_CIPHER_CTX_set_key_length, EVP_CIPHER_CTX_ctrl, EVP_CIPHER_CTX_cleanup, EVP_EncryptInit, EVP_EncryptFinal, EVP_DecryptInit, EVP_DecryptFinal, EVP_CipherInit, EVP_CipherFinal, EVP_get_cipherbyname, EVP_get_cipherbynid, EVP_get_cipherbyobj, EVP_CIPHER_nid, EVP_CIPHER_block_size, EVP_CIPHER_key_length, EVP_CIPHER_iv_length, EVP_CIPHER_flags, EVP_CIPHER_mode, EVP_CIPHER_type, EVP_CIPHER_CTX_cipher, EVP_CIPHER_CTX_nid, EVP_CIPHER_CTX_block_size, EVP_CIPHER_CTX_key_length, EVP_CIPHER_CTX_iv_length, EVP_CIPHER_CTX_get_app_data, EVP_CIPHER_CTX_set_app_data, EVP_CIPHER_CTX_type, EVP_CIPHER_CTX_flags, EVP_CIPHER_CTX_mode, EVP_CIPHER_param_to_asn1, EVP_CIPHER_asn1_to_param, EVP_CIPHER_CTX_set_padding, EVP_enc_null, EVP_des_cbc, EVP_des_ecb, EVP_des_cfb, EVP_des_ofb, EVP_des_ede_cbc, EVP_des_ede, EVP_des_ede_ofb, EVP_des_ede_cfb, EVP_des_ede3_cbc, EVP_des_ede3, EVP_des_ede3_ofb, EVP_des_ede3_cfb, EVP_desx_cbc, EVP_rc4, EVP_rc4_40, EVP_idea_cbc, EVP_idea_ecb, EVP_idea_cfb, EVP_idea_ofb, EVP_idea_cbc, EVP_rc2_cbc, EVP_rc2_ecb, EVP_rc2_cfb, EVP_rc2_ofb, EVP_rc2_40_cbc, EVP_rc2_64_cbc, EVP_bf_cbc, EVP_bf_ecb, EVP_bf_cfb, EVP_bf_ofb, EVP_cast5_cbc, EVP_cast5_ecb, EVP_cast5_cfb, EVP_cast5_ofb, EVP_rc5_32_12_16_cbc, EVP_rc5_32_12_16_ecb, EVP_rc5_32_12_16_cfb, EVP_rc5_32_12_16_ofb, EVP_aes_128_gcm, EVP_aes_192_gcm, EVP_aes_256_gcm, EVP_aes_128_ccm, EVP_aes_192_ccm, EVP_aes_256_ccm - EVP cipher routines
fr: EVP_CIPHER_CTX_init, EVP_EncryptInit_ex, EVP_EncryptUpdate, EVP_EncryptFinal_ex, EVP_DecryptInit_ex, EVP_DecryptUpdate, EVP_DecryptFinal_ex, EVP_CipherInit_ex, EVP_CipherUpdate, EVP_CipherFinal_ex, EVP_CIPHER_CTX_set_key_length, EVP_CIPHER_CTX_ctrl, EVP_CIPHER_CTX_cleanup, EVP_EncryptInit, EVP_EncryptFinal, EVP_DecryptInit, EVP_DecryptFinal, EVP_CipherInit, EVP_CipherFinal, EVP_get_cipherbyname, EVP_get_cipherbynid, EVP_get_cipherbyobj, EVP_CIPHER_nid, EVP_CIPHER_block_size, EVP_CIPHER_key_length, EVP_CIPHER_iv_length, EVP_CIPHER_flags, EVP_CIPHER_mode, EVP_CIPHER_type, EVP_CIPHER_CTX_cipher, EVP_CIPHER_CTX_nid, EVP_CIPHER_CTX_block_size, EVP_CIPHER_CTX_key_length, EVP_CIPHER_CTX_iv_length, EVP_CIPHER_CTX_get_app_data, EVP_CIPHER_CTX_set_app_data, EVP_CIPHER_CTX_type, EVP_CIPHER_CTX_flags, EVP_CIPHER_CTX_mode, EVP_CIPHER_param_to_asn1, EVP_CIPHER_asn1_to_param, EVP_CIPHER_CTX_set_padding, EVP_enc_null, EVP_des_cbc, EVP_des_ecb, EVP_des_cfb, EVP_des_ofb, EVP_des_ede_cbc, EVP_des_ede, EVP_des_ede_ofb, EVP_des_ede_cfb, EVP_des_ede3_cbc, EVP_des_ede3, EVP_des_ede3_ofb, EVP_des_ede3_cfb, EVP_desx_cbc, EVP_rc4, EVP_rc4_40, EVP_idea_cbc, EVP_idea_ecb, EVP_idea_cfb, EVP_idea_ofb, EVP_idea_cbc, EVP_rc2_cbc, EVP_rc2_ecb, EVP_rc2_cfb, EVP_rc2_ofb, EVP_rc2_40_cbc, EVP_rc2_64_cbc, EVP_bf_cbc, EVP_bf_ecb, EVP_bf_cfb, EVP_bf_ofb, EVP_cast5_cbc, EVP_cast5_ecb, EVP_cast5_cfb, EVP_cast5_ofb, EVP_rc5_32_12_16_cbc, EVP_rc5_32_12_16_ecb, EVP_rc5_32_12_16_cfb, EVP_rc5_32_12_16_ofb, EVP_aes_128_gcm, EVP_aes_192_gcm, EVP_aes_256_gcm, EVP_aes_128_ccm, EVP_aes_192_ccm, EVP_aes_256_ccm - Routines de chiffrement EVP

source: void EVP_CIPHER_CTX_init(EVP_CIPHER_CTX *a);
fr: B< void EVP_CIPHER_CTX_init(EVP_CIPHER_CTX *a);>

source: int EVP_EncryptInit_ex(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, ENGINE *impl, unsigned char *key, unsigned char *iv); int EVP_EncryptUpdate(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl, unsigned char *in, int inl); int EVP_EncryptFinal_ex(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl);
fr: B< int EVP_EncryptInit_ex(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<ENGINE *>I<impl>B<, unsigned char *>I<key>B<, unsigned char *>I<iv>B<);> B<int EVP_EncryptUpdate(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<out>B<,> B<int *>I<outl>B<, unsigned char *>I<in>B<, int> I<inl>B<);> B<int EVP_EncryptFinal_ex(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<out>B<,> B<int *>I<outl>B<);>

source: int EVP_DecryptInit_ex(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, ENGINE *impl, unsigned char *key, unsigned char *iv); int EVP_DecryptUpdate(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl, unsigned char *in, int inl); int EVP_DecryptFinal_ex(EVP_CIPHER_CTX *ctx, unsigned char *outm, int *outl);
fr: B< int EVP_DecryptInit_ex(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<ENGINE *>I<impl>B<, unsigned char *>I<key>B<, unsigned char *>I<iv>B<);> B<int EVP_DecryptUpdate(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<out>B<,> B<int *>I<outl>B<, unsigned char *>I<in>B<, int> I<inl>B<);> B<int EVP_DecryptFinal_ex(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *outm,> B<int *>I<outl>B<);>

source: int EVP_CipherInit_ex(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, ENGINE *impl, unsigned char *key, unsigned char *iv, int enc); int EVP_CipherUpdate(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl, unsigned char *in, int inl); int EVP_CipherFinal_ex(EVP_CIPHER_CTX *ctx, unsigned char *outm, int *outl);
fr: B< int EVP_CipherInit_ex(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<ENGINE *>I<impl>B<, unsigned char *>I<key>B<, unsigned char *>I<iv>B<, int enc);> B<int EVP_CipherUpdate(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<out>B<,> B<int *>I<outl>B<, unsigned char *>I<in>B<, int> I<inl>B<);> B<int EVP_CipherFinal_ex(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *outm,> B<int *>I<outl>B);>

source: int EVP_EncryptInit(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, unsigned char *key, unsigned char *iv); int EVP_EncryptFinal(EVP_CIPHER_CTX *ctx, unsigned char *out, int *outl);
fr: B< int EVP_EncryptInit(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<unsigned char *>I<key>B<, unsigned char *>I<iv>B<);> B<int EVP_EncryptFinal(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<out>B<,> B<int *>I<outl>B<);>

source: int EVP_DecryptInit(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, unsigned char *key, unsigned char *iv); int EVP_DecryptFinal(EVP_CIPHER_CTX *ctx, unsigned char *outm, int *outl);
fr: B< int EVP_DecryptInit(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<unsigned char *>I<key>B<, unsigned char *>I<iv>B<);> B<int EVP_DecryptFinal(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<outm>B<,> B<int *>I<outl>B<);>

source: int EVP_CipherInit(EVP_CIPHER_CTX *ctx, const EVP_CIPHER *type, unsigned char *key, unsigned char *iv, int enc); int EVP_CipherFinal(EVP_CIPHER_CTX *ctx, unsigned char *outm, int *outl);
fr: B< int EVP_CipherInit(EVP_CIPHER_CTX *>I<ctx>B<, const EVP_CIPHER *>I<type>B<,> B<unsigned char *>I<key>B<, unsigned char *>I<iv>B<, int> I<enc>B<);> B<int EVP_CipherFinal(EVP_CIPHER_CTX *>I<ctx>B<, unsigned char *>I<outm>B<,> B<int *>I<outl>B<);>

source: int EVP_CIPHER_CTX_set_padding(EVP_CIPHER_CTX *x, int padding); int EVP_CIPHER_CTX_set_key_length(EVP_CIPHER_CTX *x, int keylen); int EVP_CIPHER_CTX_ctrl(EVP_CIPHER_CTX *ctx, int type, int arg, void *ptr); int EVP_CIPHER_CTX_cleanup(EVP_CIPHER_CTX *a);
fr: B< int EVP_CIPHER_CTX_set_padding(EVP_CIPHER_CTX *x, int padding);> B<int EVP_CIPHER_CTX_set_key_length(EVP_CIPHER_CTX *x, int keylen);> B<int EVP_CIPHER_CTX_ctrl(EVP_CIPHER_CTX *>I<ctx>B<, int> I<type>B<, int arg, void *ptr);> B<int EVP_CIPHER_CTX_cleanup(EVP_CIPHER_CTX *a);>

source: const EVP_CIPHER *EVP_get_cipherbyname(const char *name); #define EVP_get_cipherbynid(a) EVP_get_cipherbyname(OBJ_nid2sn(a)) #define EVP_get_cipherbyobj(a) EVP_get_cipherbynid(OBJ_obj2nid(a))
fr: B< const EVP_CIPHER *EVP_get_cipherbyname(const char *name);> B<#define EVP_get_cipherbynid(a) EVP_get_cipherbyname(OBJ_nid2sn(a))> B<#define EVP_get_cipherbyobj(a) EVP_get_cipherbynid(OBJ_obj2nid(a))>

source: #define EVP_CIPHER_nid(e) ((e)->nid) #define EVP_CIPHER_block_size(e) ((e)->block_size) #define EVP_CIPHER_key_length(e) ((e)->key_len) #define EVP_CIPHER_iv_length(e) ((e)->iv_len) #define EVP_CIPHER_flags(e) ((e)->flags) #define EVP_CIPHER_mode(e) ((e)->flags) & EVP_CIPH_MODE) int EVP_CIPHER_type(const EVP_CIPHER *ctx);
fr: B< #define EVP_CIPHER_nid(e) ((e)-E<gt>nid)> B<#define EVP_CIPHER_block_size(e) ((e)-E<gt>block_size)> B<#define EVP_CIPHER_key_length(e) ((e)-E<gt>key_len)> B<#define EVP_CIPHER_iv_length(e) ((e)-E<gt>iv_len)> B<#define EVP_CIPHER_flags(e) ((e)-E<gt>flags)> B<#define EVP_CIPHER_mode(e) ((e)-E<gt>flags) & EVP_CIPH_MODE)> B<int EVP_CIPHER_type(const EVP_CIPHER *>I<ctx>B<);>
