Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/po/*/c_rehash.pod.po
Languages: fr

source: NAME
fr: NOM

source: SEE ALSO
fr: VOIR AUSSI

source: BUGS
fr: BOGUES

source: c_rehash - Create symbolic links to files named by the hash values
fr: c_rehash - Créer des liens symboliques vers les fichiers en utilisant une valeur de hachage

source: B<c_rehash> [directory] ...
fr: B<c_rehash> [répertoire] ...

source: c_rehash scans directories and takes a hash value of each .pem and .crt file in the directory. It then creates symbolic links for each of the files named by the hash value. This is useful as many programs require directories to be set up like this in order to find the certificates they require.
fr: c_rehash parcourt les répertoires et prend une valeur de hachage de chaque fichier .pem et .crt dans le répertoire. Il crée ensuite des liens symboliques pour chacun de ces fichiers en les nommant par la valeur du haché. C'est utile parce que beaucoup de programmes imposent à des répertoires d'être configurés de la sorte pour trouver les certificats qu'ils recherchent.

source: If any directories are named on the command line then these directories are processed in turn. If not then and the environment variable SSL_CERT_DIR is defined then that is consulted. This variable should be a colon (:) separated list of directories, all of which will be processed. If neither of these conditions are true then /usr/lib/ssl/certs is processed.
fr: Si des répertoires sont indiqués sur la ligne de commande, alors ces répertoires sont traités chacun à son tour. Sinon, et si la variable d'environnement SSL_CERT_DIR est définies, les répertoires spécifiées dans celle-ci sont traités. Cette variable doit être une liste de répertoires séparés par des deux-points (« : »), chacun étant à traiter. Si aucun répertoire n'est précisé d'une de ces façon, c'est le répertoire /usr/lib/ssl/certs qui sera traité.

source: For each directory that is to be processed he user must have write permissions on the directory, if they do not then nothing will be printed for that directory.
fr: Pour chaque répertoire à traiter, l'utilisateur doit avoir les droits en écriture sur le répertoire. Si ce n'est pas le cas, rien ne sera afficher pour ce répertoire.

source: Note that this program deletes all the symbolic links that look like ones that it creates before processing a directory. Beware that if you run the program on a directory that contains symbolic links for other purposes that are named in the same format as those created by this program they will be lost.
fr: Notez que ce programme détruit tous les liens symboliques qui ressemblerait à un lien créé auparavant. Faites donc attention si vous exécutez ce programme pour un répertoire qui contient des liens symboliques pour d'autres raisons et qu'ils sont nommés avec le même format que ceux créé par ce programme, puisqu'ils seront perdus.

source: The hashes for certificate files are of the form <hash>.<n> where n is an integer. If the hash value already exists then n will be incremented, unless the file is a duplicate. Duplicates are detected using the fingerprint of the certificate. A warning will be printed if a duplicate is detected. The hashes for CRL files are of the form <hash>.r<n> and have the same behavior.
fr: Les hachés des fichiers de certificats sont de la forme <haché>.<n> où n est un entier. Si la valeur du haché existe, alors n est incrémenté, à moins que le fichier soit identique. Les doublons sont détectés en utilisant l'empreinte du certificat. Un avertissement sera affiché si un doublon est détecté. Les hachés des fichiers de CRL sont de la forme <haché>.r<n> et à le même comportement.

source: The program will also warn if there are files with extension .pem which are not certificate or CRL files.
fr: Le programme avertira également s'il y a des fichiers avec l'extension .pem qui ne sont ni des certificats ni des CRL.

source: The program uses the openssl program to compute the hashes and fingerprints. It expects the executable to be named openssl and be on the PATH, or in the /usr/lib/ssl/bin directory. If the OPENSSL environment variable is defined then this is used instead as the executable that provides the hashes and fingerprints. When called as $OPENSSL x509 -hash -fingerprint -noout -in $file it must output the hash of $file on the first line followed by the fingerprint on the second line, optionally prefixed with some text and an equals sign (=).
fr: Le programme utilise le programme openssl pour calculer le haché et l'empreinte. Il nécessite que l'exécutable soit nommé openssl et qu'il soit accessible depuis les chemins de recherche PATH, ou dans le répertoire /usr/lib/ssl/bin. Si la variable d'environnement OPENSSL est définie, alors l'exécutable précisée dans celle-ci est utilisée à la place comme exécutable fournissant les hachés et les empreintes. Quand elle est appelée avec $OPENSSL x509 -hash -fingerprint -noout -in $fichier, elle doit produire le haché de $fichier sur la première ligne suivit par l'empreinte sur la seconde ligne, précédés éventuellement de texte suivi d'un signe égal (« = »).

source: None
fr: Aucun

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: The name (and path) of an executable to use to generate hashes and fingerprints (see above).
fr: Le nom (et le chemin) d'un exécutable à utiliser pour générer des hachés et des empreintes (voir ci-dessus).

source: Colon separated list of directories to operate on. Ignored if directories are listed on the command line.
fr: Liste de répertoires séparés par des deux-points sur lesquels opérer. La liste est ignorée si des répertoires sont fournis sur la ligne de commande.

source: No known bugs
fr: Aucun bogue connu
