Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/po/*/dgst.pod.po
Languages: fr

source: NAME
fr: NOM

source: B<-out filename>
fr: B<-out nom_fichier>

source: B<-passin arg>
fr: B<-passin param>

source: dgst, md5, md4, md2, sha1, sha, mdc2, ripemd160 - message digests
fr: dgst, md5, md4, md2, sha1, sha, mdc2, ripemd160 - Condensés de messages

source: [B<md5|md4|md2|sha1|sha|mdc2|ripemd160>] [B<-c>] [B<-d>] [B<file...>]
fr: [B<md5|md4|md2|sha1|sha|mdc2|ripemd160>] [B<-c>] [B<-d>] [B<fichier...>]

source: The digest functions output the message digest of a supplied file or files in hexadecimal form. They can also be used for digital signing and verification.
fr: Les fonctions de condensés génèrent les condensés des messages d'un ou plusieurs fichiers fournis sous forme hexadécimale. Elles peuvent également servir pour la signature numérique et la vérification.

source: print out the digest in two digit groups separated by colons, only relevant if B<hex> format output is used.
fr: Afficher le condensé par groupe de deux chiffres séparés par des deux-points, uniquement appliquable si le format de sortie B<hex> est employé.

source: print out BIO debugging information.
fr: Afficher les informations de débogage BIO.

source: digest is to be output as a hex dump. This is the default case for a "normal" digest as opposed to a digital signature.
fr: Afficher le condensé en héxadécimal brut. Ceci est le cas par défaut pour les condensés « normaux » en opposition aux signatures numériques.

source: output the digest or signature in binary form.
fr: Afficher le condensé sous forme binaire.

source: filename to output to, or standard output by default.
fr: Nom du fichier de sortie. Par défaut, la sortie standard est utilisée.

source: B<-sign filename>
fr: B<-sign nom_fichier>

source: digitally sign the digest using the private key in "filename".
fr: Signer numériquement le condensé en utilisant la clé privée de B<nom_fichier>.

source: the private key password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source du mot de passe de la clé privée. Pour plus d'informations sur le format de B<param>, consultez B<PHRASE DE PASSE EN PARAMÈTRE> dans L<openssl(1)|openssl(1)>.

source: B<-verify filename>
fr: B<-verify nom_fichier>

source: verify the signature using the the public key in "filename". The output is either "Verification OK" or "Verification Failure".
fr: Vérifier la signature en utilisant la clé publique de B<nom_fichier>. Le résultat est soit « Verification OK » soit « Verification Failure ».

source: B<-prverify filename>
fr: B<-prverify nom_fichier>

source: verify the signature using the the private key in "filename".
fr: Vérifier la signature en utilisant la clé privée de « nom_fichier ».

source: B<-signature filename>
fr: B<-signature nom_fichier>

source: the actual signature to verify.
fr: La signature à vérifier.

source: B<-rand file(s)>
fr: B<-rand fichier(s)>

source: a file or files containing random data used to seed the random number generator, or an EGD socket (see L<RAND_egd(3)|RAND_egd(3)>). Multiple files can be specified separated by a OS-dependent character. The separator is B<;> for MS-Windows, B<,> for OpenVMS, and B<:> for all others.
fr: Un ou plusieurs fichiers contenant des données aléatoires utilisées pour initialiser le générateur de nombres pseudo-aléatoires, ou une socket EGD (consultez L<RAND_egd(3)|RAND_egd(3)>). Plusieurs fichiers peuvent être spécifiés en les séparant par le séparateur du système d'exploitation : « B<;> » pour MS-Windows, « B<,> » pour OpenVMS et « B<:> » pour tous les autres.

source: B<file...>
fr: B<fichier...>

source: file or files to digest. If no files are specified then standard input is used.
fr: Le fichier ou les fichiers à traiter. Par défaut, l'entrée standard est utilisée.

source: The digest of choice for all new applications is SHA1. Other digests are however still widely used.
fr: Le condensé à préférer pour toutes les nouvelles applications est SHA1. D'autres condensés reste cependant largement utilisés.

source: If you wish to sign or verify data using the DSA algorithm then the dss1 digest must be used.
fr: Pour signer ou vérifier des données avec l'algorithme DSA, le condensé dss1 doit être utilisé.

source: A source of random numbers is required for certain signing algorithms, in particular DSA.
fr: Une source de nombres aléatoires est nécessaire pour certains algorithmes de signature, en particulier DSA.

source: The signing and verify options should only be used if a single file is being signed or verified.
fr: Les options de signature et de vérification devraient être utilisées seulement si un seul fichier est signé ou vérifié.
