Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/po/*/pkcs12.pod.po
Languages: fr

source: NAME
fr: NOM

source: COMMAND OPTIONS
fr: OPTIONS DE LA COMMANDE

source: EXAMPLES
fr: EXEMPLES

source: SEE ALSO
fr: VOIR AUSSI

source: B<-in filename>
fr: B<-in nomfichier>

source: B<-out filename>
fr: B<-out nomfichier>

source: BUGS
fr: BOGUES

source: B<-certfile filename>
fr: B<-certfile nomfichier>

source: B<-rand file(s)>
fr: B<-rand fichier(s)>

source: a file or files containing random data used to seed the random number generator, or an EGD socket (see L<RAND_egd(3)|RAND_egd(3)>). Multiple files can be specified separated by a OS-dependent character. The separator is B<;> for MS-Windows, B<,> for OpenVMS, and B<:> for all others.
fr: Un ou plusieurs fichiers contenant des données aléatoires utilisées pour initialiser le générateur de nombres pseudo-aléatoires, ou une socket EGD (consultez L<RAND_egd(3)|RAND_egd(3)>). Plusieurs fichiers peuvent être spécifiés en les séparant par le séparateur du système d'exploitation : « B<;> » pour MS-Windows, « B<,> » pour OpenVMS et « B<:> » pour tous les autres.

source: B<-passout arg>
fr: B<-passout param>

source: pkcs12 - PKCS#12 file utility
fr: pkcs12 - Utilitaire pour les fichiers PKCS#12

source: B<openssl> B<pkcs12> [B<-export>] [B<-chain>] [B<-inkey filename>] [B<-certfile filename>] [B<-name name>] [B<-caname name>] [B<-in filename>] [B<-out filename>] [B<-noout>] [B<-nomacver>] [B<-nocerts>] [B<-clcerts>] [B<-cacerts>] [B<-nokeys>] [B<-info>] [B<-des>] [B<-des3>] [B<-idea>] [B<-nodes>] [B<-noiter>] [B<-maciter>] [B<-twopass>] [B<-descert>] [B<-certpbe>] [B<-keypbe>] [B<-keyex>] [B<-keysig>] [B<-password arg>] [B<-passin arg>] [B<-passout arg>] [B<-rand file(s)>]
fr: B<openssl> B<pkcs12> [B<-export>] [B<-chain>] [B<-inkey nomfichier>] [B<-certfile nomfichier>] [B<-name nom>] [B<-caname nom>] [B<-in nomfichier>] [B<-out nomfichier>] [B<-noout>] [B<-nomacver>] [B<-nocerts>] [B<-clcerts>] [B<-cacerts>] [B<-nokeys>] [B<-info>] [B<-des>] [B<-des3>] [B<-idea>] [B<-nodes>] [B<-noiter>] [B<-maciter>] [B<-twopass>] [B<-descert>] [B<-certpbe>] [B<-keypbe>] [B<-keyex>] [B<-keysig>] [B<-password param>] [B<-passin param>] [B<-passout param>] [B<-rand fichier(s)>]

source: The B<pkcs12> command allows PKCS#12 files (sometimes referred to as PFX files) to be created and parsed. PKCS#12 files are used by several programs including Netscape, MSIE and MS Outlook.
fr: La commande B<pkcs12> permet la création et l'interprétation de fichiers PKCS#12 (parfois également appellés PFX). Les fichiers PKCS#12 sont utilisés par plusieurs programmes, entre autres Netscape, MSIE et MS Outlook.

source: There are a lot of options the meaning of some depends of whether a PKCS#12 file is being created or parsed. By default a PKCS#12 file is parsed a PKCS#12 file can be created by using the B<-export> option (see below).
fr: Il y a de nombreuses options dont certaines diffèrent selon que l'on génère ou interprète un fichier. L'opération par défaut est l'interprétation, pour la création d'un fichier PKCS#12, il faut utiliser l'option B<-export>.

source: PARSING OPTIONS
fr: OPTIONS D'INTERPRÉTATION

source: This specifies filename of the PKCS#12 file to be parsed. Standard input is used by default.
fr: Ceci spécifie le nom du fichier PKCS#12 à interpréter. Par défaut, l'entrée standard est lue.

source: The filename to write certificates and private keys to, standard output by default. They are all written in PEM format.
fr: Le nom de fichier où seront écrits les certificats et les clés privées. Par défaut ce sera la sortie standard. Ils sont tous écrits au format PEM.

source: B<-pass arg>, B<-passin arg>
fr: B<-pass param>, B<-passin param>

source: the PKCS#12 file (i.e. input file) password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: Le fichier PKCS#12 source des mots de passe (c'est-à-dire le fichier d'entrée). Pour plus d'informations sur le format de B<param>, voir la section B<PHRASE DE PASSE EN PARAMÈTRE> d'L<openssl(1)|openssl(1)>.

source: pass phrase source to encrypt any outputed private keys with. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source de mot de passe à utiliser pour le chiffrement des clés privées sorties. Pour plus d'informations sur le format de B<param>, voir la section B<PHRASE DE PASSE EN PARAMÈTRE> d'L<openssl(1)|openssl(1)>.

source: this option inhibits output of the keys and certificates to the output file version of the PKCS#12 file.
fr: Cette option empêche l'ajout des clés et des certificats vers la version de sortie du fichier PKCS#12.

source: only output client certificates (not CA certificates).
fr: Sortie uniquement des certificats clients (et non des certificats CA).

source: only output CA certificates (not client certificates).
fr: Sortie uniquement des certificats CA (et non des certificats clients).

source: no certificates at all will be output.
fr: Aucun certificat ne sera sorti.

source: no private keys will be output.
fr: Aucune clé privée ne sera sortie.

source: output additional information about the PKCS#12 file structure, algorithms used and iteration counts.
fr: Sortie d'informations supplémentaires sur la structure du fichier PKCS#12, sur les agorithmes employés et sur les nombres d'itérations.

source: use DES to encrypt private keys before outputting.
fr: Utilisation du chiffrement DES pour les clés privées avant la sortie.

source: use triple DES to encrypt private keys before outputting, this is the default.
fr: Utilisation du chiffrement triple DES pour les clés privées avant la sortie, c'est l'algorithme utilisé par défaut.

source: use IDEA to encrypt private keys before outputting.
fr: Utilisation du chiffrement IDEA pour les clés privées avant la sortie.

source: don't encrypt the private keys at all.
fr: Ne pas chiffrer les clés privées du tout.

source: don't attempt to verify the integrity MAC before reading the file.
fr: Ne pas vérifier l'intégrité MAC avant la lecture du fichier.

source: prompt for separate integrity and encryption passwords: most software always assumes these are the same so this option will render such PKCS#12 files unreadable.
fr: Demande des mots de passe distincts pour l'intégrité et le chiffrement ; la plupart des logiciels supposent toujours l'égalité, ainsi cette option rendra le fichier PKCS#12 illisible pour ces logiciels.

source: FILE CREATION OPTIONS
fr: OPTIONS DE CRÉATION DE FICHIER

source: This option specifies that a PKCS#12 file will be created rather than parsed.
fr: Cette option spécifie qu'un fichier PKCS#12 sera généré plutôt que lu.

source: This specifies filename to write the PKCS#12 file to. Standard output is used by default.
fr: Ceci spécifie le nom du fichier PKCS#12 de sortie. La sortie standard est utilisée par défaut.

source: The filename to read certificates and private keys from, standard input by default. They must all be in PEM format. The order doesn't matter but one private key and its corresponding certificate should be present. If additional certificates are present they will also be included in the PKCS#12 file.
fr: Le nom de fichier à partir duquel les certificats et les clés privées sont lues. Par défaut, ce sera l'entrée standard. Ils doivent tous être au format PEM. L'ordre n'est pas important, mais une clé privée et le certificat correspondant devrait être présent. Si des certificats supplémentaires sont présents, ils seront également inclus dans le fichier PKCS#12.

source: B<-inkey filename>
fr: B<-inkey nomfichier>

source: file to read private key from. If not present then a private key must be present in the input file.
fr: Le fichier à partir duquel sera lue la clé privée. Si cette option n'est pas présente, la clé doit faire partie du fichier d'entrée.

source: B<-name friendlyname>
fr: B<-name nomconvivial>

source: This specifies the "friendly name" for the certificate and private key. This name is typically displayed in list boxes by software importing the file.
fr: Ceci spécifie le nom convivial du certificat et de la clé privée. Ce nom est typiquement affiché dans les contrôles de liste par les logiciels qui utilisent ce fichier.

source: A filename to read additional certificates from.
fr: Un nom de fichier à partir duquel des certificats supplémentaires seront lus.

source: B<-caname friendlyname>
fr: B<-caname nomconvivial>

source: This specifies the "friendly name" for other certificates. This option may be used multiple times to specify names for all certificates in the order they appear. Netscape ignores friendly names on other certificates whereas MSIE displays them.
fr: Ceci spécifie le nom convivial pour d'autres certificats. Cette option peut être utilisée plusieurs fois et correspondre alors aux certificats dans l'ordre d'apparition. Netscape ignore les noms conviviaux des autres certificats alors que MSIE les affiche.

source: B<-pass arg>, B<-passout arg>
fr: B<-pass param>, B<-passout param>

source: the PKCS#12 file (i.e. output file) password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: Le fichier PKCS#12 source des mots de passe (c'est-à-dire le fichier d'entrée). Pour plus d'informations sur le format de B<param>, voir la section B<PHRASE DE PASSE EN PARAMÈTRE> d'L<openssl(1)|openssl(1)>.

source: B<-passin password>
fr: B<-passin motdepasse>

source: pass phrase source to decrypt any input private keys with. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source de mot de passe à utiliser pour l'encodage des clés privées de sortie. Pour plus d'informations sur le format de B<param>, voir la section B<PHRASE DE PASSE EN PARAMÈTRE> d'L<openssl(1)|openssl(1)>.

source: if this option is present then an attempt is made to include the entire certificate chain of the user certificate. The standard CA store is used for this search. If the search fails it is considered a fatal error.
fr: Avec cette option, le programme tente d'inclure toute la chaîne de certification dans le certificat utilisateur. Le répertoire standard CA est utilisé pour cette recherche. Un échec de cette recherche est considérée comme une erreur fatale.

source: encrypt the certificate using triple DES, this may render the PKCS#12 file unreadable by some "export grade" software. By default the private key is encrypted using triple DES and the certificate using 40 bit RC2.
fr: Chiffrer le certificat avec DES, ceci peut rendre le certificat inutilisable avec certains logiciels « export grade ». Par défaut, la clé privée est chiffrée en triple DES et le certificat en utilisant un RC2 à 40 bits.

source: these options allow the algorithm used to encrypt the private key and certificates to be selected. Although any PKCS#5 v1.5 or PKCS#12 algorithms can be selected it is advisable only to use PKCS#12 algorithms. See the list in the B<NOTES> section for more information.
fr: Ces options permettent le choix de l'algorithme de chiffrement pour la clé privée et les certificats. Même si tous les algorithmes PKCS#5 v1.5 ou PKCS#12 sont pris en compte, il est conseillé d'utiliser uniquement PKCS#12. Référez-vous à la liste dans la section B<NOTES> pour plus de détails.

source: specifies that the private key is to be used for key exchange or just signing. This option is only interpreted by MSIE and similar MS software. Normally "export grade" software will only allow 512 bit RSA keys to be used for encryption purposes but arbitrary length keys for signing. The B<-keysig> option marks the key for signing only. Signing only keys can be used for S/MIME signing, authenticode (ActiveX control signing) and SSL client authentication, however due to a bug only MSIE 5.0 and later support the use of signing only keys for SSL client authentication.
fr: Spécifie que la clé privée est utilisée uniquement pour l'échange de clé ou la signature. Cette option est uniquement interprétée par MSIE et des produits similaires MS. Normalement, des logiciels « export grade » permettent seulement l'échange de clés RSA à 512 bits pour le chiffrement, et une clé de longueur arbitraire pour la signature. L'option B<-keysig> marque la clé pour une utilisation exclusivement pour des signatures. Une telle clé peut alors être utilisée pour la signature S/MIME, authenticode (signature par contrôles ActiveX) et l'identification de clients SSL, toutefois, uniquement MSIE 5.0 et supérieur supportent l'utilisation de clés de signature pour l'identification de clients SSL.

source: these options affect the iteration counts on the MAC and key algorithms. Unless you wish to produce files compatible with MSIE 4.0 you should leave these options alone.
fr: Ces options déterminent le nombre d'itérations pour les algorithmes MAC et certains algorithmes de clés. À moins de vouloir produire des fichiers compatibles avec MSIE 4.0, ces options peuvent être omises.

source: To discourage attacks by using large dictionaries of common passwords the algorithm that derives keys from passwords can have an iteration count applied to it: this causes a certain part of the algorithm to be repeated and slows it down. The MAC is used to check the file integrity but since it will normally have the same password as the keys and certificates it could also be attacked. By default both MAC and encryption iteration counts are set to 2048, using these options the MAC and encryption iteration counts can be set to 1, since this reduces the file security you should not use these options unless you really have to. Most software supports both MAC and key iteration counts. MSIE 4.0 doesn't support MAC iteration counts so it needs the B<-nomaciter> option.
fr: Pour décourager des attaques utilisant des dictionnaires importants de mot de passe communs, l'algorithme dérivant les clés des mots de passe peut se voir appliqué un nombre d'itérations : ceci a pour effet de répéter une certaine partie de l'algorithme et ralentit l'opération. Le MAC est employé pour s'assurer l'intégrité du fichier, mais comme il aura normalement le même mot de passe que les clés et les certificats, il peut aussi se voir attaqué. Par défaut, le nombre d'itérations du MAC et du chiffrement sont de 2048, en utilisant ces options, le nombre d'itérations MAC et du chiffrement peuvent être mises à 1. Comme ceci réduit la sécurité des informations, elles ne devraient être utilisées qu'en cas de nécessité. La plupart des logiciels supportent un nombre arbitraire d'itération et pour MAC et pour l'encodage. MSIE 4.0 ne le supporte pas pour MAC et nécessite alors l'option -nomaciter.

source: This option is included for compatibility with previous versions, it used to be needed to use MAC iterations counts but they are now used by default.
fr: Cette option est incluse pour assurer la compatibilité avec d'anciennes versions pour forcer le nombre d'itérations pour MAC. C'est actuellement le comportement par défaut.

source: Although there are a large number of options most of them are very rarely used. For PKCS#12 file parsing only B<-in> and B<-out> need to be used for PKCS#12 file creation B<-export> and B<-name> are also used.
fr: Malgré le nombre important d'options, la plupart de celles-ci ne sont utilisées que très rarement. Pour l'interprétation de fichiers PKCS#12, seules B<-in> et B<-out> sont nécessaires, pour la création, B<-export> et B<-name> sont utilisées également.

source: If none of the B<-clcerts>, B<-cacerts> or B<-nocerts> options are present then all certificates will be output in the order they appear in the input PKCS#12 files. There is no guarantee that the first certificate present is the one corresponding to the private key. Certain software which requires a private key and certificate and assumes the first certificate in the file is the one corresponding to the private key: this may not always be the case. Using the B<-clcerts> option will solve this problem by only outputting the certificate corresponding to the private key. If the CA certificates are required then they can be output to a separate file using the B<-nokeys -cacerts> options to just output CA certificates.
fr: Si aucune des options B<-clcerts>, B<-cacerts> ou B<-nocerts> n'est présente, alors tous les certificats seront générés dans l'ordre d'apparence dans les fichiers source PKCS#12. De plus, il n'y a aucune garantie que le premier certificat trouvé est celui correspondant à la clé privée. Certains logiciels nécessitant une clé privée supposent que le premier certificat du fichier correspond à la clé privée : ceci n'est pas forcément toujours le cas. En utilisant l'option l'option B<-clcerts> le problème est résolu en incluant uniquement le certificat correspondant à la clé privée. Si besoin est, les certificats CA peuvent être générées à part avec les options B<-nokeys -cacerts>.

source: The B<-keypbe> and B<-certpbe> algorithms allow the precise encryption algorithms for private keys and certificates to be specified. Normally the defaults are fine but occasionally software can't handle triple DES encrypted private keys, then the option B<-keypbe PBE-SHA1-RC2-40> can be used to reduce the private key encryption to 40 bit RC2. A complete description of all algorithms is contained in the B<pkcs8> manual page.
fr: Les options B<-keypbe> et B<-certpbe> permettent de préciser l'algorithme de chiffrement pour la clé privée et pour les certificats. Normalement, les valeurs par défauts devraient convenir, mais certains logiciels ne gèrent pas les clés privées encodées avec triple DES, alors l'option B<-keypbe PBE-SHA1-RC2-40> réduit le chiffrement de la clé privée à un RC2 de 40 bits. Une description complète de tous les algorithmes est contenue dans la page de manuel de B<pkcs8>.

source: Parse a PKCS#12 file and output it to a file:
fr: Interprétation d'un fichier PKCS#12 et sortie vers un fichier :

source: Output only client certificates to a file:
fr: Sortie des certificats clients uniquement :

source: Don't encrypt the private key:
fr: Ne pas chiffrer la clé privée :

source: Print some info about a PKCS#12 file:
fr: Afficher les informations sur un fichier PKCS#12 :

source: Create a PKCS#12 file:
fr: Créer un fichier PKCS#12 :

source: Include some extra certificates:
fr: Inclure des certificats supplémentaires :

source: Some would argue that the PKCS#12 standard is one big bug :-)
fr: Certains disent que tout le standard PKCS#12 est un seul grand bogue :-)

source: Versions of OpenSSL before 0.9.6a had a bug in the PKCS#12 key generation routines. Under rare circumstances this could produce a PKCS#12 file encrypted with an invalid key. As a result some PKCS#12 files which triggered this bug from other implementations (MSIE or Netscape) could not be decrypted by OpenSSL and similarly OpenSSL could produce PKCS#12 files which could not be decrypted by other implementations. The chances of producing such a file are relatively small: less than 1 in 256.
fr: Les versions d'OpenSSL avant 0.9.6a avaient un bogue dans les routines de génération de clé PKCS#12. Sous certaines circonstances rares, ceci pouvait conduire à un fichier PKCS#12 chiffré avec une clé non valable. Ainsi certains fichiers PKCS#12 d'autres implémentations (MSIE ou Netscape) et qui déclenchaient ce bogues ne pouvaient être déchiffrés par OpenSSL et inversement OpenSSL produisait des fichier non déchiffrable par d'autres implémentations. La probabilité de produire un tels fichiers est relativement faible : inférieure à 1 sur 256.

source: A side effect of fixing this bug is that any old invalidly encrypted PKCS#12 files cannot no longer be parsed by the fixed version. Under such circumstances the B<pkcs12> utility will report that the MAC is OK but fail with a decryption error when extracting private keys.
fr: Une conséquence de la correction de ce bogue est que de tels fichiers PKCS#12 ne peuvent être interprétés avec une version corrigée. L'utilitaire B<pkcs12> signale alors que le MAC est valide, mais le déchiffrement des clés privées extraites est voué à l'échec.

source: This problem can be resolved by extracting the private keys and certificates from the PKCS#12 file using an older version of OpenSSL and recreating the PKCS#12 file from the keys and certificates using a newer version of OpenSSL. For example:
fr: Ce problème peut être contourné en extrayant les clés privées et les certificats avec une version ancienne d'OpenSSL puis en régénérant le fichier PKCS#12 avec une version plus récente à partir des clés et des certificats. Par exemple :
