Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/po/*/s_time.pod.po
Languages: fr

source: NAME
fr: NOM

source: SEE ALSO
fr: VOIR AUSSI

source: BUGS
fr: BOGUES

source: B<-CAfile file>
fr: B<-CAfile> I<fichier>

source: B<-connect host:port>
fr: B<-connect> I<hôte>B<:>I<port>

source: B<-cert certname>
fr: B<-cert> I<nom_certificat>

source: B<-key keyfile>
fr: B<-key> I<fichier_clef>

source: B<-verify depth>
fr: B<-verify> I<profondeur>

source: The verify depth to use. This specifies the maximum length of the server certificate chain and turns on server certificate verification. Currently the verify operation continues after errors so all the problems with a certificate chain can be seen. As a side effect the connection will never fail due to a server certificate verify failure.
fr: La profondeur de vérification à utiliser. Ceci spécifie la taille maximale de la chaîne de certification du serveur et active la vérification du certificat du serveur. Actuellement l'opération de vérification continue après les erreurs de façon à montrer tous les problèmes liés à la chaîne de certification. Par conséquent, la connexion n'échouera jamais à cause d'un échec de la vérification du certificat du serveur.

source: B<-CApath directory>
fr: B<-CApath> I<répertoire>

source: The directory to use for server certificate verification. This directory must be in "hash format", see B<verify> for more information. These are also used when building the client certificate chain.
fr: Le répertoire utilisé pour la vérification du certificat du serveur. Ce répertoire doit être au format « hash », voir B<verify> pour plus d'informations. Il est aussi utilisé pour construire la chaîne de certification du client.

source: A file containing trusted certificates to use during server authentication and to use when attempting to build the client certificate chain.
fr: Un fichier contenant des certificats de confiance utilisés durant l'authentification du serveur et quand on essaie de créer la chaîne de certification du client.

source: there are several known bug in SSL and TLS implementations. Adding this option enables various workarounds.
fr: Il y a plusieurs bogues connus dans les implémentations SSL et TLS. L'ajout de cette option permet de contourner certains problèmes.

source: B<-cipher cipherlist>
fr: B<-cipher> I<liste_algorithmes>

source: If a certificate is specified on the command line using the B<-cert> option it will not be used unless the server specifically requests a client certificate. Therefor merely including a client certificate on the command line is no guarantee that the certificate works.
fr: Si un certificat est spécifié sur la ligne de commandes en utilisant l'option B<-cert>, il ne sera pas utilisé à moins que le serveur spécifié requiert un certificat client. Par conséquent, la simple utilisation d'un certificat client sur la ligne de commandes ne garantit pas que le certificat fonctionne.

source: The B<-verify> option should really exit if the server verification fails.
fr: L'option B<-verify> devrait réellement quitter si la vérification du serveur échoue.

source: s_time - SSL/TLS performance timing program
fr: s_time - Programme d'analyse de performances SSL/TLS

source: B<openssl> B<s_time> [B<-connect host:port>] [B<-www page>] [B<-cert filename>] [B<-key filename>] [B<-CApath directory>] [B<-CAfile filename>] [B<-reuse>] [B<-new>] [B<-verify depth>] [B<-nbio>] [B<-time seconds>] [B<-ssl2>] [B<-ssl3>] [B<-bugs>] [B<-cipher cipherlist>]
fr: B<openssl> B<s_time> [B<-connect> I<hôte>B<:>I<port>] [B<-www> I<page>] [B<-cert> I<nom_fichier>] [B<-key nom_fichier>] [B<-CApath répertoire>] [B<-CAfile> I<nom_fichier>] [B<-reuse>] [B<-new>] [B<-verify profondeur>] [B<-nbio>] [B<-time> I<secondes>] [B<-ssl2>] [B<-ssl3>] [B<-bugs>] [B<-cipher> I<liste_algorithmes>]

source: The B<s_client> command implements a generic SSL/TLS client which connects to a remote host using SSL/TLS. It can request a page from the server and includes the time to transfer the payload data in its timing measurements. It measures the number of connections within a given timeframe, the amount of data transferred (if any), and calculates the average time spent for one connection.
fr: La commande B<s_time> implémente un client générique SSL/TLS qui se connecte à un hôte à distance en utilisant SSL/TLS. Elle peut demander une page d'un serveur et inclure le temps de transfert de l'information dans ses mesures de temps. Elle mesure le nombre de connections dans un laps de temps donné, la quantité d'information transférée (s'il y en a), et calcule le temps moyen utilisé pour une connexion.

source: This specifies the host and optional port to connect to.
fr: Ceci spécifie l'hôte et le port optionnel auquel se connecter.

source: B<-www page>
fr: B<-www> I<page>

source: This specifies the page to GET from the server. A value of '/' gets the index.htm[l] page. If this parameter is not specified, then B<s_time> will only perform the handshake to establish SSL connections but not transfer any payload data.
fr: Ceci spécifie la page à obtenir sur le serveur. La valeur de '/' correspond à la page index.htm[l]. Si ce paramètre n'est pas spécifié, alors B<s_time> effectuera uniquement la poignée de main (« handshake ») pour établir des connexions SSL mais ne transférera pas d'information utile.

source: The certificate to use, if one is requested by the server. The default is not to use a certificate. The file is in PEM format.
fr: Le certificat à utiliser, s'il est requis par le serveur. Par défaut, aucun certificat n'est utilisé. Le fichier est au format PEM.

source: The private key to use. If not specified then the certificate file will be used. The file is in PEM format.
fr: Le fichier contenant la clé privée à utiliser. S'il n'est pas spécifié alors le fichier du certificat sera utilisé. Le fichier est au format PEM.

source: performs the timing test using a new session ID for each connection. If neither B<-new> nor B<-reuse> are specified, they are both on by default and executed in sequence.
fr: Effectue la mesure du temps en utilisant un nouvel identifiant de session pour chaque connexion. Si ni B<-new> ni B<-reuse> ne sont spécifiées, elles sont toutes deux mises par défaut et exécutées en séquence.

source: performs the timing test using the same session ID; this can be used as a test that session caching is working. If neither B<-new> nor B<-reuse> are specified, they are both on by default and executed in sequence.
fr: Effectue la mesure du temps en utilisant le même identifiant de session ; ceci peut être utilisé pour tester le fonctionnement de la mise en cache des sessions. Si ni B<-new> ni B<-reuse> ne sont spécifiées, elles sont toutes deux mises par défaut et exécutées en séquence.

source: turns on non-blocking I/O.
fr: Active les entrées-sorties non-bloquantes.

source: these options disable the use of certain SSL or TLS protocols. By default the initial handshake uses a method which should be compatible with all servers and permit them to use SSL v3, SSL v2 or TLS as appropriate. The timing program is not as rich in options to turn protocols on and off as the L<s_client(1)|s_client(1)> program and may not connect to all servers.
fr: Ces options désactivent l'utilisation de certains protocoles SSL ou TLS. Par défaut, la poignée de main initiale utilise une méthode qui devrait être compatible avec tous les serveurs et leur permet d'utiliser SSL v3, SSL v2 ou TLS comme approprié. Le programme de test des performances n'est pas riche en options pour utiliser ou non des protocoles comme le programme L<s_client(1)|s_client(1)> et pourrait ne pas pouvoir se connecter à tous les serveurs.

source: Unfortunately there are a lot of ancient and broken servers in use which cannot handle this technique and will fail to connect. Some servers only work if TLS is turned off with the B<-ssl3> option; others will only support SSL v2 and may need the B<-ssl2> option.
fr: Malheureusement il y a beaucoup d'anciens serveurs en utilisation qui ne gèrent pas cette technique et échoueront à la connexion. Certains serveurs fonctionnent uniquement si TLS est désactivé avec l'option B<-ssl3> ; d'autres ne gèrent que SSL v2 et peuvent avoir besoin de l'option B<-ssl2>.

source: this allows the cipher list sent by the client to be modified. Although the server determines which cipher suite is used it should take the first supported cipher in the list sent by the client. See the L<ciphers(1)|ciphers(1)> command for more information.
fr: Ceci permet de modifier la liste d'algorithmes envoyée par le client. Bien que le serveur détermine quelle suite d'algorithmes est utilisée, il devrait prendre le premier algorithme supporté dans la liste envoyée par le client. Consultez la commande L<ciphers(1)|ciphers(1)> pour plus d'informations.

source: B<-time length>
fr: B<-time> I<secondes>

source: specifies how long (in seconds) B<s_time> should establish connections and optionally transfer payload data from a server. Server and client performance and the link speed determine how many connections B<s_time> can establish.
fr: Spécifie pendant combien de temps (en secondes) B<s_time> doit établir des connexions et optionnellement transférer des informations à partir d'un serveur. La performance du serveur et du client ainsi que la vitesse du lien déterminent le nombre de connexions que B<s_time> peut établir.

source: B<s_client> can be used to measure the performance of an SSL connection. To connect to an SSL HTTP server and get the default page the command
fr: B<s_client> peut être utilisé pour mesurer la performance d'une connexion SSL. La commande suivante est typiquement utilisée pour se connecter à un serveur SSL HTTP (https utilise le port 443) et obtenir la page par défaut :

source: openssl s_time -connect servername:443 -www / -CApath yourdir -CAfile yourfile.pem -cipher commoncipher [-ssl3]
fr: openssl s_time -connect nom_serveur:443 -www / -CApath votre_rep -CAfile votre_fichier.pem -cipher algorithme_commun [-ssl3]

source: would typically be used (https uses port 443). 'commoncipher' is a cipher to which both client and server can agree, see the L<ciphers(1)|ciphers(1)> command for details.
fr: 'algorithme_commun' est un algorithme sur lequel client et serveur peuvent s'accorder, voir la commande L<ciphers(1)|ciphers(1)> pour plus de détails.

source: If the handshake fails then there are several possible causes, if it is nothing obvious like no client certificate then the B<-bugs>, B<-ssl2>, B<-ssl3> options can be tried in case it is a buggy server. In particular you should play with these options B<before> submitting a bug report to an OpenSSL mailing list.
fr: Il peut y avoir plusieurs raison à l'échec de la poignée de main, s'il n'y a rien d'évident, comme l'absence de certificat de client, alors les options B<-bugs>, B<-ssl2> et B<-ssl3> peuvent être essayées au cas où il s'agirait d'un serveur bogué. En particulier vous devriez essayer ces options B<avant> de soumettre un rapport de bogue à une liste de diffusion OpenSSL.

source: A frequent problem when attempting to get client certificates working is that a web client complains it has no certificates or gives an empty list to choose from. This is normally because the server is not sending the clients certificate authority in its "acceptable CA list" when it requests a certificate. By using L<s_client(1)|s_client(1)> the CA list can be viewed and checked. However some servers only request client authentication after a specific URL is requested. To obtain the list in this case it is necessary to use the B<-prexit> option of L<s_client(1)|s_client(1)> and send an HTTP request for an appropriate page.
fr: Un problème fréquent lorsqu'on essaie de faire fonctionner un certificat client est qu'un client web se plaint qu'il n'y a pas de certificat ou qu'il fournit un choix parmi une liste vide. Normalement c'est parce que le serveur n'envoie pas l'autorité de certification aux clients dans sa « liste d'autorités de certification acceptables » quand il requiert un certificat. En utilisant L<s_client(1)|s_client(1)>, la liste d'autorités de certification peut être observée et vérifiée. Cependant certains serveurs requiert uniquement l'authentification du client après qu'une URL spécifique soit demandée. Pour obtenir la liste dans ce cas, il est nécessaire d'utiliser l'option B<-prexit> de L<s_client(1)|s_client(1)> et d'envoyer une requête HTTP pour une page appropriée.

source: Because this program does not have all the options of the L<s_client(1)|s_client(1)> program to turn protocols on and off, you may not be able to measure the performance of all protocols with all servers.
fr: Ce programme n'a pas toutes les options du programme L<s_client(1)|s_client(1)> pour activer ou désactiver des protocoles, vous ne pouvez pas mesurer les performances de tous les protocoles avec tous les serveurs.
