Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: Drivers can be static PPD files under the I</usr/share/cups/model> directory or programs under the I</usr/lib/cups/driver> directory. Static PPD files must conform to the Adobe PPD File Format Specification version 4.3 and may be compressed using the I<gzip(1)> program. Driver programs must implement the command-line interface shown in the next section.
fr: Les pilotes peuvent être des fichiers PPD dans le répertoire I</usr/share/cups/model> ou des programmes dans le répertoire I</usr/lib/cups/driver>. Les fichiers PPD statiques doivent se conformer aux spécifications Adobe du format de fichier PPD, version 4.3, et peuvent être compressés avec le programme B<gzip>(1). Les programmes de pilotes doivent gérer l'interface en ligne de commande définie dans la section suivante.

source: DRIVER PROGRAMS
fr: PROGRAMMES DE PILOTES

source: Driver programs provide an interface to dynamically-generated PPD files. The following arguments are currently defined:
fr: Les programmes de pilotes fournissent une interface pour générer dynamiquement des fichiers PPD. Pour l'instant, les paramètres suivants sont définis :

source: Lists the supported PPD files to stdout.
fr: Liste, sur la sortie standard, les fichiers PPD gérés.

source: drivername cat ppdname
fr: drivername cat nom_ppd

source: Writes the named PPD file to stdout.
fr: Écrire le fichier PPD indiqué sur la sortie standard.

source: LISTING FILES (drivername list)
fr: LISTER LES FICHIER (nom_pilote list)

source: When run with the single argument "list", the program must list the available PPD files it can generate to stdout using the following format:
fr: Lorsqu'il est lancé avec l'unique paramètre « list », le programme doit lister sur la sortie standard les fichiers PPD disponibles qu'il peut générer, en utilisant le format suivant :

source: "drivername:ppdname" language "make" "make and model" "1284 device id"
fr: "nom_pilote:nom_ppd" langue "marque" "marque et modèle" "1284 id_périphérique"

source: I<Drivername> is the name of the driver program. I<Ppdname> is the name used to select the given driver. I<Language> is the locale associated with the default language of the PPD file, typically "en". I<Make> is the Manufacturer name from the PPD file. I<Make and model> is the NickName name from the PPD file. I<1284 device id> is the 1284DeviceId from the PPD file, if any.
fr: I<nom_pilote> est le nom du programme pilote. I<nom_ppd> est le nom utilisé pour sélectionner le pilote. I<langue> est la locale associée avec la langue par défaut du fichier PPD, généralement « en ». I<marque> est le nom du fabriquant dans le fichier PPD. I<marque et modèle> est le nom du fichier PPD. I<id_1284_périphérique> est l'identifiant 1284DeviceID du fichier PPD, s'il y en a un.

source: WRITING FILES (drivername cat ppdname)
fr: ÉCRIRE LES FICHIER (nom_pilote cat nom_ppd)

source: When the driver program is run with the "cat ppdname" arguments, it must write the named PPD file to stdout, uncompressed. If the named PPD file does not exist, the driver program must not write any output to stdout and report the error to stderr instead.
fr: QUand le programme pilote est lancé avec les paramètre « cat nom_ppd », il écrit le fichier PPD demandé, non compressé, sur la sortie standard. Si le fichier PPD demandé n'existe pas, le programme pilote ne doit rien écrire sur la sortie standard, mais doit utiliser la sortie d'erreur à la place.

source: DRIVER ERROR MESSAGES
fr: MESSAGES D'ERREUR DES PILOTES

source: Error messages can be relayed back to I<cupsd> by writing them to stderr. The following prefixes are recognized:
fr: Les messages d'erreur peuvent être renvoyés à I<cupsd> en les écrivant sur la sortie standard d'erreur. Les préfix suivants sont reconnus :

source: Debugging messages
fr: Mesages de débogage.

source: ERROR: [drivername]
fr: ERROR: [nom_pilote]

source: Error messages
fr: Messages d'erreur.

source: INFO: [drivername]
fr: INFO: [nom_pilote]

source: Informational messages
fr: Messages d'information.

source: cupsdisable, cupsenable - stop/start printers and classes
fr: cupsdisable, cupsenable - Arrêter/démarrer des imprimantes ou classes d'imprimantes.

source: B<cupsdisable> [ -E ] [-U I<username> ] [ -c ] [ -h I<server[:port]> ] [ -r I<reason> ] destination(s)
fr: B<cupsdisable> [ -E ] [-U I<utilisateur> ] [ -c ] [ -h I<serveur[:port]> ] [ -r I<raison> ] destination(s)

source: B<cupsenable> [ -E ] [-U I<username> ] [ -c ] [ -h I<server[:port]> ] destination(s)
fr: B<cupsenable> [ -E ] [-U I<utilisateur> ] [ -c ] [ -h I<serveur[:port]> ] destination(s)

source: I<cupsenable> starts the named printers or classes.
fr: I<cupsenable> démarre l'imprimante ou la classe d'imprimante indiquée.

source: I<cupsdisable> stops the named printers or classes. The following options may be used:
fr: I<cupsdisable> arrête l'imprimante ou la classe d'imprimante indiquée. Les options suivantes peuvent être utilisées :

source: Forces encryption of the connection to the server.
fr: Forcer le chiffrement de la connexion au serveur.

source: Uses the specified username when connecting to the server.
fr: utiliser l'utilisateur indiqué pour les connexions au serveur.

source: Cancels all jobs on the named destination.
fr: Annuler tous les travaux sur la destination donnée.

source: Uses the specified server and port.
fr: Utiliser le serveur et le port indiqués.

source: Sets the message associated with the stopped state. If no reason is specified then the message is set to "Reason Unknown".
fr: Configurer le message associé avec l'état arrêté. Si aucune raison n'est spécifiée, alors le message sera « Reason Unknown » (« Raison Inconnue »).

source: The System V versions of these commands are I<disable> and I<enable>. They have been renamed to avoid conflicts with the I<bash(1)> build-in command of the same name.
fr: Les version System V de ces commandes sont B<disable> et B<enable>. Elles ont été renommées pour éviter les conflits avec les commandes internes de B<bash>(1) du même nom.

source: The CUPS versions of I<disable> and I<enable> may ask the user for an access password depending on the printing system configuration. This differs from the System V versions which require the root user to execute these commands.
fr: Les versions CUPS de I<disable> et I<enable> peuvent demander à l'utilisateur de s'identifier suivant la configuration du système d'impression, à la différence des versions System V, qui demandent le mot de passe root pour exécuter ces commande.

source: -o name=value
fr: -o I<nom=valeur>

source: 24 April 2006
fr: 24 avril 2006

source: cups-lpd - receive print jobs and report printer status to lpd clients
fr: cups-lpd - Recevoir les travaux d'impression et renvoyer l'état des imprimantes aux clients lpd.

source: B<cups-lpd> [ -n ] [ -o I<option=value> ]
fr: B<cups-lpd> [ -n ] [ -o I<option=valeur> ]

source: I<cups-lpd> is the CUPS Line Printer Daemon ("LPD") mini-server that supports legacy client systems that use the LPD protocol. I<cups-lpd> does not act as a standalone network daemon but instead operates using the Internet "super-server" I<inetd(8)> or I<xinetd(8)>. If you are using I<inetd>, add the following line to the I<inetd.conf> file to enable the I<cups-lpd> mini-server:
fr: B<cups-lpd> est le mini serveur Line Printer Daemon (« LPD ») de CUPS, qui gère les client classiques utilisant le protocole LPD. B<cups-lpd> ne fonctionne pas lui-même comme un démon réseau, mais utilise le super-serveur B<inetd>(8). Si vous utilisez B<inetd>, ajoutez la ligne suivante au fichier I<inetd.conf> pour activer le démon B<cups-lpd> :

source: B<Note:> If you are using Solaris 10 or higher, you must run the I<inetdconv(1m)> program to register the changes to the inetd.conf file.
fr: B<Remarque :> si vous utilisez Solaris 10 ou une version ultérieure, vous devez exécuter B<inetdconv>(1m) pour enregistrer les changements apportés au fichier I<inetd.conf>.

source: If you are using the newer I<xinetd(8)> daemon, create a file named I</etc/xinetd.d/cups> containing the following lines:
fr: Si vous utilisez le démon plus récent I<xinetd>(8), créez le fichier I</etc/xinetd.d/cups> contenant les lignes suivantes :

source: Disables reverse address lookups; normally I<cups-lpd> will try to discover the hostname of the client via a reverse DNS lookup.
fr: Désactiver la résolution inverse des noms d'hôte ; normalement, B<cups-lpd> essaie de récupérer le nom d'hôte à l'aide d'une requête DNS inverse.

source: Inserts options for all print queues. Most often this is used to disable the "l" filter so that remote print jobs are filtered as needed for printing; the examples in the previous section set the "document-format" option to "application/octet-stream" which forces autodetection of the print file format.
fr: Insérer des options pour toutes les queues d'impression. Le plus souvent, c'est utilisé pour désactiver le filtre « l » pour que les travaux distants soient également filtrés correctement ; les exemples des sections précédentes fixent l'option « document-format » à « application/octet-stream », ce qui force l'autodétection du format des fichiers à imprimer.

source: I<cups-lpd> performs well with small numbers of clients and printers. However, since a new process is created for each connection and since each process must query the printing system before each job submission, it does not scale to larger configurations. We highly recommend that large configurations use the native IPP support provided by CUPS instead.
fr: Les performances de B<cups-lpd> sont correctes avec un petit nombre de clients et d'imprimantes. Cependant, comme un nouveau processus est créé pour chaque connexion et comme chaque processus doit interroger le système d'impression avant chaque soumission d'un travail d'impression, ça ne s'étend pas facilement à des configurations plus importantes. Nous recommandons d'utiliser la gestion du protocole IPP native dans CUPS pour les configurations importantes.

source: SECURITY
fr: SÉCURITÉ

source: I<cups-lpd> currently does not perform any access control based on the settings in I<cupsd.conf(5)> or in the I<hosts.allow(5)> or I<hosts.deny(5)> files used by TCP wrappers. Therefore, running I<cups-lpd> on your server will allow any computer on your network (and perhaps the entire Internet) to print to your server.
fr: B<cups-lpd> n'applique pour le moment aucun des contrôles d'accès définis dans les fichiers I<cupsd.conf>(5), I<hosts.allow>(5) ou I<hosts.deny>(5) utilisés par les wrappers TCP. L'exécution de B<cups-lpd> sur un serveur permet donc le lancement d'impressions depuis n'importe quel ordinateur de votre réseau, voire même de n'importe quel ordinateur sur Internet.

source: While I<xinetd> has built-in access control support, you should use the TCP wrappers package with I<inetd> to limit access to only those computers that should be able to print through your server.
fr: Bien que I<xinetd> possède un contrôle d'accès intégré, il est recommandé d'utiliser le wrapper TCP fourni avec I<inetd> pour limiter les accès aux seuls ordinateurs autorisés à lancer des impressions sur le serveur.

source: I<cups-lpd> is not enabled by the standard CUPS distribution. Please consult with your operating system vendor to determine whether it is enabled on your system.
fr: B<cups-lpd> n'est pas activé dans la distribution standard de CUPS. Veuillez consulter votre distributeur de système d'exploitation pour savoir s'il est activé sur votre système.

source: I<cups-lpd> does not enforce the restricted source port number specified in RFC 1179, as using restricted ports does not prevent users from submitting print jobs. While this behavior is different than standard Berkeley LPD implementations, it should not affect normal client operations.
fr: B<cups-lpd> ne se conforme pas à la RFC 1179 concernant l'utilisation des ports systèmes (1 à 1\|024), car l'utilisation de ces ports n'empêche pas un utilisateur d'envoyer un travail d'impression. Bien que ce comportement soit différent de celui des implémentations LPD Berkeley, il ne devrait pas affecter le déroulement correct des impressions.

source: The output of the status requests follows RFC 2569, Mapping between LPD and IPP Protocols. Since many LPD implementations stray from this definition, remote status reporting to LPD clients may be unreliable.
fr: Le format de sortie des demandes d'état se conforme à la RFC 2569, Mapping between LPD and IPP Protocols. Comme bon nombre d'implémentations LPD ne suivent pas cette définition, la récupération d'état par un client LPD peut être erronée.

source: cups-polld - cups printer polling daemon
fr: cups-polld - Démon d'interrogation des imprimantes CUPS.

source: B<cups-polld> I<address ipp-port interval browse-port>
fr: B<cups-polld> I<adresse port-ipp intervalle port-de-navigation>

source: I<cups-polld> polls remote servers for a list of available printers and printer classes every I<interval> seconds. Printer and class information is then broadcast to the localhost interface (127.0.0.1) on the specified browse port for reception by I<cupsd(8)>.
fr: B<cups-polld> interroge des serveurs distants afin d'obtenir la liste des imprimantes et classes d'imprimantes disponibles toutes les I<intervalle> secondes. Les informations sont alors renvoyées vers l'interface locale (127.0.0.1) et le port de navigation spécifié pour être récupérées par B<cupsd>(8).

source: This program is started automatically by I<cupsd> for every I<BrowsePoll> directive found in the I<cupsd.conf(5)> file.
fr: Ce programme est démarré automatiquement par B<cupsd> pour chaque directive « BrowsePoll » trouvée dans le fichier B<cupsd.conf>(5).

source: lpadmin - configure cups printers and classes
fr: lpadmin - Configurer les imprimantes et classes d'imprimantes CUPS.

source: B<lpadmin> [ -E ] [-U I<username> ] [ -h I<server[:port]> ] -d I<destination>
fr: B<lpadmin> [ -E ] [-U I<utilisateur> ] [ -h I<serveur[:port]> ] -d I<destination>

source: B<lpadmin> [ -E ] [-U I<username> ] [ -h I<server[:port]> ] -p I<printer option(s)>
fr: B<lpadmin> [ -E ] [-U I<utilisateur> ] [ -h I<serveur[:port]> ] -p I<imprimante option(s)>

source: B<lpadmin> [ -E ] [-U I<username> ] [ -h I<server[:port]> ] -x I<destination>
fr: B<lpadmin> [ -E ] [-U I<utilisateur> ] [ -h I<serveur[:port]> ] -x I<destination>

source: I<lpadmin> configures printer and class queues provided by CUPS. It can also be used to set the server default printer or class.
fr: I<lpadmin> configure les imprimantes et classes d'imprimantes CUPS. Il est également utilisé pour définir l'imprimante ou classe d'imprimante par défaut.

source: When specified before the I<-d>, I<-p>, or I<-x> options, the I<-E> option forces encryption when connecting to the server.
fr: Lorsque l'option I<-E> est spécifiée avant les options I<-d>, I<-p> ou I<-x>, la communication avec le serveur est chiffrée.

source: The first form of the command (I<-d>) sets the default printer or class to I<destination>. Subsequent print jobs submitted via the I<lp(1)> or I<lpr(1)> commands will use this destination unless the user specifies otherwise with the I<lpoptions(1)> command.
fr: La première méthode d'utilisation de la commande (avec B<-d>) définit l'imprimante ou la classe par défaut. Les impressions futures demandées par les commandes B<lp>(1) ou B<lpr>(1) utiliseront cette destination sauf avis contraire de l'utilisateur par l'utilisation de la commande I<lpoptions>(1).

source: The second form of the command (I<-p>) configures the named printer. The additional options are described below.
fr: La seconde forme de la commande (avec I<-p>) configure l'imprimante spécifiée. Les options supplémentaires sont décrites plus loin.

source: The third form of the command (I<-x>) deletes the printer or class I<destination>. Any jobs that are pending for the destination will be removed and any job that is currently printed will be aborted.
fr: La troisième forme de la commande (avec I<-x>) supprime l'imprimante ou classe I<destination>. Tous les travaux d'impression en attente sur cette destination sont supprimés, et les travaux en cours d'impression sont arrêtés.

source: CONFIGURATION OPTIONS
fr: OPTIONS DE CONFIGURATION

source: The following options are recognized when configuring a printer queue:
fr: Les options suivantes sont reconnues pour la configuration d'une liste d'attente :

source: -c class
fr: -c I<classe>

source: Adds the named I<printer> to I<class>. If I<class> does not exist it is created automatically.
fr: Ajouter l'imprimante I<imprimante> à la classe I<classe>. Si la I<classe> n'existe pas encore, elle est créée automatiquement.

source: -i interface
fr: -i I<interface>

source: Sets a System V style interface script for the printer. This option cannot be specified with the I<-P> option (PPD file) and is intended for providing support for legacy printer drivers.
fr: Créer un script d'interface System V pour l'imprimante. Cette option ne peut être utilisée en même temps que l'option I<-P> (fichier PPD) et est destinée au support des imprimantes de base.

source: -m model
fr: -m I<modèle>

source: Sets a standard System V interface script or PPD file from the I<model> directory.
fr: Définir un script d'interface System V ou un fichier PPD du répertoire I<modèle>.

source: -o job-k-limit=value
fr: -o I<job-k-limit=valeur>

source: Sets the kilobyte limit for per-user quotas. The value is an integer number of kilobytes; one kilobyte is 1024 bytes.
fr: Définir les quotas par utilisateur en kilo-octets. La valeur est un nombre entier de kilo-octets (valant 1 024 octets).

source: -o job-page-limit=value
fr: -o I<job-page-limit=valeur>

source: Sets the page limit for per-user quotas. The value is the integer number of pages that can be printed; double-sided pages are counted as two pages.
fr: Définir les quotas par utilisateur en nombre de pages. La valeur est un nombre entier de pages pouvant être imprimées. Les recto-verso comptent pour deux pages.

source: -o job-quota-period=value
fr: -o I<job-quota-period=valeur>

source: Sets the accounting period for per-user quotas. The value is an integer number of seconds; 86,400 seconds are in one day.
fr: Définir les quotas par utilisateur en impressions par intervalle de temps. La valeur est un nombre entier définissant le nombre de secondes entre chaque impression. Une journée contient 86 400 secondes.

source: -o job-sheets-default=banner
fr: -o job-sheets-default=bannière

source: -o job-sheets-default=banner,banner
fr: -o job-sheets-default=bannière,bannière

source: Sets the default banner page(s) to use for print jobs.
fr: Fixer la (les) pages de bannière par défaut pour les travaux d'impression.

source: -o port-monitor=name
fr: -o port-monitor=nom

source: -o printer-error-policy=name
fr: -o printer-error-policy=nom

source: Sets the error policy to be used when the printer backend is unable to send the job to the printer. The name must be one of "abort-job", "retry-job" or "stop-printer". The default error policy is "stop-printer".
fr: Fixer la politique à utiliser en cas d'erreur quand le dorsal responsable de l'impression n'arrive pas à envoyer le travail à l'imprimante. Le nom doit être soit « abort-job » (annuler l'impression), « retry-job » (réessayer) ou « stop-printer » (arrêter l'imprimante). La politique par défaut en cas d'erreur est « stop-printer ».

source: Sets the printer to shared/published or unshared/unpublished. Shared/published printers are publically announced by the server on the LAN based on the browsing configuration in B<cupsd.conf>, while unshared/unpublished printers are not announced. The default value is "true".
fr: Placer l'imprimante dans l'état partagée/publiée ou non partagée/non publiée. Les imprimantes partagées/publiées sont annoncées publiquement par le serveur sur le réseau local, en fonction de la configuration pour les recherches de I<cupsd.conf>, tandis que les imprimantes non partagées/non publiées ne sont pas annoncées. La valeur par défaut est « true ».

source: -o printer-op-policy=name
fr: -o printer-op-policy=nom

source: Sets the IPP operation policy associated with the printer. The name must be defined in the B<cupsd.conf> in a Policy section. The default operation policy is "default".
fr: Fixer la politique des opérations IPP associée à l'imprimante. Le nom doit être définit dans I<cupsd.conf>, dans une section de type Policy. La politique des opérations est par défaut « default ».

source: -r class
fr: -r I<classe>

source: Removes the named I<printer> from I<class>. If the resulting class becomes empty it is removed.
fr: Supprimer l'I<imprimante> de la I<classe>. Si la classe d'imprimante devient vide, celle-ci est supprimée.

source: -u allow:user,user,@group
fr: -u allow:utilisateur,utilisateur,@groupe

source: -u deny:user,user,@group
fr: -u deny:utilisateur,utilisateur,@groupe

source: Sets user-level access control on a printer. Names starting with "@" are interpreted as UNIX groups. The latter two forms turn user-level access control off.
fr: Définir les accès par utilisateur sur une imprimante. Les noms commençant par un « @ » sont interprétés comme des groupes UNIX. Les deux dernières expressions suppriment les contrôles d'accès par utilisateur.

source: -v "device-uri"
fr: -v "uri_périphérique"

source: Sets the I<device-uri> attribute of the printer queue. If I<device-uri> is a filename it is automatically converted to the form I<file:///file/name>. Use the I<lpinfo(8)> command to get a list of supported device URIs and schemes.
fr: Définir l'attribut B<device-uri> de la file d'attente de l'imprimante. Si I<uri_périphérique> est un nom de fichier, il est converti automatiquement en la forme B<file:/fichier/nom>. Utilisez la commande B<lpinfo>(8) pour avoir la liste des URI de périphériques gérés et leurs schémas.

source: Provides a textual description of the printer.
fr: Définir une description textuelle de l'imprimante.

source: Enables the printer and accepts jobs; this is the same as running the I<accept(8)> and I<cupsenable(8)> programs on the printer.
fr: Activer l'imprimante et lui fait accepter les travaux d'impression. Ceci peut également être effectué en lançant les commandes I<accept>(8) et I<cupsenable>(8) avec cette imprimante.

source: -L "location"
fr: -L "emplacement"

source: Provides a textual location of the printer.
fr: Définir l'emplacement de l'imprimante.

source: -P ppd-file
fr: -P I<fichier-ppd>

source: Specifies a PostScript Printer Description file to use with the printer. If specified, this option overrides the I<-i> option (interface script).
fr: Définir le fichier PPD (Postscript Printer Description) à utiliser avec cette imprimante. Si cette option est spécifiée, elle annule l'option B<-i> (script d'interface).

source: Unlike the System V printing system, CUPS allows printer names to contain any printable character except SPACE, TAB, "/", or "#". Also, printer and class names are I<not> case-sensitive. Finally, the CUPS version of I<lpadmin> may ask the user for an access password depending on the printing system configuration. This differs from the System V version which requires the root user to execute this command.
fr: Contrairement au système d'impression System V, CUPS permet des noms d'imprimantes contenant tout caractère imprimable sauf ESPACE, TABULATION, w / » ou « # ». De plus, les noms d'imprimante et de classe ne sont I<pas> sensibles à la casse. Enfin, la version CUPS de B<lpadmin> peut demander un mot de passe, suivant la configuration du système, à la différence de la version System V qui demande le mot de passe root lors de l'exécution de cette commande.
