Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: Specifies an additional recipient for all email notifications.
fr: Spécifier une adresse supplémentaire à laquelle les notifications par courier électronique seront envoyées.

source: From I<from-address@domain.com>
fr: From I<adresse_émetteur@domaine.com>

source: Specifies the sender of email notifications.
fr: Spécifier l'émetteur des notifications par courier électronique.

source: Sendmail I<sendmail command and options>
fr: Sendmail I<commande sendmail et options>

source: Specifies the sendmail command to use when sending email notifications. Only one I<Sendmail> or I<SMTPServer> line may be present in the I<mailto.conf> file. If multiple lines are present, only the last one is used.
fr: Spécifier la commande sendmail à utiliser pour l'envoie des courriers de notifications. Seule une ligne B<Sendmail> ou B<SMTPServer> peut être présente dans le fichier I<mailto.conf>. Si plusieurs lignes sont présentes, seule la dernière est prise en compte.

source: SMTPServer I<servername>
fr: SMTPServer I<nom_serveur>

source: Specifies a SMTP server to send email notifications to. Only one I<Sendmail> or I<SMTPServer> line may be present in the I<mailto.conf> file. If multiple lines are present, only the last one is used.
fr: Spécifier le serveur SMTP à utiliser pour l'envoie des courriers de notifications. Seule une ligne B<Sendmail> ou B<SMTPServer> peut être présente dans le fichier I<mailto.conf>. Si plusieurs lignes sont présentes, seule la dernière est prise en compte.

source: Subject I<subject-prefix>
fr: Subject I<préfix_sujet>

source: Specifies a prefix string for the subject line of an email notification.
fr: Utiliser un préfixe dans les sujets des courriers de notification.

source: I<classes.conf(5)>, I<cupsd(8)>, I<cupsd.conf(5)>, I<mime.convs(5)>, I<mime.types(5)>, I<printers.conf(5)>,
fr: B<classes.conf>(5), B<cupsd>(8), B<cupsd.conf>(5), B<mime.convs>(5), B<mime.types>(5), B<printers.conf>(5),

source: mime.convs - mime type conversion file for cups
fr: mime.convs - Fichier de conversion des types MIME pour CUPS.

source: The I<mime.convs> file defines the filters that are available for converting files from one format to another. The standard filters support text, PDF, PostScript, HP-GL/2, and many types of image files.
fr: Le fichier I<mime.convs> définit les filtres disponibles pour convertir des fichiers d'un format vers un autre. Les filtres standards concernent les fichiers textes, PDF, PostScript, HP-GL/2 ainsi que de nombreux formats graphiques.

source: Additional filters can be added to the I<mime.convs> file or (preferably) to other files in the CUPS configuration directory.
fr: Des filtres supplémentaires peuvent être ajoutés dans le fichier I<mime.convs> ou (de préférence) dans d'autres fichiers du répertoire de configuration de CUPS.

source: Each line in the I<mime.convs> file is a comment, blank, or filter line. Comment lines start with the # character. Filter lines specify the source and destination MIME types along with a relative cost associated with the filter and the filter to run:
fr: Chaque ligne du fichier I<mime.convs> est un commentaire, une ligne vide ou une définition de filtre. Les commentaires commencent par le caractère #. Les lignes contenant un filtre spécifient les types MIME source et cible, le coût du filtre, puis le filtre lui-même :

source: super/type super/type cost filter application/postscript application/vnd.cups-raster 50 pstoraster
fr: super/type super/type coût filtre application/postscript application/vnd.cups-raster 50 pstoraster

source: I<classes.conf(5)>, I<cupsd(8)>, I<cupsd.conf(5)>, I<mime.types(5)>, I<printers.conf(5)>,
fr: B<classes.conf>(5), B<cupsd>(8), B<cupsd.conf>(5), B<mime.types>(5), B<printers.conf>(5),

source: mime.types - mime type description file for cups
fr: mime.types - Fichier de description des types MIME de CUPS.

source: The I<mime.types> file defines the recognized file types.
fr: Le fichier I<mime.types> définit les types de fichier reconnus par CUPS.

source: Additional file types can be added to I<mime.types> or (preferably) in additional files in the CUPS configuration directory with the extension ".types".
fr: D'autres types de fichiers peuvent être ajoutés au fichier I<mime.types> ou (de préférence) à d'autres fichier dans le répertoire de configuration de CUPS, avec l'extension « .types ».

source: Each line in the I<mime.types> file is a comment, blank, or rule line. Comment lines start with the # character. Rule lines start with the MIME type name and are optionally followed by a series of file recognition rules that are used to automatically identify print and web files:
fr: Chaque ligne du fichier I<mime.types> est soit un commentaire, soit une ligne vide, soit une règle. Les lignes définissant une règle commencent par le nom du type MIME et peuvent être suivies par une liste de règles de reconnaissance utilisées pour déterminer automatiquement le type du fichier :

source: super/type rule [ ... ruleN]
fr: super/type règle [ ... règleN]

source: The rules may be grouped using parenthesis, joined using "+" for a logical AND and "," or whitespace for a logical OR, and negated using "!".
fr: Ces règles doivent être mises entre parenthèses, liées par un « + » pour exprimer un ET logique, « , » ou une espace pour exprimer un OU logique. Elles sont précédées de « ! » pour exprimer un NON logique.

source: RULES
fr: RÈGLES

source: Rules take two forms - a filename extension by itself and functions with test values inside parenthesis. The following functions are available:
fr: Les règles sont composées de deux parties : une extension de fichier et des fonctions de test entre parenthèses. Les fonctions suivantes peuvent être utilisées :

source: match("pattern")
fr: match("motif")

source: Pattern match on filename
fr: Reconnaissance d'un motif sur le nom du fichier

source: ascii(offset,length)
fr: ascii(début, longueur)

source: True if bytes are valid printable ASCII (CR, NL, TAB, BS, 32-126)
fr: Vrai si tous les octets sont des caractères ASCII valables (CR, NL, TAB, BS, 32-126).

source: printable(offset,length)
fr: printable(début, longueur)

source: True if bytes are printable 8-bit chars (CR, NL, TAB, BS, 32-126, 128-254)
fr: Vrai si tous les octets sont des caractères 8 bits imprimables (CR, NL, TAB, BS, 32-126, 128-254).

source: string(offset,"string")
fr: string(début, "chaîne")

source: True if bytes are identical to string
fr: Vrai si les octets sont identiques à « chaîne »

source: istring(offset,"string")
fr: istring(début, "chaîne")

source: True if a case-insensitive comparison of the bytes is identical
fr: Vrai si les octets sont identiques, sans prendre en compte la casse.

source: char(offset,value)
fr: char(début, valeur)

source: True if byte is identical
fr: Vrai si les octets sont identiques.

source: short(offset,value)
fr: short(début, valeur)

source: True if 16-bit integer is identical
fr: Vrai si les nombres entiers (16 bits) sont identiques.

source: int(offset,value)
fr: int(début, valeur)

source: True if 32-bit integer is identical
fr: Vrai si les nombres entiers (32 bits) sont identiques.

source: locale("string")
fr: locale("chaîne")

source: True if current locale matches string
fr: Vrai si les définitions de langage sont identiques.

source: contains(offset,range,"string")
fr: contains(début, portée, "chaîne")

source: True if the range contains the string
fr: Vrai si la chaîne est trouvée dans la portion précisée.

source: STRING CONSTANTS
fr: CHAÎNES DE CARACTÈRES

source: String constants can be specified inside quotes ("") for strings containing whitespace and angle brackets (E<lt>E<gt>) for hexadecimal strings.
fr: Les chaînes de caractères peuvent être définies entre guillemets ("") pour des chaînes contenant des espaces ou entre crochets (E<lt>E<gt>) pour des chaînes en hexadécimal.

source: I<classes.conf(5)>, I<cupsd(8)>, I<cupsd.conf(5)>, I<mime.convs(5)>, I<printers.conf(5)>,
fr: B<classes.conf>(5), B<cupsd>(8), B<cupsd.conf>(5), B<mime.convs>(5), B<printers.conf>(5),

source: printers.conf - printer configuration file for cups
fr: printers.conf - Fichier de configuration des imprimantes CUPS.

source: The I<printers.conf> file defines the local printers that are available. It is normally located in the I</etc/cups> directory and is generated automatically by the I<cupsd(8)> program when printers are added or deleted.
fr: Le fichier I<printers.conf> définit les imprimantes locales disponibles. Il est habituellement situé dans le répertoire I</etc/cups> et est généré automatiquement par le programme B<cupsd>(8) lors de l'ajout ou de la suppression d'imprimantes.

source: E<lt>Printer nameE<gt> ... E<lt>/PrinterE<gt>
fr: E<lt>Printer nomE<gt> ... E<lt>/PrinterE<gt>

source: Defines a specific printer.
fr: Définir une certaine imprimante.

source: E<lt>DefaultPrinter nameE<gt> ... E<lt>/PrinterE<gt>
fr: E<lt>DefaultPrinter nomE<gt> ... E<lt>/PrinterE<gt>

source: Defines a default printer.
fr: Définir une imprimante par défaut.

source: Specifies the device URI for a printer.
fr: Spécifier l'URI de périphérique d'une imprimante.

source: PortMonitor monitor
fr: PortMonitor moniteur

source: Specifies the port monitor for a printer.
fr: Spécifier le moniteur de port pour l'imprimante.

source: I<classes.conf(5)>, I<cupsd(8)>, I<cupsd.conf(5)>, I<mime.convs(5)>, I<mime.types(5)>,
fr: B<classes.conf>(5), B<cupsd>(8), B<cupsd.conf>(5), B<mime.convs>(5), B<mime.types>(5),

source: 30 April 2006
fr: 30 avril 2006

source: subscriptions.conf - subscriptions file for cups
fr: subscriptions.conf - Fichier des abonnements pour CUPS

source: The I<subscriptions.conf> file defines the local subscriptions that are active. It is normally located in the I</etc/cups> directory and is generated automatically by the I<cupsd(8)> program when subscriptions are created, renewed, or cancelled.
fr: Le fichier I<subscriptions.conf> définit les abonnements locaux actifs. Il est habituellement situé dans le répertoire I</etc/cups> et est généré automatiquement par le programme B<cupsd>(8) lors de l'ajout, le renouvellement ou l'annulation d'abonnements.

source: Defines a subscription.
fr: Définir un abonnement.

source: Events name [ ... name ]
fr: Events nom [ ... nom ]

source: Specifies the events that are subscribed.
fr: Définir les événements auquels on s'abonne.

source: ExpirationTime unix-time
fr: ExpirationTime temps_UNIX

source: Specifies the expiration time of a subscription as a UNIX time value in seconds since January 1st, 1970.
fr: Définir la date d'expiration d'un abonnement. La date est indiquée en utilisant le temps UNIX, c'est-à-dire en exprimée en secondes depuis le 1er janvier 1970.

source: Interval seconds
fr: Interval secondes

source: Specifies the preferred time interval for event notifications in seconds.
fr: Définir l'intervalle voulu entre les notifications, en secondes.

source: JobId job-id
fr: JobId id_travail

source: Specifies the job ID associated with the subscription.
fr: Indiquer l'identifiant de travail associé avec l'abonnement.

source: LeaseDuration seconds
fr: LeaseDuration secondes

source: Specifies the number of seconds that the subscription is valid for. If 0, the subscription does not expire.
fr: Indiquer le nombre de secondes pendants lesquelles l'abonnement sera valable. 0 permet aux abonnement de ne pas expirer.

source: NextEventId number
fr: NextEventId numéro

source: Specifies the next notify-sequence-number to use for the subscription.
fr: Spécifier le prochain numéro de séquence à utiliser pour l'abonnement.

source: NextSubscriptionId number
fr: NextSubscriptionId nombre

source: Specifies the next subscription-id to use.
fr: Indiquer le prochain identifiant d'abonnement à utiliser.

source: Owner username
fr: Owner utilisateur

source: Specifies the user that owns the subscription.
fr: Indiquer le propriétaire de l'abonnement.

source: PrinterName printername
fr: PrinterName imprimante

source: Specifies the printer or class associated with the subscription.
fr: Indiquer l'imprimante ou la classe associée à l'abonnement.

source: Specifies the notify-recipient-uri value for push-type notifications.
fr: Spécifier l'uri recevant les notifications pour les notifications de type push (envoi).

source: UserData hex-escaped-data
fr: UserData donnée_hexa_protégées

source: Specifies user data to be included in event notifications. This is typically the "from" address in mailto: notifications.
fr: Spécifier des données utilisateur à inclure dans les notifications d'événement. C'est typiquement l'adresse émettrice des mails de notifications.

source: I<classes.conf(5)>, I<cupsd(8)>, I<cupsd.conf(5)>, I<mime.convs(5)>, I<mime.types(5)>, printers.conf(5)
fr: B<classes.conf>(5), B<cupsd>(8), B<cupsd.conf>(5), B<mime.convs>(5), B<mime.types>(5), B<printers.conf>(5)

source: backend - cups backend transmission interfaces
fr: backend - Programme de transmission de CUPS.

source: B<backend> job user title num-copies options [ I<filename> ]
fr: B<backend> travail utilisateur titre copies options [ I<fichier> ]

source: Backends are a special type of I<filter(7)> which is used to send print data to and discover different devices on the system.
fr: Les programmes de transmission de CUPS sont des filtres particuliers (consultez B<filter>(7) qui sont utilisés pour envoyer les données à imprimer et découvrir les différents périphériques d'impression du système.

source: Like filters, backends must be capable of reading from a filename on the command-line or from the standard input, copying the standard input to a temporary file as required by the physical interface.
fr: Comme les filtres, ils doivent être capables de lire depuis un fichier fournit sur la ligne de commande ou depuis l'entrée standard, en copiant l'entrée standard vers un fichier temporaire si nécessaire pour l'interface physique.

source: The command name (argv[0]) is set to the device URI of the destination printer. Starting with CUPS 1.1.22, any authentication information in argv[0] is removed, so backend developers are urged to use the DEVICE_URI environment variable whenever authentication information is required. The CUPS API includes a I<cupsBackendDeviceURI> function for retrieving the correct device URI.
fr: Le nom de la commande (argv[0]) est fixé à la valeur de l'URI du périphérique de l'imprimante de destination. À partir de la version 1.1.22 de CUPS, les informations d'identification sont retirées de argv[0]. Il est donc demandé aux développeurs des dorsaux d'utiliser la variable d'environnement DEVICE_URI pour obtenir les informations d'identification quand cela est nécessaire. L'API CUPS propose la fonction B<cupsBackendDeviceURI> pour récupérer la valeur correcte de l'URI du périphérique.

source: Back-channel data from the device should be relayed to the job filters by writing to file descriptor 3. The CUPS API includes the I<cupsBackChannelWrite> function for this purpose.
fr: Les données en retour du périphérique doivent être envoyées au filtres des travaux en écrivant sur le descripteur de fichiers 3. L'API CUPS propose la fonction I<cupsBackChannelWrite> pour cela.

source: DEVICE DISCOVERY
fr: DÉCOUVERTE DES PÉRIPHÉRIQUES

source: When run with no arguments, the backend should list the devices and schemes it supports or is advertising to stdout. The output consists of zero or more lines consisting of any of the following forms:
fr: Quand il est exécuté sans paramètre, le programme dorsal doit lister sur la sortie standard les périphériques et schémas qu'il gère ou qu'il annonce. La sortie consiste en zéro ou plus de lignes de la forme suivante :

source: device-class scheme "Unknown" "device-info" device-class device-uri "device-make-and-model" "device-info" device-class device-uri "device-make-and-model" "device-info" "device-id"
fr: classe_périphérique schéma "Unknown" "info_périphérique" classe_périphérique uri_périphérique "marque_et_modèle_périphérique" "info_périphérique" classe_périphérique uri_périphérique "marque_et_modèle_périphérique" "info_périphérique" "id_périphérique"

source: The I<device-class> field is one of the following values:
fr: Le champ I<classe_périphérique> peut prendre une de ces valeurs :

source: direct
fr: B<direct>

source: The device-uri refers to a specific direct-access device with no options, such as a parallel, USB, or SCSI device.
fr: L'uri du périphérique se réfère à un accès direct au périphérique, sans option, comme pour un périphérique sur port parallèle, USB ou SCSI.

source: file
fr: B<file>

source: The device-uri refers to a file on disk.
fr: L'uri du périphérique se réfère à un fichier sur le disque.

source: network
fr: B<network>

source: The device-uri refers to a networked device and conforms to the general form for network URIs.
fr: L'uri du périphérique se réfère à un périphérique réseau et respecte les formes générales des URI réseau.

source: serial
fr: B<serial>

source: The device-uri refers to a serial device with configurable baud rate and other options. If the device-uri contains a baud value, it represents the maximum baud rate supported by the device.
fr: L'uri du périphérique se réfère à un périphérique série avec une vitesse configurable et d'autres options. Si l'uri du périphérique contient la vitesse, elle représente la vitesse maximale gérée par le périphérique.

source: The I<scheme> field provides the URI scheme that is supported by the backend. Backends should use this form only when the backend supports any URI using that scheme. The I<device-uri> field specifies the full URI to use when communicating with the device.
fr: Le champ I<schéma> fournit le schéma d'URI géré par le dorsal. Les dorsaux ne doivent utiliser cette forme que s'ils supportent toute URI utilisant ce schéma. Le champ I<uri_périphérique> spécifie l'URI complète à utiliser pour la communication avec le périphérique.

source: The I<device-make-and-model> field specifies the make and model of the device, e.g. "Acme Foojet 2000". If the make and model is not known, you must report "Unknown".
fr: Le champ I<marque_et_modèle_périphérique> précise la marque et le modèle du périphérique, par exemple « Acme Foojet 2000 ». Si la marque et le modèle ne sont pas connus, vous devez indiquer « Unknown ».

source: The I<device-info> field specifies additional information about the device. Typically this includes the make and model along with the port number or network address, e.g. "Acme Foojet 2000 USB #1".
fr: Le champ I<info_périphérique> ajoute des informations à propos du périphérique. Typiquement cela comprend la marque et le modèle avec le numéro de port ou l'adresse réseau, par exemple « Acme Foojet 2000 USB #1 ».

source: The optional I<device-id> field specifies the IEEE-1284 device ID string for the device, which is used to select a matching driver.
fr: Le champ optionnel I<id_périphérique> indique l'identifiant IEEE-1284 du périphérique, qui est utilisé pour sélectionner le pilote correspondant.

source: Backends without world execute permissions are run as the root user. Otherwise, the backend is run using the unprivileged user account, typically "lp".
fr: Les dorsaux sans les droits d'exécution pour tout le monde sont exécuté en tant que root. Sinon, le dorsal est exécuté en utilisant le compte non privilégié, généralement « lp ».

source: EXIT CODES
fr: CODES DE SORTIE

source: The following exit codes are defined for backends; C API constants defined in the E<lt>cups/backend.hE<gt> header file are defined in parenthesis:
fr: Les dorsaux renvoient les codes de retour suivants ; les constantes définie par l'API C dans E<lt>cups/backend.hE<gt> sont indiquées entre parenthèses :

source: The print file was successfully transmitted to the device or remote server.
fr: Le fichier à imprimer a été transmis avec succès au périphérique ou au serveur distant.

source: The print file was not successfully transmitted to the device or remote server. The scheduler will respond to this by canceling the job, retrying the job, or stopping the queue depending on the state of the error-policy attribute.
fr: Le fichier à imprimer n'a pas été transmis correctement au périphérique ou au serveur distant. L'ordonanceur annulera le travail, réessayera l'impression ou stoppera la queue en fonction de l'état de l'attribut error-policy.

source: The print file was not successfully transmitted because valid authentication information is required. The scheduler will respond to this by holding the job and adding the authentication-required job-reasons keyword.
fr: Le fichier à imprimer n'a pas été transmis correctement parce que des donnée d'identifications valables sont nécessaires. L'ordonanceur suspendra le travail et ajoutera le mot clé authentication-required à l'attribut job-reasons.

source: The print file was not successfully transmitted because it cannot be printed at this time. The scheduler will respond to this by holding the job.
fr: Le fichier à imprimer n'a pas pu être transmis parce qu'il ne pouvait pas être imprimé à ce moment. L'ordonnaceur concervera le travail d'impression.

source: The print file was not successfully transmitted because it cannot be printed at this time. The scheduler will respond to this by stopping the queue.
fr: Le fichier à imprimer n'a pas été transmis car il ne peut pas être imprimer en ce moment. L'ordonnanceur stopera la queue.

source: The print file was not successfully transmitted because one or more attributes are not supported. The scheduler will respond to this by canceling the job.
fr: Le fichier à imprimer n'a pas été transmis parce qu'un atribut n'est pas géré. L'ordonanceur répond à cela en annulant le travail d'impression.

source: All other exit code values are reserved.
fr: Tous les autres codes de sortie sont réservés.

source: I<cupsd(8)>, I<cupsd.conf(5)>, I<filter(7)>
fr: B<cupsd>(8), B<cupsd.conf>(5), B<filter>(7)

source: filter - cups file conversion filter interface
fr: filter - Interface pour des filtres de conversion de fichiers pour CUPS.

source: B<filter> job user title num-copies options [ I<filename> ]
fr: B<filter> travail utilisateur titre copies options [ I<fichier> ]

source: The CUPS filter interface provides a standard method for adding support for new document types to CUPS. Each filter is capable of converting from one or more input formats to another format that can either be printed directly or piped into another filter to get it to a printable format.
fr: Les filtres CUPS offrent la possibilité de gérer avec CUPS des nouveaux types de documents. Chaque filtre est capable de convertir des fichiers de différents formats dans un format qui est soit géré directement par CUPS ou qui peut être envoyé à un autre filtre afin d'être imprimable.

source: Filters B<must> be capable of reading from a filename on the command-line or from the standard input, copying the standard input to a temporary file as required by the file format. All output B<must> be sent to the standard output.
fr: Les filtres B<doivent> être capables de lire depuis un fichier fournit sur la ligne de commande ou depuis l'entrée standard, en copiant l'entrée standard vers un fichier temporaire si nécessaire pour ce format de fichier. Toutes les sorties B<doivent> être envoyées sur la sortie standard.

source: The command name (argv[0]) is set to the name of the destination printer.
fr: Le nom de la commande (argv[0]) vaut le nom de l'imprimante de destination.

source: LOG MESSAGES
fr: MESSAGES JOURNALISÉS

source: Messages sent to stderr are generally logged to printer-state-message attribute and the current I<ErrorLog>. Each line begins with a standard prefix:
fr: Les messages envoyés à la sortie d'erreur sont généralement enregistrés dans l'attribut printer-state-message et dans le journal I<ErrorLog> actuel. Chaque ligne commence par un préfixe standard :
