Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "alert" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « alert ».

source: ATTR: attribute=value [attribute=value]
fr: ATTR: attribut=valeur [attribut=valeur]

source: Sets the named job attribute(s). Typically this will be used to set the job-remote-id attribute.
fr: Définir l'attribut (les attributs) donné(s) du travail d'impression. Typiquement, c'est utilisé pour fixer l'attribut job-remote-id.

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "critical" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « critical ».

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "debug" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « debug ».

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "debug2" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « debug2 ».

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "emergency" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « emergency ».

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "error" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « error ».

source: Sets the printer-state-message attribute. If the current I<LogLevel> is set to "debug2", also adds the specified message to the current I<ErrorLog> using the "info" log level.
fr: Fixer l'attribut printer-state-message. Si I<LogLevel> vaut « debug2 », le message est également ajouté au journal I<ErrorLog> en utilisant le niveau « info ».

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "notice" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « notice ».

source: PAGE: page-number #-copies
fr: PAGE: numéro_page #-copies

source: Sets the printer-state-message attribute and adds the specified message to the current I<ErrorLog> using the "warning" log level.
fr: Définir l'attribut printer-state-message et ajouter le message donné au journal I<ErrorLog> actuel en utilisant le niveau de journalisation « warning ».

source: ENVIRONMENT VARIABLES
fr: VARIABLES D'ENVIRONNEMENT

source: The following environment variables are defined by the CUPS server when executing the filter:
fr: Les variables d'environnement suivantes sont définies par le serveur CUPS pour l'exécution des filtres :

source: The default text character set, typically utf-8.
fr: Définir le jeu de caractères par défaut à utiliser pour les textes, typiquement utf-8.

source: The MIME type associated with the file (e.g. application/postscript).
fr: Le type MIME associé au fichier (par exemple application/postscript).

source: The directory where data files can be found.
fr: Le répertoire où se trouvent les fichiers de données.

source: The root directory of the server.
fr: Le répertoire racine du serveur.

source: The device-uri associated with the printer.
fr: L'uri du périphérique associé à l'imprimante.

source: The MIME type associated with the printer (e.g. application/vnd.cups-postscript).
fr: Le type MIME associé à l'imprimante (par exemple application/vnd.cups-postscript).

source: The default language locale (typically C or en).
fr: La locale de la langue par défaut (généralement C ou en).

source: The standard execution path for external programs that may be run by the filter.
fr: Le chemin d'exécution par défaut pour les programmes externes qui peuvent être exécutés par le filtre.

source: The full pathname of the PostScript Printer Description (PPD) file for this printer.
fr: Le chemin complet vers le fichier PPD (PostScript Printer Description) de cette imprimante.

source: The name of the printer.
fr: Le nom de l'imprimante.

source: The recommended amount of memory to use for Raster Image Processors (RIPs).
fr: La quantité de mémoire recommandée pour les RIP (Raster Image Processors).

source: The name and version number of the server (typically CUPS/1.2).
fr: Le nom et la version du serveur (par exemple CUPS/1.2).

source: The timezone of the server.
fr: Le fuseau horaire du serveur

source: The user executing the filter, typically "lp" or "root"; consult the I<cupsd.conf(5)> file for the current setting.
fr: L'utilisateur qui exécute le filtre, typiquement « lp » ou « root » ; consultez le fichier I<cupsd.conf>(5) pour le paramétrage courant.

source: I<backend(1)>, I<cupsd(8)>,
fr: B<backend(1)>, B<cupsd(8)>,

source: accept/reject - accept/reject jobs sent to a destination
fr: accept/reject - Accepter/refuser les travaux d'impression envoyés à une destination.

source: B<accept> [ -E ] [ -U I<username> ] [ -h I<hostname[:port]> ] destination(s)
fr: B<accept> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] destination(s)

source: B<reject> [ -E ] [ -U I<username> ] [ -h I<hostname[:port]> ] [ -r I<reason> ] destination(s)
fr: B<reject> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -r I<raison> ] destination(s)

source: I<accept> instructs the printing system to accept print jobs to the specified destinations.
fr: B<accept> envoie l'ordre au système d'impression d'accepter les travaux d'impression vers les destinations spécifiées.

source: I<reject> instructs the printing system to reject print jobs to the specified destinations. The I<-r> option sets the reason for rejecting print jobs. If not specified the reason defaults to "Reason Unknown".
fr: B<reject> envoie l'ordre au système d'impression de refuser les travaux d'impression vers les destinations spécifiées. L'option B<-r> permet de spécifier la raison du rejet des travaux d'impression. Si cette raison n'est pas fournie, la raison par défaut est « Reason Unknown » (« Raison inconnue »).

source: The following options are supported by both I<accept> and I<reject>:
fr: Les options suivantes sont reconnues par B<accept> et B<reject> :

source: Sets the username that is sent when connecting to the server.
fr: Indiquer l'utilisateur utilisé pour se connecter au serveur.

source: -r "reason"
fr: B<-r> "I<raison>"

source: Sets the reason string that is shown for a printer that is rejecting jobs.
fr: Configurer la raison qui est affichée par l'imprimante lorsqu'elle refuse un travail.

source: The CUPS versions of I<accept> and I<reject> may ask the user for an access password depending on the printing system configuration. This differs from the System V versions which require the root user to execute these commands.
fr: Les versions CUPS d'B<accept> et B<reject> peuvent demander à l'utilisateur de s'identifier suivant la configuration du système d'impression, à la différence des versions System V, qui demandent le mot de passe root.

source: I<cancel(1)>, I<cupsenable(8)>, I<lp(1)>, I<lpadmin(8)>, I<lpstat(1)>,
fr: B<cancel>(1), B<cupsenable>(8), B<lp>(1), B<lpadmin>(8), B<lpstat>(1),

source: cupsaddsmb - export printers to samba for windows clients
fr: cupsaddsmb - Exporter des imprimantes vers Samba pour les clients Windows.

source: B<cupsaddsmb> [ -H I<samba-server> ] [ -U I<samba-user[%samba-password]> ] [ -h I<cups-server[:port]> ] [ -v ] -a
fr: B<cupsaddsmb> [ -H I<serveur_samba> ] [ -U I<utilisateur_samba[%mot-de-passe_samba]> ] [ -h I<serveur_cups[:port]> ] [ -v ] -a

source: B<cupsaddsmb> [ -H I<samba-server> ] [ -U I<samba-user[%samba-password]> ] [ -h I<cups-server[:port]> ] [ -v ] printer [ ... printer ]
fr: B<cupsaddsmb> [ -H I<serveur_samba> ] [ -U I<utilisateur_samba[%mot-de-passe_samba]> ] [ -h I<serveur_cups[:port]> ] [ -v ] imprimante [ ... imprimante ]

source: I<cupsaddsmb> exports printers to the SAMBA software (version 2.2.0 or higher) for use with Windows clients. Depending on the SAMBA configuration, you may need to provide a password to export the printers. This program requires the Windows printer driver files described below.
fr: B<cupsaddsmb> permet l'export d'imprimantes vers SAMBA (version 2.2.0 ou supérieure) pour l'utilisation par des clients Windows. Suivant la configuration de SAMBA, il est possible qu'un mot de passe soit demandé pour l'export. Ce programme requiert les fichiers du driver Windows, comme indiqué plus bas.

source: I<cupsaddsmb> supports the following options:
fr: B<cupsaddsmb> gère les options suivantes :

source: -H samba-server
fr: B<-H> I<serveur_samba>

source: Specifies the SAMBA server which defaults to the CUPS server.
fr: Préciser le serveur SAMBA par défaut pour le serveur CUPS.

source: -U samba-user[%samba-password]
fr: B<-U> I<utilisateur_samba[%mot-de-passe_samba]>

source: Specifies the SAMBA print admin username which defaults to your current username. If the username contains a percent (%) character, then the text following the percent is treated as the SAMBA password to use.
fr: Spécifier le nom d'utilisateur de l'administrateur d'impression SAMBA, qui est par défaut l'utilisateur courant. Si l'utilisateur contient un caractère « % », ce qui suite le pourcent est considéré comme le mot de passe SAMBA à utiliser.

source: Exports all known printers. Otherwise only the named printers are exported.
fr: Exporter toutes les imprimantes connues. Sinon, seules les imprimantes fournies sur la ligne de commande sont exportées.

source: -h cups-server[:port]
fr: B<-h> I<serveur_cups[:port]>

source: Specifies a different CUPS server to use.
fr: Définir un autre serveur CUPS à utiliser.

source: Specifies that verbose information should be shown. This is useful for debugging SAMBA configuration problems.
fr: Spécifier que des informations détaillées doivent être affichées. Ceci peut être utile pour le débogage des configurations de SAMBA.

source: SAMBA CONFIGURATION
fr: CONFIGURATION DE SAMBA

source: I<cupsaddsmb> uses the new RPC-based printing support in SAMBA 2.2.x to provide printer drivers and PPD files to Windows client machines. In order to use this functionality, you must first configure the SAMBA I<smb.conf(5)> file to support printing through CUPS and provide a printer driver download share, as follows:
fr: B<cupsaddsmb> utilise le nouveau mode d'impression RPC de SAMBA 2.2.x pour fournir aux clients Windows les drivers d'impression et les fichiers PPD. Pour utiliser cette fonctionnalité, vous devez configurer SAMBA (via le fichier I<smb.conf>(5)) pour qu'il utilise l'impression via CUPS, et fournir un driver à télécharger. Ceci est fait de la manière suivante :

source: This configuration assumes a FHS-compliant installation of SAMBA; adjust the [printers] and [print$] share paths accordingly on your system as needed.
fr: Cette configuration suppose une installation de SAMBA conforme au standard FHS. Modifiez les chemins des partages [printers] et [print$] suivant votre installation.

source: MICROSOFT POSTSCRIPT DRIVERS FOR WINDOWS
fr: PILOTES POSTSCRIPT MICROSOFT POUR WINDOWS

source: The CUPS printer driver is preferred over the Microsoft driver since it supports the page-label, job-billing, and job-hold-until options fully on all printers. However, currently only Windows 2000 and higher is supported by the Microsoft driver, so you will also need to get the Adobe driver to support Windows 95, 98, and Me clients. The Adobe and Microsoft drivers for Windows 2000 are identical.
fr: Il est recommandé d'utiliser le pilote CUPS plutôt que celui de Microsoft puisqu'il permet, pour toutes les imprimantes, l'étiquetage des pages, la facturation des travaux et l'interruption. Cependant, seuls Windows 2000 et les versions ultérieures sont supportés par le pilote Microsoft, donc vous devrez utiliser le pilote Adobe pour les clients Windows 95, 98 et Me. Les pilotes Adobe et Microsoft pour Windows 2000 sont identiques.

source: [Windows 2000 and higher] ps5ui.dll pscript.hlp pscript.ntf pscript5.dll
fr: [Windows 2000 et supérieurs] ps5ui.dll pscript.hlp pscript.ntf pscript5.dll

source: B<Note:> Unlike Windows, case is significant - make sure that you use the lowercase filenames shown above, otherwise I<cupsaddsmb> will fail to export the drivers.
fr: B<Remarque :> Contrairement à Windows, la casse est importante. Assurez vous d'utiliser des noms de fichiers en minuscule, comme ci-dessus. Sinon, B<cupsaddsmb> échouera lors de l'export des pilotes.

source: CUPS POSTSCRIPT DRIVERS FOR WINDOWS
fr: PILOTES POSTSCRIPT CUPS POUR WINDOWS

source: I<cupsaddsmb> can use the CUPS v6 PostScript printer driver for Windows, which is available for download from the CUPS web site.
fr: B<cupsaddsmb> peut utiliser les pilotes PostScript CUPS V6 pour Windows, disponibles en téléchargement sur le site web de CUPS.

source: The CUPS printer driver is preferred over the Adobe and Microsoft drivers since it supports the page-label, job-billing, and job-hold-until options fully on all printers. However, currently only Windows 2000 and higher is supported by the CUPS driver, so you will also need to get the Adobe driver to support Windows 95, 98, and Me clients.
fr: Il est recommandé d'utiliser le pilote CUPS plutôt que ceux d'Adobe et de Microsoft puisqu'il permet, pour toutes les imprimantes, l'étiquetage des pages, la facturation des travaux et l'interruption des travaux. Cependant, seuls Windows 2000 et les versions ultérieures sont supportés le pilote CUPS, donc vous devrez utiliser le pilote Adobe pour les clients Windows 95, 98 et Me.

source: [Windows 2000 and higher] cups6.inf (from www.cups.org) cups6.ini (from www.cups.org) cupsps6.dll (from www.cups.org) cupsui6.dll (from www.cups.org) ps5ui.dll (from your Windows system) pscript.hlp (from your Windows system) pscript.ntf (from your Windows system) pscript5.dll (from your Windows system)
fr: [Windows 2000 et supérieurs] cups6.inf (from www.cups.org) cups6.ini (from www.cups.org) cupsps6.dll (from www.cups.org) cupsui6.dll (from www.cups.org) ps5ui.dll (from your Windows system) pscript.hlp (from your Windows system) pscript.ntf (from your Windows system) pscript5.dll (from your Windows system)

source: ADOBE POSTSCRIPT DRIVERS FOR WINDOWS 95, 98, AND ME
fr: PILOTES POSTSCRIPT ADOBE POUR WINDOWS 95, 98 et ME

source: I<cupsaddsmb> can use the Adobe PostScript printer driver for Windows 95, 98, and ME, which are available for download from the Adobe web site (http://www.adobe.com).
fr: B<cupsaddsmb> peut utiliser le pilote des imprimantes PostScript d'Adobe pour Windows 95, 98 et ME, qui sont disponibles en téléchargement sur le site d'Adobe (http://www.adobe.com).

source: The Adobe driver does not support the page-label, job-billing, or job-hold-until options.
fr: Le pilote Adobe ne permet pas l'étiquetage des pages, la facturation des travaux et l'interruption des travaux.

source: Once you have installed the driver on a Windows system, copy the following files to the I</usr/share/cups/drivers> directory exactly as named below:
fr: Une fois que vous avec les pilotes sur un système Windows, copiez les fichiers suivants dans le répertoire I</usr/share/cups/drivers>, en respectant les noms indiqués :

source: [Windows 95, 98, and Me] ADFONTS.MFM ADOBEPS4.DRV ADOBEPS4.HLP ICONLIB.DLL PSMON.DLL
fr: [Windows 95, 98 et Me] ADFONTS.MFM ADOBEPS4.DRV ADOBEPS4.HLP ICONLIB.DLL PSMON.DLL

source: B<Note:> Unlike Windows, case is significant - make sure that you use the UPPERCASE filenames shown above, otherwise I<cupsaddsmb> will fail to export the drivers.
fr: B<Remarque :> Contrairement à Windows, la casse est importante. Assurez vous d'utiliser des noms de fichiers en MAJUSCULE, comme ci-dessus. Sinon, B<cupsaddsmb> échouera lors de l'export des pilotes.

source: KNOWN ISSUES
fr: PROBLÈMES CONNUS

source: I<smbd(8)>, I<smb.conf(5)>, http://localhost:631/help
fr: B<smbd>(8), B<smb.conf>(5), http://localhost:631/help

source: cupsd - common unix printing system daemon
fr: cupsd - démon Common Unix Printing System.

source: B<cupsd> [ -c I<config-file> ] [ -f ] [ -F ] [ -h ] [ -l ]
fr: B<cupsd> [ -c I<fichier_configuration> ] [ -f ] [ -F ] [ -h ] [ -l ]

source: I<cupsd> is the scheduler for the Common UNIX Printing System. It implements a printing system based upon the Internet Printing Protocol, version 1.1. If no options are specified on the command-line then the default configuration file I</etc/cups/cupsd.conf> will be used.
fr: B<cupsd> est un ordonanceur pour le système Common UNIX Printing System. Il fournit des outils pour un système d'impression de base sur le Internet Printing Protocol, version 1.1. Si aucune option n'est spécifiée sur la ligne de commande, alors le fichier de configuration par défaut I</etc/cups/cupsd.conf> sera utilisé.

source: -c config-file
fr: B<-c> I<fichier_configuration>

source: Uses the named configuration file.
fr: Utiliser le fichier de configuration donné.

source: -f
fr: B<-f>

source: Run I<cupsd> in the foreground; the default is to run in the background as a "daemon".
fr: Forcer B<cupsd> à tourner au premier plan ; par défaut, cupsd tourne en arrière-plan comme « démon ».

source: -F
fr: B<-F>

source: Run I<cupsd> in the foreground but detach the process from the controlling terminal and current directory. This is useful for running I<cupsd> from I<init(8)>.
fr: Forcer B<cupsd> à tourner en avant-plan, mais détache le processus du terminal et du répertoire de travail. Cette option est utile pour lancer B<cupsd> depuis B<init>(8).

source: Shows the program usage.
fr: Afficher un message d'aide.

source: This option is passed to I<cupsd> when it is run from I<launchd(8)>.
fr: Cette option est passée à B<cupsd> losqu'il est lancé par B<launchd>(8).

source: I<cupsd> implements all of the required IPP/1.1 attributes and operations. It also implements several CUPS-specific administration operations.
fr: B<cupsd> fournit tous les attributs et opération de IPP/1.1. Il implémente aussi plusieurs opérations d'administration spécifiques à CUPS.

source: I<backend(7)>, I<classes.conf(5)>, I<cups-deviced(8)>, I<cups-driverd(8)>, I<cups-lpd(8)>, I<cups-polld(8)>, I<cupsd.conf(5)>, I<filter(7)>, I<launchd(8)>, I<mime.convs(5)>, I<mime.types(5)>, I<printers.conf(5)>,
fr: B<backend>(7), B<classes.conf>(5), B<cups-deviced>(8), B<cups-driverd>(8), B<cups-lpd>(8), B<cups-polld>(8), B<cupsd.conf>(5), B<filter>(7), B<launchd>(8)>, B<mime.convs>(5), B<mime.types>(5), B<printers.conf>(5),

source: cups-deviced - cups device daemon
fr: cups-deviced - Démon de périphériques CUPS.

source: B<cups-deviced> I<request-id limit user-id options>
fr: B<cups-deviced> I<id_requête limite id_utilisateur options>

source: I<cups-deviced> polls the backends in I</usr/lib/cups/backend> for a list of available devices. It is run by I<cupsd(8)> in response to a I<CUPS-Get-Devices> request. The output format is an IPP response message. The I<request-id> argument is the request ID from the original IPP request, typically 1. The \Ilimit argument is the limit value from the original IPP request - 0 means no limit. The I<user-id> argument is the requesting-user-name value from the original IPP request. Finally, the I<options> argument is a space-delimited list of attributes ("name=value name=value ...") that were passed in with the request. Currently I<cups-deviced> looks for the I<requested-attributes> attribute and tailors the output accordingly.
fr: B<cups-deviced> interroge régulièrement les dorsaux de I</usr/lib/cups/backend> pour avoir la liste des périphériques disponibles. Il est exécuté par B<cups>(8) suite à une requête I<CUPS-Get-Devices>. Le format de sortie est un message de réponse IPP. Le paramètre I<request-id> correspond à l'identifiant de la requête IPP initiale, typiquement 1. Le paramètre \Ilimite est la valeur limite de la requête initiale, 0 signifiant qu'il n'y a pas de limite. Le paramètre I<user-id> est la valeur requesting-user-name (utilisateur demandeur) de la requête initiale. Enfin, le paramètre I<options> est une liste d'attributs séparés par des espaces (« nom=valeur nom=valeur ») qui étaient passés à la requête. Actuellement, B<cups-deviced> utilise les attributs I<requested-attributes> pour construire la sortie en conséquence.

source: backend(7), cupsd(8), cupsd.conf(5),
fr: B<backend>(7), B<cupsd>(8), B<cupsd.conf>(5),

source: cups-driverd - cups driver daemon
fr: cups-driverd - Démon de pilotes CUPS.

source: B<cups-driverd> cat I<ppd-name>
fr: B<cups-driverd> cat I<nom_ppd>

source: B<cups-driverd> list I<request_id limit options>
fr: B<cups-driverd> list I<id_requête limite options>

source: I<cups-driverd> shows or lists PPD files. It is run in response to CUPS-Add-Modify-Printer or CUPS-Get-Devices requests. The first form ("cups-driverd cat ppd-name") writes the named PPD file to stdout. The output format is an uncompressed PPD file.
fr: B<cups-driverd> affiche ou liste les fichiers PPD. Il est exécuté en réponse à des requêtes CUPS-Add-Modify-Printer ou CUPS-Get-Devices. La première forme (« cups-driverd cat nom_ppd ») écrit le fichier PPD sur la sortie standard. Le format de sortie est un fichier PPD non compressé.

source: The second form lists the available manufacturers or PPD files to stdout as indicated by the I<options> argument. The output format is an IPP response message. The I<request_id> argument is the request ID from the original IPP request, typically 1. The \Ilimit argument is the limit value from the original IPP request - 0 means no limit. Finally, the I<options> argument is a space-delimited list of attributes ("name=value name=value \&...") that were passed in with the request. Currently I<cups-driverd> looks for the I<ppd-make> and I<requested-attributes> attributes and tailors the output accordingly.
fr: La seconde forme liste les fabricants ou les fichiers PPD disponibles sur la sortie standard, comme demandé par le paramètre I<options>. Le format de sortie est un message de réponse IPP. Le paramètre I<request-id> correspond à l'identifiant de la requête IPP initiale, typiquement 1. Le paramètre I<limite> est la valeur limite de la requête initiale, 0 signifiant qu'il n'y a pas de limite. Enfin, le paramètre I<options> est une liste d'attributs séparés par des espaces (« nom=valeur nom=valeur \&... ») qui étaient passés à la requête. Actuellement, B<cups-deviced> utilise les attributs I<ppd-make> et I<requested-attributes> pour construire la sortie en conséquence.

source: DRIVERS
fr: PILOTES
