Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: The CUPS version of I<lpadmin> does not support all of the System V or Solaris printing system configuration options.
fr: La version CUPS de I<lpadmin> ne reconnaît pas toutes les options de configuration disponibles dans les versions System V ou Solaris.

source: lpc - line printer control program
fr: lpc - Programme de contrôle d'imprimantes par ligne.

source: B<lpc> [ I<command> [ I<parameter(s)> ] ]
fr: B<lpc> [ I<commande> [ I<paramètre(s)> ] ]

source: I<lpc> provides limited control over printer and class queues provided by CUPS. It can also be used to query the state of queues.
fr: B<lpc> permet de contrôler partiellement des imprimantes et classes d'imprimantes de CUPS. Il est également utilisé pour récupérer l'état des files d'attente.

source: If no command is specified on the command-line, lpc will display a prompt and accept commands from the standard input.
fr: Si aucune commande n'est donnée dans la ligne de commande, lpc affichera une invite et prendra ses commandes depuis l'entrée standard.

source: COMMANDS
fr: COMMANDES

source: The I<lpc> program accepts a subset of commands accepted by the Berkeley I<lpc> program of the same name:
fr: I<lpc> reconnaît un sous-ensemble des commandes reconnues le programme I<lpc> de Berkeley :

source: Exits the command interpreter.
fr: Quitte l'interpréteur de commandes.

source: help [command]
fr: help I<[commande]>

source: ? [command]
fr: ? I<[commande]>

source: Displays a short help message.
fr: Afficher un message d'aide.

source: status [queue]
fr: status I<[file-attente]>

source: Displays the status of one or more printer or class queues.
fr: Afficher l'état des files d'attente d'une ou plusieurs imprimantes ou classes d'imprimantes.

source: Since I<lpc> is geared towards the Berkeley printing system, it is impossible to use I<lpc> to configure printer or class queues provided by CUPS. To configure printer or class queues you must use the I<lpadmin(8)> command or another CUPS-compatible client with that functionality.
fr: Étant donné que I<lpc> est spécifique au système d'impression de Berkeley, il est impossible de l'utiliser pour configurer les files d'attente de CUPS. Pour cela, vous devez utiliser le programme B<lpadmin>(8) ou tout autre client compatible avec CUPS remplissant ces fonctions.

source: The CUPS version of I<lpc> does not implement all of the standard Berkeley or LPRng commands.
fr: La version CUPS de B<lpc> n'implémente pas toutes les commandes des versions Berkeley ou LPRng.

source: lpinfo - show available devices or drivers
fr: lpinfo - Afficher les périphériques et pilotes disponibles.

source: B<lpinfo> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] [ -l ] -m
fr: B<lpinfo> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -l ] -m

source: B<lpinfo> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] [ -l ] -v
fr: B<lpinfo> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -l ] -v

source: I<lpinfo> lists the available devices or drivers known to the CUPS server. The first form (I<-m>) lists the available drivers, while the second form (I<-v>) lists the available devices.
fr: B<lpinfo> affiche la liste des périphériques ou pilotes connus par le serveur CUPS. La première forme (avec B<-m>) liste les pilotes disponibles, et la seconde forme (avec B<-v>) liste les périphériques disponibles.

source: I<lpinfo> accepts the following options:
fr: I<lpinfo> gère les options suivantes :

source: Sets the username to use when connecting to the server.
fr: Indiquer l'utilisateur utilisé pour se connecter au serveur.

source: Selects an alternate server.
fr: Sélectionner un autre serveur.

source: Shows a "long" listing of devices or drivers.
fr: Afficher une liste « longue » des périphériques ou pilotes.

source: The I<lpinfo> command is unique to CUPS.
fr: La commande B<lpinfo> est spécifique à CUPS.

source: lpmove - move a job or all jobs to a new destination
fr: lpmove - Déplacer un travail d'impression (ou tous) vers une nouvelle destination.

source: B<lpmove> [ -E ] [ -h I<server[:port]> ] [ -U I<username> ] I<job destination>
fr: B<lpmove> [ -E ] [ -h I<serveur[:port]> ] [ -U I<utilisateur> ] I<travail destination>

source: B<lpmove> [ -E ] [ -h I<server[:port]> ] [ -U I<username> ] I<source destination>
fr: B<lpmove> [ -E ] [ -h I<serveur[:port]> ] [ -U I<utilisateur> ] I<source destination>

source: B<lpmove> moves the specified I<job> or all jobs from I<source> to I<destination>. I<job> can be the job ID number or the old destination and job ID:
fr: B<lpmove> déplace le I<travail d'impression> ou tous les travaux de I<source> vers I<destination>. On peut spécifier le I<travail> sous deux formes : soit l'identifiant du travail d'impression, soit l'ancienne destination et l'identifiant du travail. Par exemple :

source: lpmove 123 newprinter lpmove oldprinter-123 newprinter
fr: lpmove 123 NouvelleImprimante lpmove AncienneImprimante-123 NouvelleImprimante

source: The I<lpmove> command supports the following options:
fr: I<lpmove> gère les options suivantes :
