Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: The following directives are understood by I<cupsd(8)>. Consult the on-line help for detailed descriptions:
fr: Les directives suivantes sont comprises par B<cupsd>(8). Veuillez vous reporter à l'aide en ligne pour une description plus détaillée.

source: AccessLog filename
fr: AccessLog fichier

source: Defines the access log filename.
fr: Définir le fichier traçant les accès.

source: Allow host.domain.com
fr: Allow serveur.domaine.com

source: Allow *.domain.com
fr: Allow *.domaine.com

source: Allow ip-address
fr: Allow adresse_ip

source: Allow ip-address/netmask
fr: Allow adresse_ip/masque_sous_réseau

source: Allow ip-address/mm
fr: Allow adresse_ip/mm

source: Allow @IF(name)
fr: Allow @IF(nom)

source: Allows access from the named hosts or addresses.
fr: Permettre l'accès depuis des machines nommées ou des adresses IP.

source: Specifies the authentication class (User, Group, System) - B<this directive is deprecated>.
fr: Définir la classe d'identification (User, Group, System). B<Cette directive est obsolète.>

source: AuthGroupName group-name
fr: AuthGroupName groupe

source: Specifies the authentication group - B<this directive is deprecated>.
fr: Définir le groupe d'identification. B<Cette directive est obsolète.>

source: Specifies whether to purge job history data automatically when it is no longer required for quotas.
fr: Définir s'il faut purger automatiquement l'historique des travaux lorsque les données ne sont plus nécessaires pour l'application des quotas.

source: BrowseAddress ip-address
fr: BrowseAddress adresse_ip

source: BrowseAddress @IF(name)
fr: BrowseAddress @IF(nom)

source: Specifies a broadcast address for outgoing printer information packets.
fr: Définir une adresse où broadcaster les informations sur les imprimantes.

source: BrowseAllow host.domain.com
fr: BrowseAllow serveur.domaine.com

source: BrowseAllow *.domain.com
fr: BrowseAllow *.domaine.com

source: BrowseAllow ip-address
fr: BrowseAllow adresse_ip

source: BrowseAllow ip-address/netmask
fr: BrowseAllow adresse_ip/masque_sous_réseau

source: BrowseAllow ip-address/mm
fr: BrowseAllow adresse_ip/mm

source: BrowseAllow @IF(name)
fr: BrowseAllow @IF(nom)

source: Allows incoming printer information packets from the named host or address.
fr: Accepter les paquets arrivant des machines ou adresses IP indiquées.

source: BrowseDeny host.domain.com
fr: BrowseDeny serveur.domaine.com

source: BrowseDeny *.domain.com
fr: BrowseDeny *.domaine.com

source: BrowseDeny ip-address
fr: BrowseDeny adresse_ip

source: BrowseDeny ip-address/netmask
fr: BrowseDeny adresse_ip/masque_sous_réseau

source: BrowseDeny ip-address/mm
fr: BrowseDeny addresse_ip/mm

source: BrowseDeny @IF(name)
fr: BrowseDeny @IF(nom)

source: Denies incoming printer information packets from the named host or address.
fr: Refuser les paquets d'informations sur les imprimantes arrivant de machines ou d'adresses IP données.

source: BrowseInterval seconds
fr: BrowseInterval secondes

source: Specifies the maximum interval between printer information broadcasts.
fr: Définir l'intervalle maximum entre les envois d'information sur les imprimantes.

source: Specifies the order of printer information access control (allow,deny or deny,allow)
fr: Définir l'ordre du contrôle d'accès aux informations des imprimantes (allow,deny ou deny,allow).

source: BrowsePoll host-or-ip-address
fr: BrowsePoll serveur-ou-adresse_ip

source: Specifies a server to poll for printer information.
fr: Définir un serveur à interroger régulièrement pour les informations sur les imprimantes.

source: Specifies the port to listen to for printer information packets.
fr: Définir le port utilisé pour écouter les informations sur les imprimantes.

source: Specifies the protocols to use for printer browsing.
fr: Définir les protocoles réseaux à utiliser pour la recherche d'imprimantes.

source: Specifies the protocols to use for local printer browsing.
fr: Définir les protocoles réseaux à utiliser pour la recherche d'imprimantes locales.

source: Specifies the protocols to use for remote printer browsing.
fr: Définir les protocoles réseaux à utiliser pour la recherche d'imprimantes distantes.

source: BrowseRelay from-address to-address
fr: BrowseRelay depuis_adresse vers_adresse

source: Specifies that printer information packets should be relayed from one host or network to another.
fr: Indiquer que les informations sur les imprimantes doivent être relayés depuis une machine ou un réseau vers un autre.

source: Specifies whether remote printers will use short names ("printer") or not ("printer@server"). This option is ignored if more than one remote printer exists with the same name.
fr: Définir si les imprimantes distantes utilisent les noms abrégés (« imprimante ») ou non (« imprimante@serveur »). Cette option est ignorée si plus d'une imprimante distante a le même nom.

source: BrowseTimeout seconds
fr: BrowseTimeout secondes

source: Specifies the maximum interval between printer information updates before remote printers will be removed from the list of available printers.
fr: Définir l'intervalle maximum de temps entre deux mises à jour d'informations des imprimantes distantes avant que celles-ci ne soient supprimées de la liste des imprimantes disponibles.

source: Specifies whether or not remote printer browsing should be enabled.
fr: Définir si la recherche des imprimantes distantes doit être activée.

source: Classification banner
fr: Classification bannière

source: Specifies the security classification of the server.
fr: Définir le niveau de classification du serveur.

source: Specifies whether to allow users to override the classification of individual print jobs.
fr: Définir si les utilisateurs sont autorisés à modifier la classification de leurs travaux d'impression.

source: Specifies the permissions for all configuration files that the scheduler writes.
fr: Définir les permissions à utiliser pour les fichiers de configuration écrits par l'ordonnanceur.

source: Specified the directory where data files can be found.
fr: Définir le répertoire où se trouvent les fichiers de données.

source: Specifies the default type of authentication to use.
fr: Définir le type d'identification à utiliser par défaut.

source: DefaultCharset charset
fr: DefaultCharset jeux_de_caractères

source: Specifies the default character set to use for text.
fr: Définir le jeu de caractères par défaut à utiliser pour le texte.

source: Specifies the default language to use for text and web content.
fr: Définir la langue par défaut à utiliser pour les textes et le site web.

source: DefaultPolicy policy-name
fr: DefaultPolicy nom

source: Specifies the default access policy to use.
fr: Indiquer la politique d'accès par défaut.

source: Deny host.domain.com
fr: Deny serveur.domaine.com

source: Deny *.domain.com
fr: Deny *.domaine.com

source: Deny ip-address
fr: Deny adresse_ip

source: Deny ip-address/netmask
fr: Deny adresse_ip/masque_sous_réseau

source: Deny ip-address/mm
fr: Deny adresse_ip/mm

source: Deny @IF(name)
fr: Deny @IF(nom)

source: Denies access to the named host or address.
fr: Interdire l'accès à une machine ou à une adresse IP donnée.

source: DocumentRoot directory
fr: DocumentRoot répertoire

source: Specifies the root directory for the internal web server documents.
fr: Définir le répertoire racine des documents du serveur web interne.

source: ErrorLog filename
fr: ErrorLog fichier

source: Specifies the error log filename.
fr: Définir le nom du fichier traçant les erreurs.

source: Specifies whether the file pseudo-device can be used for new printer queues.
fr: Indiquer si un fichier de pseudo-périphérique peut être utilisé pour les queues d'impression.

source: FilterLimit limit
fr: FilterLimit limite

source: Specifies the maximum cost of filters that are run concurrently.
fr: Définir le coût maximum des filtres lancés simultanément.

source: FilterNice nice-value
fr: FilterNice priorité

source: Specifies the scheduling priority ("nice" value) of filters that are run to print a job.
fr: Définir la priorité (valeur «\ nice\ ») des filtres exécutés pour une impression.

source: FontPath directory[:directory:...]
fr: FontPath répertoire[:répertoire:...]

source: Specifies the search path for fonts.
fr: Définir le chemin de recherche des polices.

source: Group group-name-or-number
fr: Group nom_groupe-ou-identifiant_numérique

source: Specifies the group name or ID that will be used when executing external programs.
fr: Définir le nom du groupe ou l'identifiant numérique du groupe qui sera utilisé lors de l'exécution de programmes externes.

source: Specifies whether to hide members of implicit classes.
fr: Définir s'il faut cacher ou non les membres des classes implicites.

source: Specifies whether or not to do reverse lookups on client addresses.
fr: Définir s'il faut effectuer des recherches de noms à partir des adresses des clients.

source: Specifies whether or not to create implicit classes for local and remote printers, e.g. "AnyPrinter" from "Printer", "Printer@server1", and "Printer@server2".
fr: Indiquer s'il faut créer des classes implicites pour les imprimantes locales et distantes (par exemple « UneImprimante » pour « Imprimante », « Imprimante@serveur1 » et « Imprimante@serveur2 »).

source: Specifies whether or not to create implicit classes from identical remote printers.
fr: Indiquer s'il faut créer une classe implicite pour les imprimantes distantes identiques.

source: Include filename
fr: Include fichier

source: Includes the named file.
fr: Inclure le fichier donné.

source: JobRetryInterval seconds
fr: JobRetryInterval secondes

source: Specifies the interval between retries of jobs in seconds.
fr: Indiquer l'intervalle entre deux essais d'impression d'un travail, en secondes.

source: JobRetryLimit count
fr: JobRetryLimit nombre

source: Specifies the number of retries that are done for jobs.
fr: Indiquer le nombre d'essais maximum pour les travaux.

source: Specifies whether to support HTTP keep-alive connections.
fr: Définir s'il faut utiliser HTTP-Keep-Alive.

source: KeepAliveTimeout seconds
fr: KeepAliveTimeout secondes

source: Specifies the amount of time that connections are kept alive.
fr: Définir la durée pendant laquelle les connexion sont conservées.

source: Specifies the IPP operations that are being limited inside a policy.
fr: Indiquer les opérations IPP non autorisés dans une certaine politique.

source: E<lt>Limit methodsE<gt> ... E<lt>/LimitE<gt>
fr: E<lt>Limit methodesE<gt> ... E<lt>/LimitE<gt>

source: E<lt>LimitExcept methodsE<gt> ... E<lt>/LimitExceptE<gt>
fr: E<lt>LimitExcept methodesE<gt> ... E<lt>/LimitExceptE<gt>

source: Specifies the HTTP methods that are being limited inside a location.
fr: Définir les méthodes HTTP interdites pour un lieu donné.

source: Specifies the maximum size of any print job request.
fr: Définir la taille maximale des demandes de travaux d'impression.

source: Listen ip-address:port
fr: Listen adress_ip:port

source: Listen /path/to/domain/socket
fr: Listen /chemin/socket/domaine

source: Listens to the specified address and port or domain socket path.
fr: Écouter à l'adresse et au port indiqué ou sur la socket de domaine dont le chemin est indiqué.

source: E<lt>Location /pathE<gt> ... E<lt>/LocationE<gt>
fr: E<lt>Location /cheminE<gt> ... E<lt>/LocationE<gt>

source: Specifies access control for the named location.
fr: Définir les contrôles d'accès pour un lieu donné.

source: Specifies the permissions for all log files that the scheduler writes.
fr: Définir les permissions des fichiers journaux écrits par l'ordonnanceur.

source: Specifies the logging level for the ErrorLog file.
fr: Définir le niveau de trace pour le journal des erreurs.

source: MaxClients number
fr: MaxClients nombre

source: Specifies the maximum number of simultaneous clients to support.
fr: Définir le nombre maximum de clients simultanés.

source: MaxClientsPerHost number
fr: MaxClientsPerHost nombre

source: Specifies the maximum number of simultaneous clients to support from a single address.
fr: Définir le nombre maximum de clients simultanés provenant de la même adresse.

source: MaxCopies number
fr: MaxCopies nombre

source: Specifies the maximum number of copies that a user can print of each job.
fr: Définir le nombre maximum de copies qu'un utilisateur peut effectuer pour un travail d'impression.

source: MaxJobs number
fr: MaxJobs nombre

source: Specifies the maximum number of simultaneous jobs to support.
fr: Définir le nombre maximum de travaux simultanés.

source: MaxJobsPerPrinter number
fr: MaxJobsPerPrinter nombre

source: Specifies the maximum number of simultaneous jobs per printer to support.
fr: Définir le nombre maximum de travaux simultanés par imprimante.

source: MaxJobsPerUser number
fr: MaxJobsPerUser nombre

source: Specifies the maximum number of simultaneous jobs per user to support.
fr: Définir le nombre maximum de travaux simultanés par utilisateur.

source: MaxLogSize number-bytes
fr: MaxLogSize nombre_octets

source: Specifies the maximum size of the log files before they are rotated (0 to disable rotation)
fr: Définir la taille maximale des fichiers de trace. Au-delà de cette taille, les fichiers sont recyclés (0 pour supprimer la rotation des fichiers.

source: MaxRequestSize number-bytes
fr: MaxRequestSize nombre_octets

source: Specifies the maximum request/file size in bytes (0 for no limit)
fr: Définir la taille maximale des fichiers et des requêtes à imprimer. La taille est exprimée en octets (0 indique qu'il n'y a pas de limite).

source: Specifies the order of HTTP access control (allow,deny or deny,allow)
fr: Définir l'ordre pour le contrôle d'accès HTTP (allow,deny ou deny,allow).

source: PageLog filename
fr: PageLog fichier

source: Specifies the page log filename.
fr: Définir le fichier de trace des pages web visitées.

source: Passes the specified environment variable(s) to child processes.
fr: Passer les variables d'environnement spécifiées aux processus fils.

source: E<lt>Policy nameE<gt> ... E<lt>/PolicyE<gt>
fr: E<lt>Policy nomE<gt> ... E<lt>/PolicyE<gt>

source: Specifies access control for the named policy.
fr: Définir les contrôles d'accès pour la politique donnée.

source: Port number
fr: Port nombre

source: Specifies a port number to listen to for HTTP requests.
fr: Définir le numéro du port où écouter les requêtes HTTP.

source: Specifies whether or not to preserve job files after they are printed.
fr: Définir s'il faut conserver ou non les fichiers de travail après impression.

source: Specifies whether or not to preserve the job history after they are printed.
fr: Définir s'il faut conserver ou non l'historique des demandes d'impression une fois qu'elles sont terminées.

source: Printcap filename
fr: Printcap fichier

source: Specifies the filename for a printcap file that is updated automatically with a list of available printers (needed for legacy applications); specifying Printcap with no filename disables printcap generation.
fr: Définir l'emplacement du fichier printcap, contenant la liste des imprimantes disponibles, et qui est mis à jour automatiquement. Ce fichier est indispensable aux applications classiques. Si aucun fichier printcap n'est précisé, la génération du fichier printcap sera désactivée.

source: Specifies the format of the printcap file.
fr: Définir le format du fichier printcap.

source: PrintcapGUI gui-program-filename
fr: PrintcapGUI fichier_interface_graphique

source: ReloadTimeout seconds
fr: ReloadTimeout secondes

source: Specifies the amount of time to wait for job completion before restarting the scheduler.
fr: Définir le temps maximum à attendre pour la fin d'un travail avant de redémarrer l'ordonnanceur.

source: RemoteRoot user-name
fr: RemoteRoot utilisateur

source: Specifies the username that is associated with unauthenticated root accesses.
fr: Définir l'utilisateur associé aux accès root non identifié.

source: RequestRoot directory
fr: RequestRoot répertoire

source: Specifies the directory to store print jobs and other HTTP request data.
fr: Définir le répertoire où sont stockés les travaux et les données des requêtes HTTP.

source: Require group group-name-list
fr: Require group liste_groupes

source: Require user user-name-list
fr: Require user liste_utilisateurs

source: Specifies that user or group authentication is required.
fr: Indiquer qu'une identification par utilisateur ou par groupe est nécessaire.

source: RIPCache bytes
fr: RIPCache octets

source: Specifies the maximum amount of memory to use when converting images and PostScript files to bitmaps for a printer.
fr: Définir la taille maximale de mémoire à utiliser lors de la conversion d'images ou de fichiers PostScript en fichier bitmap pour une imprimante.

source: Specifies whether all or any limits set for a Location must be satisfied to allow access.
fr: Définir si toutes les limites (« all »), ou seulement une des limites (« any ») définies pour un lieu donné doivent être satisfaites pour permettre l'accès.

source: ServerAdmin user@domain.com
fr: ServerAdmin utilisateur@domaine.com

source: Specifies the email address of the server administrator.
fr: Définir l'adresse électronique de l'administrateur du serveur.

source: ServerBin directory
fr: ServerBin répertoire

source: Specifies the directory where backends, CGIs, daemons, and filters may be found.
fr: Définir le répertoire où les applications dorsales, les CGI, les démons et les filtres sont stockés.

source: ServerCertificate filename
fr: ServerCertificate fichier

source: Specifies the encryption certificate to use.
fr: Définir le certificat à utiliser pour le chiffrement.

source: ServerKey filename
fr: ServerKey fichier

source: Specifies the encryption key to use.
fr: Définir la clé de chiffrement à utiliser.

source: ServerName hostname-or-ip-address
fr: ServerName hôte-ou-adresse_ip

source: Specifies the fully-qualified hostname of the server.
fr: Définir le nom complet du serveur.

source: ServerRoot directory
fr: ServerRoot répertoire

source: Specifies the directory where the server configuration files can be found.
fr: Définir le répertoire où les fichiers de configuration du serveur sont stockés.

source: Specifies what information is included in the Server header of HTTP responses.
fr: Indiquer quelles informations sont disponibles dans l'entête des réponses du serveur HTTP.

source: SetEnv variable value
fr: SetEnv variable valeur

source: Set the specified environment variable to be passed to child processes.
fr: Fixer les varaibles d'environnement à passer aux processus fils.

source: Listens on the specified address and port for encrypted connections.
fr: Écouter à l'adresse et au port indiqués pour les connexions sécurisées.

source: Listens on the specified port for encrypted connections.
fr: Écouter sur le port indiqué pour les connexions sécurisées.

source: SystemGroup group-name [group-name ...]
fr: SystemGroup groupe [groupe ...]

source: Specifies the group(s) to use for System class authentication.
fr: Définir le(s) groupe(s) à utiliser pour les identifications système.

source: TempDir directory
fr: TempDir répertoire

source: Specifies the directory where temporary files are stored.
fr: Définir le répertoire où les fichiers temporaires sont stockés.

source: Timeout seconds
fr: Timeout secondes

source: Specifies the HTTP request timeout in seconds.
fr: Définir le timeout des requêtes HTTP (en secondes).

source: User user-name
fr: User utilisateur

source: Specifies the user name or ID that is used when running external programs.
fr: Définir le nom ou l'identifiant de l'utilisateur utilisé lors du lancement de programmes externes.

source: I<classes.conf(5)>, I<cupsd(8)>, I<mime.convs(5)>, I<mime.types(5)>, I<printers.conf(5)>, I<subscriptions.conf(5)>,
fr: B<classes.conf>(5), B<cupsd>(8), B<mime.convs>(5), B<mime.types>(5), B<printers.conf>(5), B<subscriptions.conf>(5),

source: 31 July 2006
fr: 31 juillet 2006

source: snmp.conf - snmp configuration file for cups
fr: snmp.conf - Fichier de configuration SNMP pour CUPS

source: The I<snmp.conf> file configures the CUPS SNMP printer discovery backend and is normally located in the I</etc/cups> directory. Each line in the file can be a configuration directive, a blank line, or a comment. Comment lines start with the # character.
fr: Le fichier I<snmp.conf> configure le service SNMP de découverte des imprimantes de CUPS et se trouve normalement dans le répertoire I</etc/cups>. Chaque ligne du fichier est une directive de configuration, une ligne vide ou un commentaire. Les commentaires commencent par le symbole #.

source: The SNMP backend uses the SNMPv1 protocol to discover network printers, collecting information from the Host MIB along with intelligent port probes to determine the correct device URI and make and model for each printer. Future versions of CUPS will likely support the new Port Monitor MIB as well.
fr: La gestion du SNMP utilise le protocol SNMPv1 pour découvrir les imprimantes réseau, récupérer les information à partir de la MIB de l'hôte en plus de sondes de ports pour déterminer l'URI correcte du périphérique, la marque et le modèle pour chacune des imprimantes. Les versions futures de CUPS géreront probablement également la nouvelle MIB « Port Monitor ».

source: The following directives are understood by the SNMP backend. Consult the on-line help for detailed descriptions:
fr: Les directives suivantes sont comprises par le service SNMP. Veuillez vous reporter à l'aide en ligne pour une description plus détaillée.

source: Address @IF(I<name>)
fr: Address @IF(I<nom>)

source: Address I<address>
fr: Address I<adresse>

source: Sends SNMP broadcast queries to the specified address(es). The default address is "@LOCAL" which broadcasts to all LAN interfaces.
fr: Envoyer les reqête SNMP de broadcast à (aux) adresse(s) indiquée(s). Par défaut, l'adresse est « @LOCAL », ce qui signifie que les requêtes sont envoyées sur les interfaces LAN.

source: Community I<name>
fr: Community I<nom>

source: Specifies a SNMP community to query. The default community is "public".
fr: Spécifier la communauté SNMP à interroger. La communauté par défaut est « public ».

source: Sets the debug logging level to I<N>; 0 disables debug logging, 1 enables basic logging, 2 displays SNMP values, and 3 displays raw hex data.
fr: Fixer le niveau de débogage enregistré dans les journaux à I<N> ; 0 désative l'enregistrement des informations pour le débogage, 1 active un enregistrement basique, 2 affiche les valeurs SNMP et 3 affiche les données brutes hexadécimales.

source: Specifies whether the addresses of printers should be converted to hostnames or left as numeric IP addresses. The default is "off".
fr: Définir si les adresses des imprimantes doivent être convertie en nom d'hôtes ou doivent être laissées en adresses IP numérique. La valeur par défaut est « off ».

source: MaxRunTime I<seconds>
fr: MaxRunTime I<secondes>

source: Specifies the maximum number of seconds that the SNMP backend will scan the network for printers.
fr: Spécifier le nombre maximal de secondes entre les requêtes du dorsal SNMP pour la découverte des imprimantes réseau.

source: 12 July 2006
fr: 12 juillet 2006

source: mailto.conf - configuration file for cups email notifier
fr: mailto.conf - Fichier de configuration pour les notifications par courier électronique de CUPS

source: The I<mailto.conf> file defines the local mail server and email notification preferences for CUPS.
fr: Le fichier I<mailto.conf> configure le serveur de courriers et les notifications par courrier électronique pour CUPS.

source: Cc I<cc-address@domain.com>
fr: Cc I<adresse_copie@domaine.com>
