Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: 20 March 2006
fr: 20 mars 2006

source: NAME
fr: NOM

source: cancel - cancel jobs
fr: cancel - Annuler des travaux d'impression.

source: B<cancel> [ -E ] [ -U I<username> ] [ -a ] [ -h I<hostname[:port]> ] [ -u I<username> ] [ I<id> ] [ I<destination> ] [ I<destination-id> ]
fr: B<cancel> [ -E ] [ -U I<utilisateur> ] [ -a ] [ -h I<serveur[:port]> ] [ -u I<utilisateur> ] [ I<id> ] [ I<destination> ] [ I<id_destination> ]

source: I<cancel> cancels existing print jobs. The I<-a> option will remove all jobs from the specified destination.
fr: B<cancel> annule un travail d'impression. L'option B<-a> supprime tous les travaux d'impression d'une destination.

source: The following options are recognized by I<cancel>:
fr: Les options suivantes sont reconnues par B<cancel> :

source: -E
fr: B<-E>

source: Forces encryption when connecting to the server.
fr: Forcer le chiffrement lors de la connexion au serveur.

source: -U username
fr: B<-U> I<utilisateur>

source: Specifies the username to use when connecting to the server.
fr: Spécifier l'utilisateur à utiliser pour les connexions au serveur.

source: -a
fr: B<-a>

source: Cancel all jobs on the named destination, or all jobs on all destinations if none is provided.
fr: Annuler tous les travaux sur la destination donnée, ou tous les travaux sur toutes les destinations si aucune destination n'est fournie.

source: -h hostname[:port]
fr: B<-h> I<serveur[:port]>

source: Chooses an alternate server.
fr: Utiliser un autre serveur.

source: -u username
fr: B<-u> I<utilisateur>

source: Cancels jobs owned by I<username>.
fr: Annuler les travaux d'impression de l'I<utilisateur>.

source: COMPATIBILITY
fr: COMPATIBILITÉ

source: Unlike the System V printing system, CUPS allows printer names to contain any printable character except SPACE, TAB, "/", or "#". Also, printer and class names are I<not> case-sensitive.
fr: Contrairement au système d'impression System V, les imprimantes CUPS peuvent contenir n'importe quel caractère imprimable sauf ESPACE, TABULATION, « / » ou « # ». De même, les noms d'imprimantes et de classes ne sont I<pas> sensibles à la casse.

source: Administrators wishing to prevent unauthorized cancellation of jobs via the I<-u> option should require authentication for Cancel-Jobs operations in I<cupsd.conf(5)>.
fr: Les administrateurs qui souhaitent empêcher des annulation non autorisée de travaux à l'aide de l'option B<-u> devraient forcer l'identification pour les opérations dans le fichier B<cupsd.conf>(5).

source: SEE ALSO
fr: VOIR AUSSI

source: I<lp(1)>, I<lpmove(8)>, I<lpstat(1)>,
fr: B<lp>(1), B<lpmove>(8), B<lpstat>(1),

source: 11 February 2006
fr: 11 février 2006

source: cups-config - get cups api, compiler, directory, and link information.
fr: cups-config - Obtenir les informations sur l'API, les répertoires, la compilation et l'édition des liens pour CUPS.

source: B<cups-config> [ I<--image> ] [ I<--static> ] --libs
fr: B<cups-config> [ --image ] [ --static ] --libs

source: B<cups-config> is the CUPS program configuration utility. It should be used by application developers to determine the necessary command-line options for the compiler and linker, as well as determining installation directories for filters, configuration files, and drivers.
fr: B<cups-config> est l'utilitaire de configuration pour les programmes CUPS. Il devrait être utilisé par les développeurs d'application pour déterminer les options en ligne de commande pour le compilateur ou l'éditeur de liens, comme pour déterminer les répertoires des filtres, fichiers de configurations et pilotes.

source: --api-version
fr: B<--api-version>

source: Displays the current API version (major.minor).
fr: Afficher la version d'API actuelle (majeur.mineur).

source: --cflags
fr: B<--cflags>

source: Displays the necessary compiler options.
fr: Afficher les options de compilations nécessaires.

source: --datadir
fr: B<--datadir>

source: Displays the default CUPS data directory.
fr: Afficher le répertoire de données par défaut de CUPS.

source: --help
fr: B<--help>

source: Displays the program usage message.
fr: Afficher un message d'aide.

source: --image
fr: B<--image>

source: When used with I<--libs>, adds the CUPS imaging library to the list or displayed libraries.
fr: Lorsqu'elle est utilisée avec B<--libs>, cette option ajoute la bibliothèque de gestion des images CUPS des bibliothèques affichées.

source: --ldflags
fr: B<--ldflags>

source: Displays the necessary linker options.
fr: Afficher les options nécessaires pour l'édition des liens.

source: --libs
fr: B<--libs>

source: Displays the necessary librarys to link to.
fr: Afficher les bibliothèques nécessaires pour l'édition des liens.

source: --serverbin
fr: B<--serverbin>

source: Displays the default CUPS binary directory, where filters and backends are stored.
fr: Afficher le répertoires par défaut des binaires, où se trouvent les filtres et dorsaux.

source: --serverroot
fr: B<--serverroot>

source: Displays the default CUPS configuration file directory.
fr: Afficher le répertoire de configuration par défaut d eCUPS.

source: --static
fr: B<--static>

source: When used with I<--libs>, shows the static libraries instead of the default (shared) libraries.
fr: Lorsqu'elle est utilisée avec B<--libs>, les bibliothèques statiques seront affichées au lieu des bibliothèques partagées qui sont affichées par défaut.

source: --version
fr: B<--version>

source: Displays the full version number of the CUPS installation (major.minor.patch).
fr: Afficher la version complète de l'installation CUPS (majeur.mineur.patch).

source: cupstestdsc - test conformance of postscript files
fr: cupstestppd - Tester la conformité des fichiers postscript.

source: B<cupstestdsc> [ -h ] filename.ps [ ... I<filenameN.ps> ]
fr: B<cupstestdsc> [ -h ] I<fichier.ps> [ ... I<fichierN.ps> ]

source: I<cupstestdsc> tests the conformance of PostScript files to the Adobe PostScript Language Document Structuring Conventions Specification version 3.0. The results of testing and any other output are sent to the standard output. The second form of the command reads PostScript from the standard input.
fr: I<cupstestdsc> teste la conformité de fichiers PostScript envers la spécification de format de fichier édictée par Adobe, « Adobe PostScript Language Document Structuring Conventions Specification » dans sa version 3.0. Les résultats des tests et autres sorties sont envoyés sur la sortie standard. La seconde forme de la commande lit l'entrée PostScript depuis l'entrée standard.

source: I<cupstestdsc> only validates the DSC comments in a PostScript file and does not attempt to validate the PostScript code itself. Developers must ensure that the PostScript they generate follows the rules defined by Adobe. Specifically, all pages must be independent of each other, code outside page descriptions may not affect the graphics state (current font, color, transform matrix, etc.), and device-specific commands such as setpagedevice should not be used.
fr: B<cupstestdsc> ne valide que les commentaires DSC du fichier PostScript et ne cherche pas à valider le code PostScript lui-même. Les développeurs doivent s'assurer que le PostScript qu'ils génèrent est conforme aux règles définies par Adobe. En particulier, toutes les pages doivent être indépendantes les unes des autres, le code en dehors des descriptions des pages ne doit pas affecter l'état des graphiques (police, couleur, matrices de transformations en cours, etc.) et les commandes spécifiques à certains périphériques ne doivent pas être utilisées.

source: cupstestppd - test conformance of ppd files
fr: cupstestppd - Tester la conformité des fichiers PPD.

source: I<cupstestppd> tests the conformance of PPD files to the Adobe PostScript Printer Description file format specification version 4.3. It can also be used to list the supported options and available fonts in a PPD file. The results of testing and any other output are sent to the standard output.
fr: B<cupstestppd> teste la conformité des fichiers PPD envers la spécification de format de fichier édictée par Adobe, « Adobe PostScript Printer Description » dans sa version 4.3. Cette commande peut également être utilisée pour voir la liste des options reconnues et des polices disponibles d'un fichier PPD. Toutes les sorties sont effectuées sur la sortie standard.

source: The first form of I<cupstestppd> tests one or more PPD files on the command-line. The second form tests the PPD file provided on the standard input.
fr: Le premier mode d'appel de B<cupstestppd> teste un ou plusieurs fichiers PPD fournis sur la ligne de ommande Le second mode d'appel teste le fichier PPD fourni sur l'entrée standard.

source: I<cupstestppd> supports the following options:
fr: B<cupstestppd> gère les options suivantes :

source: -q
fr: B<-q>

source: Specifies that no information should be displayed.
fr: N'afficher aucune information.

source: -r
fr: B<-r>

source: Relaxes the PPD conformance requirements so that common whitespace, control character, and formatting problems are not treated as hard errors.
fr: Réduire les exigences de conformité des PPD de telle sorte que les espaces communes, les caractères de contrôle et les problèmes de format ne soient pas traités comme des erreurs fatales.

source: -v
fr: B<-v>

source: Specifies that detailed conformance testing results should be displayed rather than the concise PASS/FAIL/ERROR status.
fr: Demander l'affichage des résultats détaillés des tests de conformité au lieu des états concis PASS/FAIL/ERROR.

source: -vv
fr: B<-vv>

source: Specifies that all information in the PPD file should be displayed in addition to the detailed conformance testing results.
fr: Afficher toutes les informations d'un fichier PPD en plus des résultats détaillés des tests de conformité.

source: The I<-q>, I<-v>, and I<-vv> options are mutually exclusive.
fr: Les options B<-q>, B<-v> et B<-vv> sont mutuellement exclusives.

source: EXIT STATUS
fr: CODE DE RETOUR

source: I<cupstestppd> returns zero on success and non-zero on error. The error codes are as follows:
fr: B<cupstestppd> renvoie 0 en cas de réussite aux tests et une valeur différente de 0 en cas d'échec. Les codes d'erreur sont les suivants :

source: Bad command-line arguments or missing PPD filename.
fr: Paramètres de la ligne de commandes incorrects ou fichier PPD non trouvé.

source: Unable to open or read PPD file.
fr: Impossible d'ouvrir ou de lire le fichier PPD.

source: The PPD file contains format errors that cannot be skipped.
fr: Le fichier PPD contient des erreurs de format ne pouvant être ignorées.

source: The PPD file does not conform to the Adobe PPD specification.
fr: Le fichier PPD n'est pas conforme à la spécification Adobe.

source: EXAMPLES
fr: EXEMPLES

source: The following command will test all PPD files under the current directory and print the names of each file that does not conform:
fr: La commande suivante teste tous les fichiers PPD du répertoire courant et affiche le nom de ceux qui ne sont pas conformes :

source: The next command tests all PPD files under the current directory and print detailed conformance testing results for the files that do not conform:
fr: La commande suivante teste tous les fichiers PPD du répertoire courant et affiche les résultats détaillés des tests de conformité pour les fichiers qui ne sont pas conformes :

source: I<lpadmin(8)>,
fr: B<lpadmin(8)>,

source: 23 March 2006
fr: 23 mars 2006

source: lp - print files
fr: lp - Imprimer des fichiers.

source: B<lp> [ -E ] [ -U I<username> ] [ -c ] [ -d I<destination[/instance]> ] [ -h I<hostname[:port]> ] [ -m ] [ -n I<num-copies> ] [ -o I<option[=value]> ] [ -q I<priority> ] [ -s ] [ -t I<title> ] [ -H I<handling> ] [ -P I<page-list> ] [ -- ] [ I<file(s)> ]
fr: B<lp> [ -E ] [ -U I<utilisateur> ] [ -c ] [ -d I<destination[/instance]> ] [ -h I<hostname[:port]> ] [ -m ] [ -n I<copies> ] [ -o I<option[=valeur]> ] [ -q I<priorité> ] [ -s ] [ -t I<titre> ] [ -H I<méthode> ] [ -P I<liste_de_pages> ] [ -- ] [ I<fichier(s)> ]

source: B<lp> [ -E ] [ -U I<username> ] [ -c ] [ -h I<hostname[:port]> ] [ -i I<job-id> ] [ -n I<num-copies> ] [ -o I<option[=value]> ] [ -q I<priority> ] [ -t I<title> ] [ -H I<handling> ] [ -P I<page-list> ]
fr: B<lp> [ -E ] [ -U I<utilisateur> ] [ -c ] [ -h I<serveur[:port]> ] [ -i I<id_travail> ] [ -n I<copies> ] [ -o I<option[=valeur]> ] [ -q I<priorité> ] [ -t I<titre> ] [ -H I<méthode> ] [ -P I<liste_de_pages> ]

source: I<lp> submits files for printing or alters a pending job. Use a filename of "-" to force printing from the standard input.
fr: B<lp> demande l'impression d'un fichier ou modifie un travail d'impression en attente. Utiliser « - » comme fichier pour forcer l'impression à partir de l'entrée standard.

source: The following options are recognized by I<lp>:
fr: Les options suivantes sont reconnues par B<lp> :

source: Marks the end of options; use this to print a file whose name begins with a dash (-).
fr: Marquer la fin des options ; utilisez ceci pour imprimer un fichier dont le nom commence par un tiret (« - »).

source: -c
fr: B<-c>

source: This option is provided for backwards-compatibility only. On systems that support it, this option forces the print file to be copied to the spool directory before printing. In CUPS, print files are always sent to the scheduler via IPP which has the same effect.
fr: Cette option n'est fournie que pour des raisons de compatibilité avec les précédentes versions. Sur les systèmes le permettant, elle force la copie du fichier d'impression dans le répertoire spool avant impression. Avec CUPS, les fichiers d'impression sont envoyés à l'ordonnanceur via IPP. Le résultat est le même dans les deux cas.

source: -d destination
fr: B<-d> I<destination>

source: Prints files to the named printer.
fr: Imprimer les fichiers sur l'imprimante donnée.

source: -i job-id
fr: B<-i> I<id_travail>

source: Specifies an existing job to modify.
fr: Indiquer l'identifiant du travail d'impression à modifier.

source: -m
fr: B<-m>

source: Sends an email when the job is completed.
fr: Envoyer un courrier électronique lorsque l'impression est terminée.

source: -n copies
fr: B<-n> I<copies>

source: Sets the number of copies to print from 1 to 100.
fr: Nombre de copies à effectuer (de 1 à 100).

source: -o "name=value [name=value ...]"
fr: B<-o> "I<nom=valeur [nom=valeur ...]>"

source: Sets one or more job options.
fr: Définir une ou plusieurs options pour le travail d'impression.

source: -q priority
fr: B<-q> I<priorité>

source: Sets the job priority from 1 (lowest) to 100 (highest). The default priority is 50.
fr: Définir la priorité du travail d'impression, de 1 (minimale) à 100 (maximale). La priorité par défaut est 50.

source: -s
fr: B<-s>

source: Do not report the resulting job IDs (silent mode.)
fr: Ne pas afficher le numéro du travail (mode silencieux).

source: -t "name"
fr: B<-t> "I<nom>"

source: Sets the job name.
fr: Définir le I<nom> du travail.

source: Submits jobs as I<username>.
fr: Envoyer les travaux d'impression en tant que I<utilisateur>.

source: -H hh:mm
fr: B<-H> I<hh:mm>

source: -H hold
fr: B<-H hold>

source: -H immediate
fr: B<-H immediate>

source: -H restart
fr: B<-H restart>

source: -H resume
fr: B<-H resume>

source: Specifies when the job should be printed. A value of I<immediate> will print the file immediately, a value of I<hold> will hold the job indefinitely, and a time value (HH:MM) will hold the job until the specified time. Use a value of I<resume> with the I<-i> option to resume a held job. Use a value of I<restart> with the I<-i> option to restart a completed job.
fr: Définir quand l'impression doit être effectuée. La valeur B<immediate> effectue l'impression immédiatement, la valeur B<hold> suspend l'impression indéfiniment, une heure suspend l'impression jusqu'à l'heure donnée. Utilisez la valeur B<resume> avec l'option B<-i> pour reprendre un travail suspendu. Utilisez la valeur B<restart> avec l'option B<-i> pour relancer un travail terminé.

source: -P page-list
fr: B<-P> I<liste-de-pages>

source: Specifies which pages to print in the document. The list can contain a list of numbers and ranges (#-#) separated by commas (e.g. 1,3-5,16).
fr: Définir quelles sont les pages à imprimer. Cette liste ne peut contenir que des numéros ou des portions (#-#), séparés par des virgules (par exemple : 1,3-5,16).

source: COMMON JOB OPTIONS
fr: OPTIONS COMMUNES DES TRAVAUX

source: Aside from the printer-specific options reported by the I<lpoptions(1)> command, the following generic options are available:
fr: En plus des options spécifiques des imprimantes, indiquées par B<lpoptions>(1), les options génériques suivantes sont disponibles :

source: -o media=size
fr: B<-o> B<media>=I<taille>

source: Sets the page size to I<size>. Most printers support at least the size names "a4", "letter", and "legal".
fr: Fixer la taille du papier à I<taille>. La plupart des imprimantes gèrent au moins les tailles appelées « a4 », « letter » et « legal ».

source: -o landscape
fr: B<-o landscape>

source: -o orientation-requested=4
fr: B<-o orientation-requested>=I<4>

source: Prints the job in landscape (rotated 90 degrees).
fr: Imprimer en mode paysage (rotation de 90 degrés).

source: -o sides=one-sided
fr: B<-o sides>=B<one-sided>

source: -o sides=two-sided-long-edge
fr: B<-o sides>=B<two-sided-long-edge>

source: -o sides=two-sided-short-edge
fr: B<-o sides>=B<two-sided-short-edge>

source: Prints on one or two sides of the paper. The value "two-sided-long-edge" is normally used when printing portrait (unrotated) pages, while "two-sided-short-edge" is used for landscape pages.
fr: Imprimer sur une face ou en recto-verso. La valeur « B<two-sided-long-edge> » (double faces, côté long) est normalement utilisée pour l'impression en mode portrait (pas de rotation), et « B<two-sided-short-edge> » (double faces, petit côté) pour l'impression de pages en mode paysage.

source: -o fitplot
fr: B<-o fitplot>

source: Scales the print file to fit on the page.
fr: Mettre le fichier à l'échelle pour qu'il prenne la taille de la page.

source: -o scaling=number
fr: B<-o scaling>=I<nombre>

source: Scales image files to use up to I<number> percent of the page. Values greater than 100 cause the image file to be printed across multiple pages.
fr: Mettre les fichiers image à l'échelle de telle sorte qu'il utilise jusqu'à I<nombre> pourcents de la page. Les valeurs supérieures à 100 forceront l'impression des images sur plusieurs pages.

source: -o cpi=N
fr: B<-o cpi>=I<N>

source: Sets the number of characters per inch to use when printing a text file. The default is 10.
fr: Fixer le nombre de caractères par pouces à utiliser pour l'impression de fichiers texte. La valeur par défaut est 10.

source: -o lpi=N
fr: B<-o lpi>=I<N>

source: Sets the number of lines per inch to use when printing a text file. The default is 6.
fr: Fixer le nombre de lignes par pouces à utiliser pour l'impression de fichiers texte. La valeur par défaut est 6.

source: -o page-bottom=N
fr: B<-o page-bottom>=I<N>

source: -o page-left=N
fr: B<-o page-left>=I<N>

source: -o page-right=N
fr: B<-o page-right>=I<N>

source: -o page-top=N
fr: B<-o page-top>=I<N>

source: Sets the page margins when printing text files. The values are in points - there are 72 points to the inch.
fr: Fixer les marges des pages pour l'impression de fichiers texte. Les valeurs sont exprimées en points ; il y a 72 points par pouces.

source: Print a double-sided legal document to a printer called "foo":
fr: Imprimer en recto-verso sur du papier a4 avec l'imprimante « toto ».

source: lp -d foo -o media=legal -o sides=two-sided-long-edge filename
fr: lp -d toto -o media=a4 -o sides=two-sided-long-edge fichier

source: Print an image across 4 pages:
fr: Imprimer une image sur 4 pages :

source: lp -d bar -o scaling=200 filename
fr: lp -d titi -o scaling=200 fichier

source: Print a text file with 12 characters per inch, 8 lines per inch, and a 1 inch left margin:
fr: Imprimer un fichier texte avec 12 caractères par pouces, 8 lignes par pouces et une marge de gauche de 1 pouce :

source: lp -d bar -o cpi=12 -o lpi=8 -o page-left=72 filename
fr: lp -d titi -o cpi=12 -o lpi=8 -o page-left=72 fichier

source: The "q" option accepts a different range of values than the Solaris lp command, matching the IPP job priority values (1-100, 100 is highest priority) instead of the Solaris values (0-39, 0 is highest priority).
fr: L'option « B<-q> » accepte des valeurs différentes de celles utilisées par la commande lp de Solaris (qui utilise les valeurs de 0 à 39, 0 étant la priorité la plus élevée), correspondant aux priorités des travaux IPP (de 1 à 100, 100 étant la priorité la plus élevée).

source: I<cancel(1)>, I<lpmove(8)>, I<lpoptions(1)>, I<lpstat(1)>,
fr: B<cancel(1)>, B<lpmove(8)>, B<lpoptions(1)>, B<lpstat(1)>,

source: lpoptions - display or set printer options and defaults
fr: lpoptions - Afficher et définir les options et paramètres par défaut d'une imprimante.

source: B<lpoptions> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] -d I<destination[/instance]> [ -o I<option[=value]> ] ... [ -o I<option[=value]> ]
fr: B<lpoptions> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] -d I<destination[/instance]> [ -o I<option[=valeur]> ] ... [ -o I<option[=valeur]> ]

source: B<lpoptions> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] [ -p I<destination[/instance]> ] -l
fr: B<lpoptions> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -p I<destination[/instance]> ] -l

source: B<lpoptions> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] [ -o I<option[=value]> ] ... [ -o I<option[=value]> ] [ -p I<destination[/instance]> ] -r I<option>
fr: B<lpoptions> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -o I<option[=value]> ] ... [ -o I<option[=valeur]> ] [ -p I<destination[/instance]> ] -r I<option>

source: B<lpoptions> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] -x I<destination[/instance]>
fr: B<lpoptions> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] -x I<destination[/instance]>

source: I<lpoptions> displays or sets printer options and defaults. I<lpoptions> shows the default printer options when run with no arguments. Other options include:
fr: I<lpoptions> affiche et définit les options et valeurs par défaut d'une imprimante. Lorsqu'il est lancé sans arguments, B<lpoptions> affiche les options. Les otpions pouvant être fournis sont :

source: Enables encryption when communicating with the CUPS server.
fr: Activer le chiffrement pour la communication avec le serveur CUPS.

source: Uses an alternate username.
fr: Utilise un autre utilisateur.

source: -d destination[/instance]
fr: B<-d> I<destination[/instance]>

source: Sets the default printer to I<destination>. If I<instance> is supplied then that particular instance is used. This option overrides the system default printer for the current user.
fr: Définir I<destination> comme imprimante par défaut. Il est également possible de fournir une I<instance>. Cette option redéfinit l'imprimante par défaut de l'utilisateur en cours.

source: -h server[:port]
fr: B<-h> I<serveur[:port]>

source: Uses an alternate server.
fr: Utiliser un autre serveur.

source: -l
fr: B<-l>

source: Lists the printer specific options and their current settings.
fr: Affiche les options spécifiques d'une imprimante et leur valeur.

source: -o option[=value]
fr: B<-o> I<option[=valeur]>

source: Specifies a new option for the named destination.
fr: Définir une nouvelle option pour la destination donnée.

source: -p destination[/instance]
fr: B<-p> I<destination[/instance]>
