Repository: bigon/manpages-fr-extra
Catalog: cupsys/po4a/po/*.po
Languages: fr

source: Sets the destination and instance, if specified, for any options that follow. If the named instance does not exist then it is created.
fr: Définir la destination et l'instance, si elle est indiquée. Si l'instance n'existe pas, celle-ci est créée.

source: -r option
fr: B<-r> I<option>

source: Removes the specified option for the named destination.
fr: Supprimer une option de la destination fournie en paramètre.

source: -x destination[/instance]
fr: B<-x> I<destination[/instance]>

source: Removes the options for the named destination and instance, if specified. If the named instance does not exist then this does nothing.
fr: Supprimer toutes les options de la destination, et de l'instance si elle est indiquée, fournie en paramètre. Si l'instance n'existe pas, la commande n'a pas d'effet.

source: If no options are specified using the I<-o> option, then the current options for the named printer are reported on the standard output.
fr: Si aucune option n'est fournie avec l'option I<-o>, les options actuelles de l'imprimante fournie en paramètre sont affichées sur la sortie standard.

source: Options set with the I<lpoptions> command are used by the I<lp(1)> and I<lpr(1)> commands when submitting jobs.
fr: Les options définies par la commande B<lpoptions> sont utilisées par les commandes B<lp>(1) et B<lpr>(1) lors de l'envoi de travaux d'impression.

source: ROOT ACCOUNT OPTIONS
fr: OPTION DU COMPTE ROOT

source: When run by the root user, I<lpoptions> gets and sets default options and instances for I<all users> in the /etc/cups/lpoptions file.
fr: Lorsque la commande B<lpoptions> est lancée par l'utilisateur root, les options sont lues et sauvegardées pour I<tous les utilisateurs> dans le fichier /etc/cups/lpoptions.

source: The I<lpoptions> command is unique to CUPS.
fr: La commande B<lpoptions> est spécifique à CUPS.

source: FILES
fr: FICHIERS

source: ~/.cups/lpoptions - user defaults and instances created by non-root users.
fr: ~/.cups/lpoptions - Fichier des valeurs par défaut et instance de l'utilisateur.

source: /etc/cups/lpoptions - system-wide defaults and instances created by the root user.
fr: /etc/cups/lpoptions - Fichier global des instance et valeurs par défaut, créé par l'utilisateur root.

source: I<cancel(1)>, I<lp(1)>, I<lpr(1)>,
fr: B<cancel(1)>, B<lp(1)>, B<lpr(1)>,

source: lppasswd - add, change, or delete digest passwords.
fr: lppasswd - Ajouter, modifier ou supprimer des mots de passe.

source: B<lppasswd> [ I<username> ]
fr: B<lppasswd> [ I<utilisateur> ]

source: B<lppasswd> -a [ -g I<groupname> ] I<username>
fr: B<lppasswd> -a [ -g I<groupe> ] I<utilisateur>

source: B<lppasswd> -x I<username>
fr: B<lppasswd> -x I<utilisateur>

source: I<lppasswd> adds, changes, or deletes passwords in the CUPS digest password file, I<passwd.md5>. When run by a normal user, I<lppasswd> will prompt for the old and new passwords. When run by the super-user, I<lppasswd> can add new accounts (I<-a username>), change existing accounts (I<username>), or delete accounts (I<-x username>) in the digest password file. Digest usernames do not have to match local UNIX usernames.
fr: B<lppasswd> ajoute, modifie ou supprime des mots de passe du fichier CUPS de hachés de mots de passe, I<passwd.md5>. Lorsque ce programme est lancé par un utlisateur non privilégié, B<lppasswd> demande l'ancien et le nouveau mot de passe. Lorsque ce programme est lancé par un superutilisateur, il peut créer de nouveaux comptes utilisateurs (B<-a> I<utilisateur>), modifier des comptes existants (I<utilisateur>) ou supprimer des comptes (B<-x> I<utilisateur>). Les noms d'utilisateurs ne doivent pas forcément correspondre à des noms d'utilisateurs UNIX.

source: I<lppasswd> supports the following options:
fr: B<lppasswd> gère les options suivantes :

source: -g groupname
fr: B<-g> I<groupe>

source: Specifies a group other than the default system group.
fr: Définir un groupe autre que le groupe système par défaut.

source: SECURITY ISSUES
fr: PROBLÈMES DE SÉCURITÉ

source: The I<lppasswd> command is installed setuid to root. While every attempt has been made to make it secure against exploits that could grant super-user privileges to unprivileged users, paranoid system administrators may wish to disable or change the ownership of the program to an unprivileged account. (So Debian installs I<lppasswd> command with setuid to lp)
fr: La commande B<lppasswd> est installée avec le bit setuid activé. Toutes les précautions ont été prises pour empêcher les failles permettant l'accès aux privilèges du super-utilisateur par un utilisateur non privilégié. Cependant, certains administrateurs systèmes paranoïaques peuvent vouloir désactiver ce programme ou en modifier le propriétaire en un utilisateur non privilégié (c'est la raison pour laquelle le propriétaire de B<lppasswd> sur les systèmes Debian est lp).

source: I<lp(1)>, I<lpr(1)>,
fr: B<lp(1)>, B<lpr(1)>,

source: lpq - show printer queue status
fr: lpq - Afficher l'état d'une file d'attente d'impression.

source: B<lpq> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] [ -P I<destination[/instance]> ] [ -a ] [ -l ] [ I<+interval> ]
fr: B<lpq> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -P I<destination[/instance]> ] [ -a ] [ -l ] [ I<+intervalle> ]

source: I<lpq> shows the current print queue status on the named printer. Jobs queued on the default destination will be shown if no printer or class is specified on the command-line.
fr: B<lpq> affiche l'état actuel de la file d'attente d'une imprimante donnée. Si aucune imprimante ou classe d'imprimante n'est donnée dans la ligne de commande, les travaux en attente sur la destination par défaut seront affichés.

source: I<lpq> supports the following options:
fr: B<lpq> gère les options suivantes :

source: -P destination[/instance]
fr: B<-P> I<destination[/instance]>

source: Specifies an alternate printer or class name.
fr: Utiliser l'imprimante ou classe d'imprimante donnée.

source: Specifies an alternate username.
fr: Utiliser l'I<utilisateur> donné.

source: Reports jobs on all printers.
fr: Afficher les travaux de toutes les imprimantes.

source: Specifies an alternate server.
fr: Utiliser le serveur donné.

source: Requests a more verbose (long) reporting format.
fr: Demander un format de rapport plus bavard.

source: I<cancel(1)>, I<lp(1)>, I<lpr(1)>, I<lprm(1)>, I<lpstat(1)>,
fr: B<cancel>(1), B<lp>(1), B<lpr>(1), B<lprm>(1), B<lpstat>(1),

source: 12 February 2006
fr: 12 février 2006

source: lpr - print files
fr: lpr - Imprimer des fichiers.

source: B<lpr> [ -E ] [ -H I<server[:port]> ] [ -U I<username> ] [ -P I<destination[/instance]> ] [ -# I<num-copies> [ -h ] [ -l ] [ -m ] [ -o I<option[=value]> ] [ -p] [ -q ] [ -r ] [ -C/J/T I<title> ] [ I<file(s)> ]
fr: B<lpr> [ -E ] [ -H I<serveur[:port]> ] [ -U I<utilisateur> ] [ -P I<destination[/instance]> ] [ -# I<copies> [ -h ] [ -l ] [ -m ] [ -o I<option[=valeur]> ] [ -p] [ -q ] [ -r ] [ -C/J/T I<titre> ] [ I<fichier(s)> ]

source: I<lpr> submits files for printing. Files named on the command line are sent to the named printer (or the system default destination if no destination is specified). If no files are listed on the command-line, I<lpr> reads the print file from the standard input.
fr: B<lpr> demande l'impression de fichiers. Si des fichiers sont donnés dans la ligne de commande, ceux-ci sont envoyés à la destination donnée (ou la destination par défaut si aucune n'est fournie). Si aucun fichier n'est donné dans la ligne de commande, B<lpr> lit le fichier sur l'entrée standard.

source: The following options are recognized by I<lpr>:
fr: Les options suivantes sont gérées par B<lpr>\ :

source: -H server[:port]
fr: B<-H> I<serveur[:port]>

source: -C "name"
fr: B<-C> "I<nom>"

source: -J "name"
fr: B<-J> "I<nom>"

source: -T "name"
fr: B<-T> "I<nom>"

source: -# I<copies>
fr: B<-#> I<copies>

source: -h
fr: B<-h>

source: Disables banner printing. This option is equivalent to "-o job-sheets=none".
fr: Désasctiver l'impression de la bannière. Cette option est équivalente à « B<-o job-sheets=none> ».

source: Specifies that the print file is already formatted for the destination and should be sent without filtering. This option is equivalent to "-o raw".
fr: Indiquer que le fichier est déjà formaté pour la destination et qu'aucun filtre n'a besoin d'être appliqué. Cette option est équivalente à « B<-o raw> ».

source: Send an email on job completion.
fr: Envoyer un courier électronique à la fin du travail d'impression.

source: Sets a job option.
fr: Définir une option pour le travail d'impression.

source: -p
fr: B<-p>

source: Specifies that the print file should be formatted with a shaded header with the date, time, job name, and page number. This option is equivalent to "-o prettyprint" and is only useful when printing text files.
fr: Spécifier que chaque page du fichier à imprimer doit avoir un en-tête ombré contenant la date, l'heure, le nom du travail d'impression et le numéro de page. Cette option est équivalente à « -oprettyprint » et n'est utile que dans le cas de fichiers texte.

source: Hold job for printing.
fr: Suspendre l'impression d'un travail.

source: Specifies that the named print files should be deleted after printing them.
fr: Spécifier que les fichiers indiqués doivent être effacés après impression.

source: The "c", "d", "f", "g", "i", "n", "t", "v", and "w" options are not supported by CUPS and produce a warning message if used.
fr: Les options « B<-c> », « B<-d> », « B<-f> », « B<-g> », « B<-i> », « B<-n> », « B<-t> », « B<-v> » et « B<-w> » ne sont pas gérées par CUPS et donnent un message d'avertissement lorsqu'elles sont utilisées.

source: I<cancel(1)>, I<lp(1)>, I<lpq(1)>, I<lprm(1)>, I<lpstat(1)>,
fr: B<cancel>(1), B<lp>(1), B<lpq>(1), B<lprm>(1), B<lpstat>(1),

source: lprm - cancel print jobs
fr: lprm - Annuler des travaux d'impression.

source: B<lprm> [ -E ] [ -U I<username> ] [ -h I<server[:port]> ] [ -P I<destination[/instance]> ] [ - ] [ I<job ID(s)> ]
fr: B<lprm> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -P I<destination[/instance]> ] [ - ] [ I<identifiant(s) des travaux d'impression> ]

source: I<lprm> cancels print jobs that have been queued for printing. If no arguments are supplied, the current job on the default destination is cancelled. You can specify one or more job ID numbers to cancel those jobs or use the I<-> option to cancel all jobs.
fr: B<lprm> annule des travaux d'impression en attente. Si aucun paramètre n'est fourni, c'est le travail en cours sur la destination par défaut qui est annulé. Il est possible de fournir un ou plusieurs identifiants de travaux d'impression à annuler ou d'utiliser l'option B<-> pour annuler tous les travaux.

source: The I<lprm> command supports the following options:
fr: B<lprm> gère les options suivantes :

source: Specifies the destination printer or class.
fr: Spécifier l'imprimante, ou la classe d'imprimante, de destination.

source: Specifies and alternate server.
fr: Définir un autre serveur.

source: The CUPS version of I<lprm> is compatible with the standard Berkeley I<lprm> command.
fr: La version CUPS de B<lprm> est compatible avec la version standard Berkeley.

source: I<cancel(1)>, I<lp(1)>, I<lpq(1)>, I<lpr(1)>, I<lpstat(1)>,
fr: B<cancel>(1), B<lp>(1), B<lpq>(1), B<lpr>(1), B<lpstat>(1),

source: lpstat - print cups status information
fr: lpstat - Afficher l'état de CUPS.

source: B<lpstat> [ -E ] [ -U I<username> ] [ -h I<hostname[:port]> ] [ -l ] [ -W I<which-jobs> ] [ -a [ I<destination(s)> ] ] [ -c [ I<class(es)> ] ] [ -d ] [ -o [ I<destination(s)> ] ] [ -p [ I<printer(s)> ] ] [ -r ] [ -R ] [ -s ] [ -t ] [ -u [ I<user(s)> ] ] [ -v [ I<printer(s)> ] ]
fr: B<lpstat> [ -E ] [ -U I<utilisateur> ] [ -h I<serveur[:port]> ] [ -l ] [ -W I<travaux> ] [ -a [ I<destination(s)> ] ] [ -c [ I<class(es)> ] ] [ -d ] [ -o [ I<destination(s)> ] ] [ -p [ I<imprimante(s)> ] ] [ -r ] [ -R ] [ -s ] [ -t ] [ -u [ I<utilisateur(s)> ] ] [ -v [ I<imprimante(s)> ] ]

source: I<lpstat> displays status information about the current classes, jobs, and printers. When run with no arguments, I<lpstat> will list jobs queued by the current user.
fr: B<lpstat> affiche l'état des classes, travaux et imprimantes. Quand B<lpstat> est lancé sans arguments, la liste des travaux en attente de l'utilisateur est affichée.

source: The I<lpstat> command supports the following options:
fr: B<lpstat> gère les options suivantes :

source: -R
fr: B<-R>

source: Shows the ranking of print jobs.
fr: Afficher le rang des travaux d'impression.

source: -W which-jobs
fr: B<-W> I<travaux>

source: Specifies which jobs to show, I<completed> or I<not-completed> (the default). This option I<must> appear before the I<-o> option and/or any printer names, otherwise the default (not-completed) value will be used in the request to the scheduler.
fr: Indiquer quels travaux afficher : B<completed> (les travaux terminés) ou B<not-completed> (les travaux non terminés, par défaut). Cette option I<doit> être précisée avant l'option B<-o> et/ou des noms d'imprimantes, sinon la valeur par défaut (« B<not-completed> ») sera utilisée pour la requête à l'ordonnanceur.

source: -a [printer(s)]
fr: B<-a> [I<imprimante(s)>]

source: Shows the accepting state of printer queues. If no printers are specified then all printers are listed.
fr: Afficher si les files d'attente des imprimantes acceptent les travaux d'impression. Si aucune imprimante n'est fournie dans la ligne de commande, toutes les imprimantes sont affichées.

source: -c [class(es)]
fr: B<-c> [I<classe(s)>]

source: Shows the printer classes and the printers that belong to them. If no classes are specified then all classes are listed.
fr: Afficher la classe d'imprimantes et ses imprimantes associées. Si aucune classe n'est fournie dans la ligne de commande, toutes les classes sont affichées.

source: -d
fr: B<-d>

source: Shows the current default destination.
fr: Affiche la destination par défaut.

source: Shows a long listing of printers, classes, or jobs.
fr: Afficher une liste détaillée des imprimantes, classes et travaux d'impression.

source: -o [destination(s)]
fr: B<-o> [I<destination(s)>]

source: Shows the jobs queue on the specified destinations. If no destinations are specified all jobs are shown.
fr: Afficher la file d'attente des travaux des destinations spécifiées. Si aucune destination n'est fournie dans la ligne de commande, tous les travaux sont affichés.

source: -p [printer(s)]
fr: B<-p> [I<imprimante(s)>]

source: Shows the printers and whether or not they are enabled for printing. If no printers are specified then all printers are listed.
fr: Afficher les imprimantes et indiquer si elles sont prêtes ou non à l'impression. Si aucune imprimante n'est fournie dans la ligne de commande, toutes les imprimantes sont listées.

source: Shows whether the CUPS server is running.
fr: Afficher si le serveur CUPS est actif.

source: Shows a status summary, including the default destination, a list of classes and their member printers, and a list of printers and their associated devices. This is equivalent to using the "-d", "-c", and "-v" options.
fr: Afficher un résumé de l'état, comprenant la destination par défaut, la liste des classes et leurs imprimantes associées, la liste des imprimantes et leur périphérique. Ceci est équivalent à utiliser les options « B<-d> », « B<-c> » et « B<-p> ».

source: -t
fr: B<-t>

source: Shows all status information. This is equivalent to using the "-r", "-d", "-c", "-v", "-a", "-p", and "-o" options.
fr: Affiche toutes les informations. Ceci peut être effectué en utilisant les options « B<-r> », « B<-d> », « B<-c> », « B<-d> », « B<-v> », « B<-a> », « B<-p> » et « B<-o> ».

source: -u [user(s)]
fr: B<-u> [I<utilisateur(s)>]

source: Shows a list of print jobs queued by the specified users. If no users are specified, lists the jobs queued by the current user.
fr: Afficher les travaux d'impression en attente pour un utilisateur. Si aucun utilisateur n'est fourni dans la ligne de commande, afficher les travaux de l'utilisateur qui lance la commande.

source: -v [printer(s)]
fr: B<-v> [I<imprimante(s)>]

source: Shows the printers and what device they are attached to. If no printers are specified then all printers are listed.
fr: Afficher les imprimantes et à quel matériel elles sont rattachées. Si aucune imprimante n'est fournie sur la ligne de commande, toutes les imprimantes sont affichées.

source: Unlike the System V printing system, CUPS allows printer names to contain any printable character except SPACE, TAB, "/", and "#". Also, printer and class names are I<not> case-sensitive.
fr: Contrairement au système d'impression System V, CUPS permet des noms d'imprimantes contenant tout caractère imprimable sauf ESPACE, TABULATION, « / » et « # ». De plus, les noms d'imprimante et de classe d'imprimante ne sont pas sensibles à la casse.

source: The "-h", "-E", "-U", and "-W" options are unique to CUPS.
fr: Les options « B<-h> », « B<-E> », « B<-U> » et « B<-W> » sont spécifiques à CUPS.

source: The Solaris "-f", "-P", and "-S" options are silently ignored.
fr: Les options « B<-f> », « B<-P> » et « B<-S> » de Solaris sont ignorées.

source: I<cancel(1)>, I<lp(1)>,
fr: B<cancel>(1), B<lp>(1),

source: classes.conf - class configuration file for cups
fr: classes.conf - Fichier de configuration des classes de CUPS.

source: The I<classes.conf> file defines the local printer classes that are available. It is normally located in the I</etc/cups> directory and is generated automatically by the I<cupsd(8)> program when printer classes are added or deleted.
fr: Le fichier I<classes.conf> définit les classes d'imprimantes disponibles. Il est habituellement situé dans le répertoire I</etc/cups> et est généré automatiquement par le programme B<cupsd>(8) lorsque des classes d'imprimantes sont créées ou supprimées.

source: Each line in the file can be a configuration directive, a blank line, or a comment. Comment lines start with the # character.
fr: Chaque ligne du fichier est une directive de configuration, une ligne vide ou un commentaire. Les commentaires commencent par le symbole #.

source: E<lt>Class nameE<gt> ... E<lt>/ClassE<gt>
fr: E<lt>Class nomE<gt> ... E<lt>/ClassE<gt>

source: Defines a specific printer class.
fr: Définir une classe d'imprimantes.

source: E<lt>DefaultClass nameE<gt> ... E<lt>/ClassE<gt>
fr: E<lt>DefaultClass nomE<gt> ... E<lt>/ClassE<gt>

source: Defines a default printer class.
fr: Définir une classe d'imprimantes par défaut.

source: Specifies whether the printer is accepting new jobs.
fr: Définir si l'imprimante accepte de nouveaux travaux d'impression.

source: AllowUser [ user @group ... ]
fr: AllowUser [ utilisateur @groupe ... ]

source: Allows specific users and groups to print to the printer.
fr: Permettre à certains utilisateurs ou groupes d'imprimer sur l'imprimante.

source: DenyUser [ user @group ... ]
fr: DenyUser [ utilisateur @groupe ... ]

source: Prevents specific users and groups from printing to the printer.
fr: Empêcher certains utilisateurs ou groupes d'imprimer sur l'imprimante.

source: Specifies the error policy for the printer.
fr: Définir la politique à appliquer en cas d'erreur pour l'imprimante.

source: Info text
fr: Info texte

source: Specifies human-readable text describing the printer.
fr: Définir des informations à destination des utilisateurs pour décrir l'imprimante.

source: Specifies the banner pages to use for the printer.
fr: Définir les pages de banière à utiliser pour l'imprimante.

source: KLimit number
fr: KLimit nombre

source: Specifies the job-k-limit value for the printer.
fr: Définir la valeur job-k-limit pour l'imprimante.

source: Location text
fr: Location texte

source: Specifies human-readable text describing the location of the printer.
fr: Définir des informations à destination des utilisateurs concernant la localisation physique de l'imprimante.

source: OpPolicy name
fr: OpPolicy nom

source: Specifies the operation policy for the printer.
fr: Indiquer la politiques des opérations pour l'imprimante.

source: PageLimit number
fr: PageLimit nombre

source: Specifies the job-page-limit value for the printer.
fr: Définir la valeur job-page-limit pour l'imprimante.

source: Specifies a printer that is a member of the printer class.
fr: Indiquer une imprimante qui est membre de la classe d'imprimantes.

source: QuotaPeriod seconds
fr: QuotaPeriod secondes

source: Specifies the job-quota-period value for the printer.
fr: Définir la valeur job-quota-period pour l'imprimante.

source: Specifies whether the printer is shared.
fr: Définir si l'imprimante est partagée.

source: Specifies the initial state of the printer (Idle or Stopped)
fr: Définir l'état initial de l'imprimante (Idle ou Stopped).

source: StateMessage text
fr: StateMessage texte

source: Specifies the message associated with the state.
fr: Définir le message associé à l'état.

source: StateTime seconds
fr: StateTime secondes

source: Specifies the date/time associated with the state.
fr: Indiquer la date/l'heure associée à l'état.

source: I<cupsd(8)>, I<cupsd.conf(5)>, I<mime.convs(5)>, I<mime.types(5)>, I<printers.conf(5)>,
fr: B<cupsd>(8), B<cupsd.conf>(5), B<mime.convs>(5), B<mime.types>(5), B<printers.conf>(5),

source: 25 February 2006
fr: 25 février 2006

source: client.conf - client configuration file for cups
fr: client.conf - Fichier de configuration de CUPS.

source: The I<client.conf> file configures the CUPS client and is normally located in the I</etc/cups> or I<~/.cups> directory. Each line in the file can be a configuration directive, a blank line, or a comment. Comment lines start with the # character.
fr: Le fichier I<client.conf> configure le client CUPS et est normalement situé dans le répertoire I</etc/cups> ou I<~/.cups>. Chaque ligne du fichier est une directive de configuration, une ligne vide ou un commentaire. Les commentaires commencent par le symbole #.

source: The following directives are understood by the client. Consult the on-line help for detailed descriptions:
fr: Les directives suivantes sont comprises par le client. Veuillez vous reporter à l'aide en ligne pour une description plus détaillée.

source: Specifies the level of encryption that is required for a particular location.
fr: Définir le niveau de chiffrement nécessaire pour un emplacement donné.

source: ServerName hostname-or-ip-address[:port]
fr: ServerName serveur-ou-adresse_ip[:port]

source: ServerName /domain/socket
fr: ServerName /domaine/socket

source: Specifies the address and optionally the port to use when connecting to the server
fr: Définir l'adresse et éventuellement le port à utiliser pour se connecter au serveur.

source: cupsd.conf - server configuration file for cups
fr: cupsd.conf - Fichier de configuration du serveur CUPS.

source: The I<cupsd.conf> file configures the CUPS scheduler, I<cupsd(8)>. It is normally located in the I</etc/cups> directory.
fr: Le fichier I<cupsd.conf> configure l'ordonnanceur CUPS, B<cupsd>(8). Il est généralement situé dans le répertoire I</etc/cups>.

source: Each line in the file can be a configuration directive, a blank line, or a comment. Comment lines start with the # character. The configuration directives are intentionally similar to those used by the popular Apache web server software and are described below.
fr: Chaque ligne de ce fichier est soit une directive de configuration, une ligne vide, ou un commentaire. Les lignes de commentaire commencent par le caractère #. Les directives de configuration sont volontairement similaires à celles utilisées par le serveur web Apache, et sont décrites ci-dessous.
