Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/ciphers/po/*.po
Languages: fr

source: Set the TLS SNI (Server Name Indication) extension in the ClientHello message.
fr: Définir l’extension SNI (« Server Name Indication ») TLS dans le message ClientHello.

source: B<-cert certname>
fr: B<-cert> I<fichier>

source: The certificate to use, if one is requested by the server. The default is not to use a certificate.
fr: Le certificat à utiliser, s’il est demandé par le serveur. Par défaut, aucun certificat n’est utilisé.

source: B<-certform format>
fr: B<-certform> I<format>

source: The certificate format to use: DER or PEM. PEM is the default.
fr: Le format de certificat à utiliser : B<DER> ou B<PEM>. Par défaut, B<PEM> est utilisé.

source: B<-key keyfile>
fr: B<-key> I<fichier>

source: The private key to use. If not specified then the certificate file will be used.
fr: La clef privée à utiliser. En absence d’indication, le fichier de certificats sera utilisé.

source: B<-keyform format>
fr: B<-keyform> I<format>

source: The private format to use: DER or PEM. PEM is the default.
fr: Le format privé à utiliser : B<DER> ou B<PEM>. Par défaut, B<PEM> est utilisé.

source: B<-pass arg>
fr: B<-pass> I<param>

source: the private key password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source du mot de passe de la clef privée. Pour plus d'informations sur le format de I<param>, consultez la section B<PARAMÈTRES DE PHRASE SECRÈTE> d'L<B<openssl>(1)|openssl(1)>.

source: B<-verify depth>
fr: B<-verify> I<profondeur>

source: The verify depth to use. This specifies the maximum length of the server certificate chain and turns on server certificate verification. Currently the verify operation continues after errors so all the problems with a certificate chain can be seen. As a side effect the connection will never fail due to a server certificate verify failure.
fr: La profondeur de vérification à utiliser. Cela indique la taille maximale de la chaîne de certificats du serveur et active la vérification de certificat du serveur. Actuellement l'opération de vérification continue après les erreurs de façon à montrer tous les problèmes liés à la chaîne de certificats. Par conséquent, la connexion n'échouera jamais à cause d'un échec de vérification de certificat du serveur.

source: Return verification errors instead of continuing. This will typically abort the handshake with a fatal error.
fr: Renvoyer les erreurs de vérification au lieu de continuer. Cela fera typiquement échouer l’initialisation de connexion avec une erreur fatale.

source: B<-CApath directory>
fr: B<-CApath> I<répertoire>

source: The directory to use for server certificate verification. This directory must be in "hash format", see B<verify> for more information. These are also used when building the client certificate chain.
fr: Le répertoire utilisé pour la vérification de certificat du client. Ce répertoire doit être au « format de hachage », consultez B<verify> pour plus de renseignements. Il est aussi utilisé pour construire la chaîne de certificats du client.

source: B<-CAfile file>
fr: B<-CAfile> I<fichier>

source: A file containing trusted certificates to use during server authentication and to use when attempting to build the client certificate chain.
fr: Un fichier contenant des certificats de confiance utilisés pendant l’authentification du serveur et lors d’une tentative de créer la chaîne de certificats du client.

source: B<-purpose, -ignore_critical, -issuer_checks, -crl_check, -crl_check_all, -policy_check, -extended_crl, -x509_strict, -policy -check_ss_sig>
fr: B<-purpose>, B<-ignore_critical>, B<-issuer_checks>, B<-crl_check>, B<-crl_check_all>, B<-policy_check>, B<-extended_crl>, B<-x509_strict>, B<-policy>, B<-check_ss_sig>

source: Set various certificate chain valiadition option. See the L<B<verify>|verify(1)> manual page for details.
fr: Définir plusieurs options de validation de chaîne de certificats. Consultez la page de manuel L<B<verify>(1)|verify(1)> pour plus de précisions.

source: reconnects to the same server 5 times using the same session ID, this can be used as a test that session caching is working.
fr: Se reconnecter au même serveur cinq fois en utilisant le même identifiant de session. Cela peut servir de test de fonctionnement du cache de session.

source: pauses 1 second between each read and write call.
fr: Faire une pause d’une seconde entre chaque appel de lecture et écriture.

source: display the whole server certificate chain: normally only the server certificate itself is displayed.
fr: Afficher toute la chaîne de certificats du serveur : normalement, seul le certificat du serveur lui-même est affiché.

source: print session information when the program exits. This will always attempt to print out information even if the connection fails. Normally information will only be printed out once if the connection succeeds. This option is useful because the cipher in use may be renegotiated or the connection may fail because a client certificate is required or is requested only after an attempt is made to access a certain URL. Note: the output produced by this option is not always accurate because a connection might never have been established.
fr: Afficher les renseignements de session lorsque le programme est quitté. Cela essayera toujours d’afficher les renseignements même en cas d’échec de connexion. Les renseignements ne sont normalement affichés qu’une fois si la connexion réussit. Cette option est utile car l’algorithme de chiffrement en cours d’utilisation pourrait être renégocié, ou la connexion pourrait échouer parce qu’un certificat client est demandé, ou n’être demandé qu’après une tentative d’accès à une certaine URL. Remarque : la sortie produite par cette option n’est pas toujours exacte car une connexion pourrait n’avoir jamais été établie.

source: prints out the SSL session states.
fr: Afficher les états de session SSL.

source: print extensive debugging information including a hex dump of all traffic.
fr: Afficher des renseignements de débogage complets y compris l’intégralité des échanges au format hexadécimal.

source: show all protocol messages with hex dump.
fr: Montrer tous les messages de protocole avec les échanges au format hexadécimal.

source: tests non-blocking I/O
fr: Tester les entrées et sorties non bloquantes.

source: turns on non-blocking I/O
fr: Activer les entrées et sorties non bloquantes.

source: this option translated a line feed from the terminal into CR+LF as required by some servers.
fr: Cette option traduit un changement de ligne du terminal en RC+PAL (CR+LF) comme exigé par certains serveurs.

source: inhibit shutting down the connection when end of file is reached in the input.
fr: Empêcher la fermeture de connexion quand une fin de fichier est atteinte en entrée.

source: inhibit printing of session and certificate information. This implicitly turns on B<-ign_eof> as well.
fr: Empêcher l’affichage de renseignements sur la session et le certificat. Cela active aussi B<-ign_eof> implicitement.

source: shut down the connection when end of file is reached in the input. Can be used to override the implicit B<-ign_eof> after B<-quiet>.
fr: Fermer la connexion quand une fin de fichier est atteinte en entrée. Peut être utilisée pour remplacer le B<-ign_eof> implicite après B<-quiet>.

source: B<-psk_identity identity>
fr: B<-psk_identity> I<identité>

source: Use the PSK identity B<identity> when using a PSK cipher suite.
fr: Utiliser l’identité PSK I<identité> lors de l’utilisation d’un ensemble de chiffrements PSK.

source: B<-psk key>
fr: B<-psk> I<clef>

source: Use the PSK key B<key> when using a PSK cipher suite. The key is given as a hexadecimal number without leading 0x, for example -psk 1a2b3c4d.
fr: Utiliser la clef PSK I<clef> lors de l’utilisation d’un ensemble de chiffrements PSK. La clef est donnée comme un nombre hexadécimal sans être précédé par 0x, par exemple B<-psk 1a2b3c4d>.

source: these options disable the use of certain SSL or TLS protocols. By default the initial handshake uses a method which should be compatible with all servers and permit them to use SSL v3, SSL v2 or TLS as appropriate.
fr: Ces options désactivent l’utilisation de certains protocoles SSL ou TLS. Par défaut, l’initialisation de connexion utilise une méthode qui devrait être compatible avec tous les serveurs et leur permettre d’utiliser SSL v3, SSL v2 ou TLS comme approprié.

source: there are several known bug in SSL and TLS implementations. Adding this option enables various workarounds.
fr: Plusieurs bogues sont connus dans les implémentations SSL et TLS. L'ajout de cette option permet de contourner certains problèmes.

source: B<-cipher cipherlist>
fr: B<-cipher> I<listechiffrements>

source: this allows the cipher list sent by the client to be modified. Although the server determines which cipher suite is used it should take the first supported cipher in the list sent by the client. See the B<ciphers> command for more information.
fr: Cela permet à la liste de chiffrements envoyée par le client d’être modifiée. Bien que le serveur détermine l’ensemble de chiffrements qui est utilisé, il devrait prendre le premier algorithme de chiffrement pris en charge de la liste envoyée par le client. Consultez la commande B<ciphers> pour plus de renseignements.

source: use the server's cipher preferences; only used for SSLV2.
fr: Utiliser les préférences de chiffrement du serveur ; utilisée seulement pour SSLV2.

source: B<-starttls protocol>
fr: B<-starttls> I<protocole>

source: send the protocol-specific message(s) to switch to TLS for communication. B<protocol> is a keyword for the intended protocol. Currently, the only supported keywords are "smtp", "pop3", "imap", and "ftp".
fr: Envoyer le ou les messages spécifiques au protocole pour basculer vers TLS pour la communication. I<protocole> est un mot clef pour le protocole désiré. Actuellement, les seuls mots clefs pris en charge sont « smtp », « pop3 », « imap » et « ftp ».

source: print out a hex dump of any TLS extensions received from the server.
fr: Afficher les échanges au format hexadécimal de toutes les extensions TLS reçues du serveur.

source: disable RFC4507bis session ticket support.
fr: Désactiver la prise en charge des tickets de session RFC 4507 bis.

source: B<-sess_out filename>
fr: B<-sess_out> I<fichier>

source: output SSL session to B<filename>
fr: Envoyer la session SSL dans I<fichier>.

source: B<-sess_in sess.pem>
fr: B<-sess_in> I<fichier>

source: load SSL session from B<filename>. The client will attempt to resume a connection from this session.
fr: Charger la session SSL du I<fichier>. Le client essayera de reprendre une connexion depuis cette session.

source: B<-engine id>
fr: B<-engine> I<identifiant>

source: specifying an engine (by its unique B<id> string) will cause B<s_client> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.
fr: Indiquer un moteur (en utilisant son identifiant unique I<identifiant>) obligera B<s_client> à essayer d'obtenir une référence fonctionnelle pour le moteur indiqué et de l'initialiser si nécessaire. Le moteur sera ensuite utilisé par défaut pour tous les algorithmes disponibles.

source: B<-rand file(s)>
fr: B<-rand> I<fichier(s)>

source: a file or files containing random data used to seed the random number generator, or an EGD socket (see L<RAND_egd(3)|RAND_egd(3)>). Multiple files can be specified separated by a OS-dependent character. The separator is B<;> for MS-Windows, B<,> for OpenVMS, and B<:> for all others.
fr: Un ou plusieurs fichiers contenant des données aléatoires utilisées pour initialiser le générateur de nombres pseudoaléatoires, ou une socket EGD (consultez L<B<RAND_egd>(3)|RAND_egd(3)>). Plusieurs fichiers peuvent être indiqués en utilisant le séparateur du système d'exploitation : « B<;> » pour Windows, « B<,> » pour OpenVMS et « B<:> » pour tous les autres.

source: sends a certificate status request to the server (OCSP stapling). The server response (if any) is printed out.
fr: Envoyer une demande d’état de certificat au serveur (agrafage OCSP). La réponse du serveur (s’il y en a) est affichée.

source: B<-nextprotoneg protocols>
fr: B<-nextprotoneg> I<protocoles>

source: enable Next Protocol Negotiation TLS extension and provide a list of comma-separated protocol names that the client should advertise support for. The list should contain most wanted protocols first. Protocol names are printable ASCII strings, for example "http/1.1" or "spdy/3". Empty list of protocols is treated specially and will cause the client to advertise support for the TLS extension but disconnect just after reciving ServerHello with a list of server supported protocols.
fr: Activer l’extension TLS de négociation du prochain protocole (« Next Protocol Negotiation ») et fournir une liste de noms de protocoles séparés par des virgules dont le client devrait annoncer la prise en charge. La liste devrait d’abord contenir les protocoles les plus voulus. Les noms de protocole sont des chaînes ASCII affichables, par exemple « http/1.1 » ou « spdy/3 ». Une liste vide de protocoles est traitée spécialement et forcera le client à annoncer la prise en charge de l’extension TLS mais à se déconnecter juste après avoir reçu ServerHello avec une liste des protocoles serveurs pris en charge.

source: CONNECTED COMMANDS
fr: COMMANDES DE CONNEXION

source: If a connection is established with an SSL server then any data received from the server is displayed and any key presses will be sent to the server. When used interactively (which means neither B<-quiet> nor B<-ign_eof> have been given), the session will be renegotiated if the line begins with an B<R>, and if the line begins with a B<Q> or if end of file is reached, the connection will be closed down.
fr: Si une connexion est établie avec un serveur SSL, alors toutes les données reçues du serveur sont affichées et n’importe quel appui de touche sera envoyée au serveur. En utilisation interactive (ce qui signifie que ni B<-quiet> ni B<-ign_eof> n’ont été données), la session sera renégociée si la ligne commence par un B<R>, et, si la ligne commence par un B<Q> ou si la fin de fichier est atteinte, la connexion sera fermée.

source: B<s_client> can be used to debug SSL servers. To connect to an SSL HTTP server the command:
fr: B<s_client> peut être utilisée pour déboguer les serveurs SSL. Pour se connecter à un serveur HTTP SSL, la commande :

source: openssl s_client -connect servername:443
fr: openssl s_client -connect nomdeserveur:443

source: would typically be used (https uses port 443). If the connection succeeds then an HTTP command can be given such as "GET /" to retrieve a web page.
fr: serait typiquement utilisée (HTTPS utilise le port 443). Si la connexion réussit, alors une commande HTTP peut être donnée comme « GET / » pour récupérer une page web.

source: If the handshake fails then there are several possible causes, if it is nothing obvious like no client certificate then the B<-bugs>, B<-ssl2>, B<-ssl3>, B<-tls1>, B<-no_ssl2>, B<-no_ssl3>, B<-no_tls1> options can be tried in case it is a buggy server. In particular you should play with these options B<before> submitting a bug report to an OpenSSL mailing list.
fr: En cas d’échec de l’initialisation de connexion, plusieurs causes sont possibles. Si aucune raison évidente n’est détectée comme l’absence de certificat client, les options B<-bugs>, B<-ssl2>, B<-ssl3>, B<-tls1>, B<-no_ssl2>, B<-no_ssl3> et B<-no_tls1> peuvent être essayées si le serveur est bogué. En particulier, vous devriez essayer ces options B<avant> de soumettre un rapport de bogue sur une liste de diffusion d’OpenSSL.

source: A frequent problem when attempting to get client certificates working is that a web client complains it has no certificates or gives an empty list to choose from. This is normally because the server is not sending the clients certificate authority in its "acceptable CA list" when it requests a certificate. By using B<s_client> the CA list can be viewed and checked. However some servers only request client authentication after a specific URL is requested. To obtain the list in this case it is necessary to use the B<-prexit> option and send an HTTP request for an appropriate page.
fr: Un problème classique lors d’une tentative d’obtention de certificat client fonctionnel, est qu’un client web se plaint de ne pas avoir de certificat ou donne une liste vide pour le choisir. C’est généralement dû au serveur qui n’envoie pas aux clients les autorités de certification dans sa « liste d’autorités de certification acceptables » quand il demande un certificat. En utilisant B<s_client>, la liste d’autorités de certification peut être vue et vérifiée. Cependant, certains serveurs ne demandent une authentification du client qu’après une demande d’URL spécifique. Pour obtenir la liste dans ce cas, il faut utiliser l’option B<-prexit> et envoyer une requête HTTP pour une page appropriée.

source: If a certificate is specified on the command line using the B<-cert> option it will not be used unless the server specifically requests a client certificate. Therefor merely including a client certificate on the command line is no guarantee that the certificate works.
fr: Si un certificat est indiqué sur la ligne de commandes en utilisant l'option B<-cert>, il ne sera pas utilisé à moins que le serveur indiqué n’exige un certificat client. Par conséquent, la simple utilisation d'un certificat client sur la ligne de commandes ne garantit pas que le certificat fonctionne.

source: If there are problems verifying a server certificate then the B<-showcerts> option can be used to show the whole chain.
fr: En cas de problème de vérification d’un certificat de serveur, l’option B<-showcerts> peut être utilisée pour montrer toute la chaîne.

source: Since the SSLv23 client hello cannot include compression methods or extensions these will only be supported if its use is disabled, for example by using the B<-no_sslv2> option.
fr: Puisque le salut du client SSLv23 ne peut pas inclure les méthodes ou extensions de compression, elles ne seront prises en charge que si son utilisation est désactivée, par exemple en utilisant l’option B<-no_sslv2>.

source: The B<s_client> utility is a test tool and is designed to continue the handshake after any certificate verification errors. As a result it will accept any certificate chain (trusted or not) sent by the peer. None test applications should B<not> do this as it makes them vulnerable to a MITM attack. This behaviour can be changed by with the B<-verify_return_error> option: any verify errors are then returned aborting the handshake.
fr: L’utilitaire B<s_client> est un outil de test, conçu pour continuer l’initialisation de connexion après n’importe quelle erreur de vérification de certificat. Par conséquent, il acceptera n’importe quelle chaîne de certificats (de confiance ou non) envoyée par le pair. B<Aucune> application réelle ne devrait faire cela car elle serait vulnérable aux attaques d’homme au milieu. Ce comportement peut être modifié à l’aide de l’option B<-verify_return_error> : toutes les erreurs de vérification sont alors renvoyées en faisant échouer l’initialisation de connexion.

source: BUGS
fr: BOGUES

source: Because this program has a lot of options and also because some of the techniques used are rather old, the C source of s_client is rather hard to read and not a model of how things should be done. A typical SSL client program would be much simpler.
fr: Puisque ce programme a beaucoup d’options, et aussi parce que certaines des techniques utilisées sont plutôt vieilles, le code source C de B<s_client> est plutôt difficile à lire et n’est pas un exemple à suivre. Un programme client SSL typique serait beaucoup plus simple.

source: The B<-prexit> option is a bit of a hack. We should really report information whenever a session is renegotiated.
fr: L’option B<-prexit> est un peu du bidouillage. Les renseignements devraient vraiment être signalés quand une session est renégociée.

source: L<sess_id(1)|sess_id(1)>, L<s_server(1)|s_server(1)>, L<ciphers(1)|ciphers(1)>
fr: L<B<sess_id>(1)|sess_id(1)>, L<B<s_server>(1)|s_server(1)>, L<B<ciphers>(1)|ciphers(1)>

source: s_server - SSL/TLS server program
fr: s_server - programme serveur SSL ou TLS

source: The B<s_server> command implements a generic SSL/TLS server which listens for connections on a given port using SSL/TLS.
fr: La commande B<s_server> implémente un serveur SSL ou TLS générique qui attend les connexions sur un port donné en utilisant SSL ou TLS.

source: B<-accept port>
fr: B<-accept> I<port>

source: the TCP port to listen on for connections. If not specified 4433 is used.
fr: Le port TCP où attendre les connexions. Sans indication, le port 4433 est utilisé.

source: B<-context id>
fr: B<-context> I<identifiant>

source: sets the SSL context id. It can be given any string value. If this option is not present a default value will be used.
fr: Définir l’identifiant de contexte SSL. N’importe quelle valeur de chaîne peut être donnée. Si cette option est absente, une valeur par défaut sera utilisée.

source: The certificate to use, most servers cipher suites require the use of a certificate and some require a certificate with a certain public key type: for example the DSS cipher suites require a certificate containing a DSS (DSA) key. If not specified then the filename "server.pem" will be used.
fr: Le certificat à utiliser, la plupart des ensembles de chiffrements de serveurs nécessitent l’utilisation d’un certificat et certains ont besoin d’un certificat avec un certain type de clef publique : par exemple les ensembles de chiffrements DSS ont besoin d’un certificat contenant une clef DSS (DSA). Si aucun n’est indiqué, le nom de fichier I<server.pem> sera utilisé.

source: B<-dcert filename>, B<-dkey keyname>
fr: B<-dcert> I<fichier>, B<-dkey> I<fichier>

source: specify an additional certificate and private key, these behave in the same manner as the B<-cert> and B<-key> options except there is no default if they are not specified (no additional certificate and key is used). As noted above some cipher suites require a certificate containing a key of a certain type. Some cipher suites need a certificate carrying an RSA key and some a DSS (DSA) key. By using RSA and DSS certificates and keys a server can support clients which only support RSA or DSS cipher suites by using an appropriate certificate.
fr: Indiquer un certificat et une clef privée supplémentaires, cela se comporte de la même façon que les options B<-cert> et B<-key> à part, si elles ne sont pas indiquées, l’absence de valeur par défaut (aucun certificat ni clef supplémentaires ne seront utilisés). Comme indiqué précédemment, certains ensembles de chiffrements nécessitent un certificat contenant une clef d’un certain type. Certains ensembles de chiffrements ont besoin d’un certificat contenant une clef RSA et d’autres une clef DSS (DSA). En utilisant des certificats et clefs RSA et DSS, un serveur peut accepter les clients qui ne gèrent que les ensembles de chiffrements RSA ou DSS en utilisant un certificat approprié.

source: B<-dcertform format>, B<-dkeyform format>, B<-dpass arg>
fr: B<-dcertform> I<format>, B<-dkeyform> I<format>, B<-dpass> I<param>

source: additional certificate and private key format and passphrase respectively.
fr: Ajouter respectivement le format de certificat et de clef privée, et la phrase secrète.
