Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/ciphers/po/*.po
Languages: fr

source: if this option is set then no certificate is used. This restricts the cipher suites available to the anonymous ones (currently just anonymous DH).
fr: Si cette option est définie, aucun certificat n’est utilisé. Cela restreint les ensembles de chiffrements disponibles à ceux anonymes (actuellement seulement DH anonyme).

source: B<-dhparam filename>
fr: B<-dhparam> I<fichier>

source: the DH parameter file to use. The ephemeral DH cipher suites generate keys using a set of DH parameters. If not specified then an attempt is made to load the parameters from the server certificate file. If this fails then a static set of parameters hard coded into the s_server program will be used.
fr: Le fichier de paramètres DH à utiliser. Les ensembles de chiffrements DH éphémères génèrent des clefs utilisant un ensemble de paramètres DH. Sans indication, une tentative de chargement des paramètres est réalisée à partir du fichier de certificats serveur. Si cela échoue, alors un ensemble fixe de paramètres, et propre au programme B<s_server>, sera utilisé.

source: if this option is set then no DH parameters will be loaded effectively disabling the ephemeral DH cipher suites.
fr: Si cette option est définie, aucun paramètre DH ne sera chargé, désactivant effectivement les ensembles de chiffrements DH éphémères.

source: certain export cipher suites sometimes use a temporary RSA key, this option disables temporary RSA key generation.
fr: Certains ensembles de chiffrements d’exportation utilisent parfois une clef RSA temporaire, cette option désactive la création de clef RSA temporaire.

source: B<-verify depth>, B<-Verify depth>
fr: B<-verify> I<profondeur>, B<-Verify> I<profondeur>

source: The verify depth to use. This specifies the maximum length of the client certificate chain and makes the server request a certificate from the client. With the B<-verify> option a certificate is requested but the client does not have to send one, with the B<-Verify> option the client must supply a certificate or an error occurs.
fr: La profondeur de vérification à utiliser. Cela indique la taille maximale de la chaîne de certificats du client et force le serveur à demander un certificat au client. Avec l’option B<-verify>, un certificat est demandé mais le client ne doit pas nécessairement en envoyer un, avec l’option B<-Verify>, le client doit fournir un certificat sinon une erreur survient.

source: If the ciphersuite cannot request a client certificate (for example an anonymous ciphersuite or PSK) this option has no effect.
fr: Si l’ensemble de chiffrements ne peut pas demander un client de certificat (par exemple un ensemble de chiffrements anonyme ou PSK), cette option est sans effet.

source: Check the peer certificate has not been revoked by its CA. The CRL(s) are appended to the certificate file. With the B<-crl_check_all> option all CRLs of all CAs in the chain are checked.
fr: Vérifier que le certificat du pair n’a pas été révoqué par son autorité de certification. Les listes de révocations de certificat sont ajoutées au fichier de certificats. Avec l’option B<-crl_check_all>, toutes les listes de révocations de certificat de toutes les autorités de certification de la chaîne sont vérifiées.

source: The directory to use for client certificate verification. This directory must be in "hash format", see B<verify> for more information. These are also used when building the server certificate chain.
fr: Le répertoire utilisé pour la vérification de certificat du client. Ce répertoire doit être au « format de hachage », consultez B<verify> pour plus de renseignements. Il est aussi utilisé pour construire la chaîne de certificats du serveur.

source: A file containing trusted certificates to use during client authentication and to use when attempting to build the server certificate chain. The list is also used in the list of acceptable client CAs passed to the client when a certificate is requested.
fr: Un fichier contenant les certificats de confiance à utiliser lors d’une authentification de client et à utiliser lors d’une tentative de construction de chaîne de certificats du serveur. La liste est aussi utilisée dans la liste d’autorités de certification possibles transmise au client quand un certificat est demandé.

source: tests non blocking I/O
fr: Tester les entrées et sorties non bloquantes.

source: turns on non blocking I/O
fr: Activer les entrées et sorties non bloquantes.

source: this option translated a line feed from the terminal into CR+LF.
fr: Cette option traduit un changement de ligne du terminal en RC+PAL (CR+LF).

source: inhibit printing of session and certificate information.
fr: Empêcher l’affichage de renseignements sur la session et le certificat.

source: B<-psk_hint hint>
fr: B<-psk_hint> I<suggestion>

source: Use the PSK identity hint B<hint> when using a PSK cipher suite.
fr: Utiliser la I<suggestion> PSK lors de l’utilisation d’un ensemble de chiffrements PSK.

source: this option enables a further workaround for some some early Netscape SSL code (?).
fr: Cette option active un autre contournement pour du vieux code SSL de Netscape.

source: this allows the cipher list used by the server to be modified. When the client sends a list of supported ciphers the first client cipher also included in the server list is used. Because the client specifies the preference order, the order of the server cipherlist irrelevant. See the B<ciphers> command for more information.
fr: Cela permet à la liste de chiffrements utilisée par le serveur d’être modifiée. Quand le client envoie une liste de chiffrements pris en charge, le premier algorithme de chiffrement client pris en charge, aussi inclus dans la liste du serveur, est utilisé. Comme le client indique l’ordre de préférence, l’ordre de la liste de chiffrements du serveur n’a pas d’importance. Consultez la commande B<ciphers> pour plus de renseignements.

source: use the server's cipher preferences, rather than the client's preferences.
fr: Utiliser les préférences de chiffrement du serveur au lieu des préférences du client.

source: sends a status message back to the client when it connects. This includes lots of information about the ciphers used and various session parameters. The output is in HTML format so this option will normally be used with a web browser.
fr: Renvoyer un message d’état au client quand il se connecte. Cela contient beaucoup de renseignements sur les algorithmes de chiffrement utilisés et divers paramètres de session. La sortie est au format HTML donc cette option sera normalement utilisée avec un navigateur web.

source: emulates a simple web server. Pages will be resolved relative to the current directory, for example if the URL https://myhost/page.html is requested the file ./page.html will be loaded.
fr: Émuler un serveur web simple. Les pages seront résolues relativement au répertoire actuel, par exemple si l’URL https://hôte/page.html est demandée, le fichier ./page.html sera chargé.

source: emulates a simple web server. Pages will be resolved relative to the current directory, for example if the URL https://myhost/page.html is requested the file ./page.html will be loaded. The files loaded are assumed to contain a complete and correct HTTP response (lines that are part of the HTTP response line and headers must end with CRLF).
fr: Émuler un serveur web simple. Les pages seront résolues relativement au répertoire actuel, par exemple si l’URL https://hôte/page.html est demandée, le fichier ./page.html sera chargé. Les fichiers chargés sont supposés contenir une réponse HTTP complète et correcte (les lignes qui font partie de la ligne de réponse HTTP et les en-têtes doivent se terminer par RC+PAL (CR+LF).

source: specifying an engine (by its unique B<id> string) will cause B<s_server> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.
fr: Indiquer un moteur (en utilisant son identifiant unique I<identifiant>) obligera B<s_server> à essayer d'obtenir une référence fonctionnelle pour le moteur indiqué et l'initialiser si nécessaire. Le moteur sera ensuite utilisé par défaut pour tous les algorithmes disponibles.

source: B<-id_prefix arg>
fr: B<-id_prefix> I<param>

source: generate SSL/TLS session IDs prefixed by B<arg>. This is mostly useful for testing any SSL/TLS code (eg. proxies) that wish to deal with multiple servers, when each of which might be generating a unique range of session IDs (eg. with a certain prefix).
fr: Générer des identifiants de session SSL ou TLS précédés par I<param>. C’est surtout utile pour tester n’importe quel code SSL ou TLS (par exemple les mandataires, ou « proxy ») qui désire échanger avec plusieurs serveurs quand chacun d’eux pourrait générer une série d’identifiants particuliers de session (par exemple avec un certain préfixe).

source: enables certificate status request support (aka OCSP stapling).
fr: Activer la prise en charge de demande d’état de certificat au serveur (agrafage OCSP).

source: enables certificate status request support (aka OCSP stapling) and gives a verbose printout of the OCSP response.
fr: Activer la prise en charge de demande d’état de certificat au serveur (agrafage OCSP) et donner une sortie bavarde de la réponse OCSP.

source: B<-status_timeout nsec>
fr: B<-status_timeout> I<nsec>

source: sets the timeout for OCSP response to B<nsec> seconds.
fr: Définir la durée d'expiration pour la réponse OCSP à I<nsec> secondes.

source: B<-status_url url>
fr: B<-status_url> I<URL>

source: sets a fallback responder URL to use if no responder URL is present in the server certificate. Without this option an error is returned if the server certificate does not contain a responder address.
fr: Définir une URL de répondeur de repli à utiliser si aucune URL de répondeur n’est présente dans le certificat du serveur. Sans cette option, une erreur est renvoyée si le certificat du serveur ne contient pas d’adresse de répondeur.

source: enable Next Protocol Negotiation TLS extension and provide a comma-separated list of supported protocol names. The list should contain most wanted protocols first. Protocol names are printable ASCII strings, for example "http/1.1" or "spdy/3".
fr: Activer l’extension TLS de négociation du prochain protocole (« Next Protocol Negotiation ») et fournir une liste de noms de protocoles séparés par des virgules. La liste devrait d’abord contenir les protocoles les plus voulus. Les noms de protocole sont des chaînes ASCII affichables, par exemple « http/1.1 » ou « spdy/3 ».

source: If a connection request is established with an SSL client and neither the B<-www> nor the B<-WWW> option has been used then normally any data received from the client is displayed and any key presses will be sent to the client.
fr: Si une connexion demandée est établie avec un client SSL et qu’aucune des options B<-www> ou B<-WWW> n’a été utilisée, alors normalement, toutes les données reçues du client sont affichées et n’importe quel appui de touche sera envoyé au client.

source: Certain single letter commands are also recognized which perform special operations: these are listed below.
fr: Certaines commandes d’une seule lettre sont aussi reconnues et réalisent des opération particulières : la liste est ci-dessous.

source: end the current SSL connection but still accept new connections.
fr: Terminer la connexion SSL actuelle mais continuer à accepter de nouvelles connexions.

source: end the current SSL connection and exit.
fr: Terminer la connexion SSL actuelle et quitter.

source: renegotiate the SSL session.
fr: Renégocier la session SSL.

source: renegotiate the SSL session and request a client certificate.
fr: Renégocier la session SSL et demander un certificat client.

source: send some plain text down the underlying TCP connection: this should cause the client to disconnect due to a protocol violation.
fr: Envoyer du texte en clair dans la connexion TCP sous-jacente : cela devrait forcer le client à se déconnecter à cause d’une violation de protocole.

source: print out some session cache status information.
fr: Afficher certains renseignements d’état sur le cache de session.

source: B<s_server> can be used to debug SSL clients. To accept connections from a web browser the command:
fr: B<s_server> peut être utilisée pour déboguer les clients SSL. Pour accepter les connexions d’un navigateur web, la commande :

source: can be used for example.
fr: peut par exemple être utilisée.

source: Most web browsers (in particular Netscape and MSIE) only support RSA cipher suites, so they cannot connect to servers which don't use a certificate carrying an RSA key or a version of OpenSSL with RSA disabled.
fr: La plupart des navigateurs web (en particulier Netscape et MSIE) n’acceptent que les ensembles de chiffrements RSA, donc ne peuvent pas se connecter à des serveurs qui n’utilisent pas de certificat ne comportant pas de clef RSA ou à une version d’OpenSSL avec RSA désactivé.

source: Although specifying an empty list of CAs when requesting a client certificate is strictly speaking a protocol violation, some SSL clients interpret this to mean any CA is acceptable. This is useful for debugging purposes.
fr: Bien qu’indiquer une liste vide d’autorités de certification lors de la demande de certificat client est une violation de protocole au sens strict, certains clients SSL interprètent cela comme une indication que n’importe quelle autorité de certification est acceptable. C’est utile dans des buts de débogage.

source: The session parameters can printed out using the B<sess_id> program.
fr: Les paramètres de session peuvent être affichés en utilisant le programme B<sess_id>.

source: Because this program has a lot of options and also because some of the techniques used are rather old, the C source of s_server is rather hard to read and not a model of how things should be done. A typical SSL server program would be much simpler.
fr: Puisque ce programme a beaucoup d’options, et aussi parce que certaines des techniques utilisées sont plutôt vieilles, le code source C de B<s_server> est plutôt difficile à lire et n’est pas un exemple à suivre. Un programme serveur SSL typique serait beaucoup plus simple.

source: The output of common ciphers is wrong: it just gives the list of ciphers that OpenSSL recognizes and the client supports.
fr: L’affichage des algorithmes de chiffrement communs est faux : il ne donne que la liste d’algorithmes de chiffrement reconnus par OpenSSL et pris en charge par le client.

source: There should be a way for the B<s_server> program to print out details of any unknown cipher suites a client says it supports.
fr: Le programme B<s_server> devrait pouvoir afficher des précisions sur tous les ensembles de chiffrements inconnus qu’un client prétend prendre en charge.

source: L<sess_id(1)|sess_id(1)>, L<s_client(1)|s_client(1)>, L<ciphers(1)|ciphers(1)>
fr: L<B<ciphers>(1)|ciphers(1)>, L<B<sess_id>(1)|sess_id(1)>, L<B<s_client>(1)|s_client(1)>

source: s_time - SSL/TLS performance timing program
fr: s_time - Programme d'analyse de performances SSL/TLS

source: B<openssl> B<s_time> [B<-connect host:port>] [B<-www page>] [B<-cert filename>] [B<-key filename>] [B<-CApath directory>] [B<-CAfile filename>] [B<-reuse>] [B<-new>] [B<-verify depth>] [B<-nbio>] [B<-time seconds>] [B<-ssl2>] [B<-ssl3>] [B<-bugs>] [B<-cipher cipherlist>]
fr: B<openssl> B<s_time> [B<-connect> I<hôte>B<:>I<port>] [B<-www> I<page>] [B<-cert> I<fichier>] [B<-key> I<fichier>] [B<-CApath> I<répertoire>] [B<-CAfile> I<fichier>] [B<-reuse>] [B<-new>] [B<-verify> I<profondeur>] [B<-nbio>] [B<-time> I<seconde>] [B<-ssl2>] [B<-ssl3>] [B<-bugs>] [B<-cipher> I<listechiffrements>]

source: The B<s_client> command implements a generic SSL/TLS client which connects to a remote host using SSL/TLS. It can request a page from the server and includes the time to transfer the payload data in its timing measurements. It measures the number of connections within a given timeframe, the amount of data transferred (if any), and calculates the average time spent for one connection.
fr: La commande B<s_time> implémente un client générique SSL/TLS qui se connecte à un hôte distant en utilisant SSL ou TLS. Elle peut demander une page d'un serveur et inclure le temps de transfert de l'information dans ses mesures de temps. Elle mesure le nombre de connections dans un laps de temps donné, la quantité d'information transférée (s'il y en a), et calcule le temps moyen utilisé pour une connexion.

source: This specifies the host and optional port to connect to.
fr: Cela indique l’hôte et le port facultatif où se connecter.

source: B<-www page>
fr: B<-www> I<page>

source: This specifies the page to GET from the server. A value of '/' gets the index.htm[l] page. If this parameter is not specified, then B<s_time> will only perform the handshake to establish SSL connections but not transfer any payload data.
fr: Cela indique la page à obtenir sur le serveur. La valeur de « / » correspond à la page index.htm[l]. Si ce paramètre n'est pas indiqué, alors B<s_time> n’effectuera qu’une initialisation de connexion (« handshake ») pour établir des connexions SSL mais ne transférera pas de données utiles.

source: The certificate to use, if one is requested by the server. The default is not to use a certificate. The file is in PEM format.
fr: Le certificat à utiliser, s'il est requis par le serveur. Par défaut, aucun certificat n'est utilisé. Le fichier est au format PEM.

source: The private key to use. If not specified then the certificate file will be used. The file is in PEM format.
fr: La clef privée à utiliser. En absence d’indication, le fichier de certificats sera utilisé. Le fichier est au format PEM.

source: performs the timing test using a new session ID for each connection. If neither B<-new> nor B<-reuse> are specified, they are both on by default and executed in sequence.
fr: Effectuer la mesure du temps en utilisant un nouvel identifiant de session pour chaque connexion. Si ni B<-new> ni B<-reuse> ne sont indiquées, elles sont toutes deux activées par défaut et exécutées à la suite.

source: performs the timing test using the same session ID; this can be used as a test that session caching is working. If neither B<-new> nor B<-reuse> are specified, they are both on by default and executed in sequence.
fr: Effectuer la mesure du temps en utilisant le même identifiant de session ; cela permet de tester le fonctionnement de la mise en cache des sessions. Si ni B<-new> ni B<-reuse> ne sont indiquées, elles sont toutes deux activées par défaut et exécutées à la suite.

source: turns on non-blocking I/O.
fr: Activer les entrées et sorties non bloquantes.

source: these options disable the use of certain SSL or TLS protocols. By default the initial handshake uses a method which should be compatible with all servers and permit them to use SSL v3, SSL v2 or TLS as appropriate. The timing program is not as rich in options to turn protocols on and off as the L<s_client(1)|s_client(1)> program and may not connect to all servers.
fr: Ces options désactivent l'utilisation de certains protocoles SSL ou TLS. Par défaut, l’initialisation de connexion utilise une méthode qui devrait être compatible avec tous les serveurs et leur permettre d'utiliser SSL v3, SSL v2 ou TLS comme approprié. Le programme de test des performances n'est pas aussi riche en options pour utiliser ou non des protocoles que le programme L<B<s_client>(1)|s_client(1)> et pourrait ne pas pouvoir se connecter à tous les serveurs.

source: Unfortunately there are a lot of ancient and broken servers in use which cannot handle this technique and will fail to connect. Some servers only work if TLS is turned off with the B<-ssl3> option; others will only support SSL v2 and may need the B<-ssl2> option.
fr: Malheureusement, beaucoup d'anciens serveurs mal conçus encore utilisés ne gèrent pas cette technique et échoueront à se connecter. Certains serveurs ne fonctionnent que si TLS est désactivé avec l'option B<-ssl3> ; d'autres ne gèrent que SSL v2 et peuvent avoir besoin de l'option B<-ssl2>.

source: this allows the cipher list sent by the client to be modified. Although the server determines which cipher suite is used it should take the first supported cipher in the list sent by the client. See the L<ciphers(1)|ciphers(1)> command for more information.
fr: Cela permet de modifier la liste d'algorithmes envoyée par le client. Bien que le serveur détermine l’ensemble d'algorithmes utilisé, il devrait prendre le premier algorithme accepté dans la liste envoyée par le client. Consultez la commande L<B<ciphers>(1)|ciphers(1)> pour plus de renseignements.

source: B<-time length>
fr: B<-time> I<seconde>

source: specifies how long (in seconds) B<s_time> should establish connections and optionally transfer payload data from a server. Server and client performance and the link speed determine how many connections B<s_time> can establish.
fr: Indiquer la durée (en seconde) pendant laquelle B<s_time> devrait établir des connexions et facultativement transférer des informations à partir d'un serveur. La performance du serveur et du client ainsi que la vitesse du lien déterminent le nombre de connexions que B<s_time> peut établir.

source: B<s_client> can be used to measure the performance of an SSL connection. To connect to an SSL HTTP server and get the default page the command
fr: B<s_time> peut être utilisée pour mesurer la performance d'une connexion SSL. La commande suivante est typiquement utilisée pour se connecter à un serveur HTTP SSL (https utilise le port 443) et obtenir la page par défaut :

source: openssl s_time -connect servername:443 -www / -CApath yourdir -CAfile yourfile.pem -cipher commoncipher [-ssl3]
fr: openssl s_time -connect nom_serveur:443 -www / -CApath répertoire \ -CAfile fichier.pem -cipher algorithme_commun [-ssl3]

source: would typically be used (https uses port 443). 'commoncipher' is a cipher to which both client and server can agree, see the L<ciphers(1)|ciphers(1)> command for details.
fr: « algorithme_commun » est un algorithme sur lequel client et serveur peuvent s'accorder, consultez la commande L<B<ciphers>(1)|ciphers(1)> pour plus de précisions.

source: If the handshake fails then there are several possible causes, if it is nothing obvious like no client certificate then the B<-bugs>, B<-ssl2>, B<-ssl3> options can be tried in case it is a buggy server. In particular you should play with these options B<before> submitting a bug report to an OpenSSL mailing list.
fr: En cas d’échec de l’initialisation de connexion, plusieurs causes sont possibles. Si aucune raison évidente n’est détectée comme l’absence de certificat client, les options B<-bugs>, B<-ssl2> et B<-ssl3> peuvent être essayées si le serveur est bogué. En particulier, vous devriez essayer ces options B<avant> de soumettre un rapport de bogue sur une liste de diffusion d’OpenSSL.
