Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/ciphers/po/*.po
Languages: fr

source: NAME
fr: NOM

source: ciphers - SSL cipher display and cipher list tool.
fr: ciphers - Outil d'affichage et de liste de chiffrements SSL

source: B<openssl> B<ciphers> [B<-v>] [B<-V>] [B<-ssl2>] [B<-ssl3>] [B<-tls1>] [B<cipherlist>]
fr: B<openssl> B<ciphers> [B<-v>] [B<-V>] [B<-ssl2>] [B<-ssl3>] [B<-tls1>] [I<listechiffrements>]

source: The B<ciphers> command converts textual OpenSSL cipher lists into ordered SSL cipher preference lists. It can be used as a test tool to determine the appropriate cipherlist.
fr: La commande B<ciphers> convertit les listes de chiffrements OpenSSL au format texte en listes de chiffrements SSL triées par préférence. Elle peut être employée comme test afin de déterminer la liste de chiffrements appropriée.

source: COMMAND OPTIONS
fr: OPTIONS DE LA COMMANDE

source: Verbose option. List ciphers with a complete description of protocol version (SSLv2 or SSLv3; the latter includes TLS), key exchange, authentication, encryption and mac algorithms used along with any key size restrictions and whether the algorithm is classed as an "export" cipher. Note that without the B<-v> option, ciphers may seem to appear twice in a cipher list; this is when similar ciphers are available for SSL v2 and for SSL v3/TLS v1.
fr: Option bavarde. Afficher des types de chiffrement avec une description complète des protocoles (SSLv2 ou SSLv3 ; ce dernier comprend TLS), échange de clef, authentification, chiffrement et algorithmes mac utilisés ainsi que leurs restrictions sur la longueur des clefs et une indication si l'algorithme est classé en tant que chiffrement « export ». Remarquez que sans l'option B<-v>, les chiffrements peuvent sembler apparaître en double dans une liste ; c'est le cas lorsque des chiffrements similaires sont disponibles pour SSL v2 et SSL v3 ou TLS v1.

source: Like B<-v>, but include cipher suite codes in output (hex format).
fr: Comme B<-v>, mais contient les codes des ensembles de chiffrements dans la sortie (format hexadécimal).

source: only include SSL v3 ciphers.
fr: N'afficher que les chiffrements SSL v3.

source: only include SSL v2 ciphers.
fr: N'afficher que les chiffrements SSL v2.

source: only include TLS v1 ciphers.
fr: N'afficher que les chiffrements TLS v1.

source: print a brief usage message.
fr: Afficher un bref descriptif d'utilisation.

source: B<cipherlist>
fr: I<listechiffrements>

source: a cipher list to convert to a cipher preference list. If it is not included then the default cipher list will be used. The format is described below.
fr: Une liste de types de chiffrement à convertir en liste de préférences de chiffrement. Sans cette option, la liste de chiffrements par défaut sera utilisée. Le format est décrit ci-dessous.

source: CIPHER LIST FORMAT
fr: FORMAT DES LISTES DE CHIFFREMENTS

source: The cipher list consists of one or more I<cipher strings> separated by colons. Commas or spaces are also acceptable separators but colons are normally used.
fr: La liste de chiffrements contient une ou plusieurs chaînes de chiffrements, séparées par des deux-points (« : »). Les virgules et les espaces sont également des séparateurs valables, mais d'habitude, les deux-points sont utilisés.

source: The actual cipher string can take several different forms.
fr: La chaîne de chiffrements se présente sous différentes formes.

source: It can consist of a single cipher suite such as B<RC4-SHA>.
fr: Elle peut être un seul ensemble de chiffrements comme B<RC4-SHA>.

source: It can represent a list of cipher suites containing a certain algorithm, or cipher suites of a certain type. For example B<SHA1> represents all ciphers suites using the digest algorithm SHA1 and B<SSLv3> represents all SSL v3 algorithms.
fr: Elle peut être une liste d’ensembles de chiffrements, contenant un certain algorithme, ou des ensembles de chiffrements d'un type précis. Par exemple, B<SHA1> représente tous les ensembles utilisant l'algorithme de signature SHA1 et B<SSLv3> tous les algorithmes SSL v3.

source: Lists of cipher suites can be combined in a single cipher string using the B<+> character. This is used as a logical B<and> operation. For example B<SHA1+DES> represents all cipher suites containing the SHA1 B<and> the DES algorithms.
fr: Les listes d’ensembles de chiffrements peuvent être combinées en une seule chaîne de chiffrements en utilisant le caractère B<+>. Cela correspond à une opération logique B<ET>. Par exemple, B<SHA1+DES> représente tous les ensembles de chiffrements contenant à la fois les algorithmes SHA1 B<ET> DES.

source: Each cipher string can be optionally preceded by the characters B<!>, B<-> or B<+>.
fr: Toute chaîne de chiffrements peut être précédée par les caractères B<!>, B<-> ou B<+>.

source: If B<!> is used then the ciphers are permanently deleted from the list. The ciphers deleted can never reappear in the list even if they are explicitly stated.
fr: Si B<!> est utilisé, alors les chiffrements sont définitivement supprimés de la liste. Les chiffrements supprimés ne peuvent pas réapparaître dans la liste même s'ils sont nommés explicitement.

source: If B<-> is used then the ciphers are deleted from the list, but some or all of the ciphers can be added again by later options.
fr: Si B<-> est utilisé, les chiffrements sont également supprimés de la liste, mais certains ou tous les chiffrements peuvent être ajoutés ensuite par des options supplémentaires.

source: If B<+> is used then the ciphers are moved to the end of the list. This option doesn't add any new ciphers it just moves matching existing ones.
fr: Si B<+> est utilisé, les chiffrements sont déplacés en fin de liste. Cette option n'ajoute aucun nouveau chiffrement, seuls les chiffrements existants du même type sont déplacés.

source: If none of these characters is present then the string is just interpreted as a list of ciphers to be appended to the current preference list. If the list includes any ciphers already present they will be ignored: that is they will not moved to the end of the list.
fr: Si aucun de ces caractères n'est présent, la chaîne est uniquement interprétée en tant que liste de chiffrements à ajouter à la liste de préférences actuelle. Tous les chiffrements qui sont déjà présents sont ignorés ; ils ne seront pas déplacés à la fin de la liste.

source: Additionally the cipher string B<@STRENGTH> can be used at any point to sort the current cipher list in order of encryption algorithm key length.
fr: De plus, la chaîne de chiffrements B<@STRENGTH> peut être employée à n'importe quel endroit afin de trier la liste de chiffrements actuelle en fonction de la longueur de la clef de l'algorithme de codage.

source: CIPHER STRINGS
fr: CHAÎNES DE CHIFFREMENTS

source: The following is a list of all permitted cipher strings and their meanings.
fr: Voici une liste de toutes les chaînes de chiffrements permises et de leur signification.

source: the default cipher list. This is determined at compile time and is normally B<ALL:!EXPORT:!aNULL:!eNULL:!SSLv2>. This must be the firstcipher string specified.
fr: La liste de chiffrements par défaut. Elle est déterminée lors de la compilation et vaut normalement B<ALL:!EXPORT:!aNULL:!eNULL:!SSLv2>. Elle doit être la première chaîne de chiffrements indiquée.

source: the ciphers included in B<ALL>, but not enabled by default. Currently this is B<ADH> and B<AECDH>. Note that this rule does not cover B<eNULL>, which is not included by B<ALL> (use B<COMPLEMENTOFALL> if necessary).
fr: Les algorithmes inclus dans B<ALL>, mais désactivés par défaut. Actuellement il s'agit de B<ADH> et B<AECDH>. Remarquez que cette règle ne couvre pas B<eNULL>, qui n'est pas inclus dans B<ALL> (utilisez B<COMPLEMENTOFALL> si nécessaire).

source: all cipher suites except the B<eNULL> ciphers which must be explicitly enabled; as of OpenSSL, the B<ALL> cipher suites are reasonably ordered by default
fr: Tous les ensembles de chiffrements à part les chiffrements B<eNULL> qui doivent être activés explicitement. Avec OpenSSL, les ensembles de chiffrements B<ALL> sont rationnellement ordonnés par défaut.

source: the cipher suites not enabled by B<ALL>, currently being B<eNULL>.
fr: Les ensembles de chiffrements qui ne sont pas activés par B<ALL>. Actuellement, il s'agit de B<eNULL>.

source: "high" encryption cipher suites. This currently means those with key lengths larger than 128 bits, and some cipher suites with 128-bit keys.
fr: Les ensembles de chiffrements « forts ». Actuellement, cela signifie ceux dont la clef de chiffrement a une longueur supérieure à 128 bits et quelques ensembles avec une clef de 128 bits.

source: "medium" encryption cipher suites, currently some of those using 128 bit encryption.
fr: Les ensembles de chiffrements « moyens », actuellement certains de ceux qui utilisent un chiffrement de 128 bits.

source: "low" encryption cipher suites, currently those using 64 or 56 bit encryption algorithms but excluding export cipher suites.
fr: Les ensembles de chiffrements « faibles ». Cela signifie actuellement ceux utilisant des algorithmes de chiffrement de 56 ou 64 bits, mais les ensembles d'exportation sont traités à part.

source: export encryption algorithms. Including 40 and 56 bits algorithms.
fr: Les algorithmes de chiffrement d'exportation, y compris les algorithmes de 40 et 56 bits.

source: 40 bit export encryption algorithms
fr: Les algorithmes de chiffrement d'exportation de 40 bits.

source: 56 bit export encryption algorithms. In OpenSSL 0.9.8c and later the set of 56 bit export ciphers is empty unless OpenSSL has been explicitly configured with support for experimental ciphers.
fr: Les algorithmes de chiffrement d'exportation de 56 bits. Dans OpenSSL 0.9.8c et les versions suivantes, l'ensemble des chiffrements d'exportation de 56 bits est vide à moins qu'OpenSSL n'ait été configuré explicitement pour gérer ces chiffrements expérimentaux.

source: the "NULL" ciphers that is those offering no encryption. Because these offer no encryption at all and are a security risk they are disabled unless explicitly included.
fr: Les chiffrements « NULL » correspondent à l'absence de chiffrement. Parce qu'il n'y a pas de chiffrement et qu'ils représentent ainsi un risque de sécurité important, ils sont désactivés sauf s'ils sont cités explicitement.

source: the cipher suites offering no authentication. This is currently the anonymous DH algorithms and anonymous ECDH algorithms. These cipher suites are vulnerable to a "man in the middle" attack and so their use is normally discouraged.
fr: Les ensembles de chiffrements sans authentification. Il s'agit actuellement des algorithmes anonymes DH et des algorithmes anonymes ECDH. Ces ensembles de chiffrements sont vulnérables à des attaques dites d'« homme au milieu » (« man in the middle ») et leur utilisation est déconseillée.

source: cipher suites using RSA key exchange.
fr: Ensembles de chiffrements utilisant l'échange de clefs RSA.

source: cipher suites using ephemeral DH key agreement, including anonymous cipher suites.
fr: Ensembles de chiffrements utilisant l'échange de clefs éphémères DH, y compris les ensembles de chiffrements anonymes.

source: cipher suites using authenticated ephemeral DH key agreement.
fr: Ensembles de chiffrements utilisant l'échange authentifié de clefs éphémères DH.

source: anonymous DH cipher suites, note that this does not include anonymous Elliptic Curve DH (ECDH) cipher suites.
fr: Ensembles de chiffrements anonymes DH, remarquez que cela ne comprend pas les ensembles de chiffrements anonymes DH à courbe elliptique (ECDH).

source: cipher suites using DH, including anonymous DH, ephemeral DH and fixed DH.
fr: Ensembles de chiffrements utilisant DH, y compris DH anonyme, DH éphémère et DH fixe.

source: cipher suites using fixed ECDH key agreement signed by CAs with RSA and ECDSA keys or either respectively.
fr: Ensembles de chiffrements utilisant l’échange de clefs ECDH fixes, signé par des autorités de certification, utilisant respectivement des clefs RSA et ECDSA ou les deux. Non implémentés.

source: cipher suites using ephemeral ECDH key agreement, including anonymous cipher suites.
fr: Ensembles de chiffrements utilisant l'échange de clefs éphémères ECDH, y compris les ensembles de chiffrements anonymes

source: cipher suites using authenticated ephemeral ECDH key agreement.
fr: Ensembles de chiffrements utilisant l'échange authentifié de clefs ECDH éphémères.

source: anonymous Elliptic Curve Diffie Hellman cipher suites.
fr: Ensembles de chiffrements Diffie-Hellman à courbe elliptique anonymes.

source: cipher suites using ECDH key exchange, including anonymous, ephemeral and fixed ECDH.
fr: Ensembles de chiffrements utilisant l’échange de clefs ECDH, y compris ECDH anonyme, éphémère et fixe.

source: cipher suites using RSA authentication, i.e. the certificates carry RSA keys.
fr: Ensembles de chiffrements utilisant l'authentification RSA, c'est-à-dire que les certificats portent des clefs RSA.

source: cipher suites using DSS authentication, i.e. the certificates carry DSS keys.
fr: Ensembles de chiffrements utilisant l'authentification DSS, c'est-à-dire que les certificats portent des clefs DSS.

source: cipher suites effectively using ECDH authentication, i.e. the certificates carry ECDH keys.
fr: Ensembles de chiffrements utilisant effectivement l'authentification ECDH, c'est-à-dire que les certificats portent des clefs ECDH.

source: cipher suites using ECDSA authentication, i.e. the certificates carry ECDSA keys.
fr: Ensembles de chiffrements utilisant l'authentification ECDSA, c'est-à-dire que les certificats portent des clefs ECDSA.

source: ciphers suites using FORTEZZA key exchange, authentication, encryption or all FORTEZZA algorithms. Not implemented.
fr: Ensembles de chiffrements utilisant l'échange de clefs, l'authentification, le chiffrement ou tous les algorithmes FORTEZZA. Non implémentés.

source: TLS v1.2, TLS v1.0, SSL v3.0 or SSL v2.0 cipher suites respectively. Note: there are no ciphersuites specific to TLS v1.1.
fr: Ensembles de chiffrements TLS v1.2, TLS v1.0, SSL v3.0 ou SSL v2.0 respectivement. Remarquez l’absence d’ensemble de chiffrements spécifique à TLS v1.1.

source: cipher suites using 128 bit AES, 256 bit AES or either 128 or 256 bit AES.
fr: Ensembles de chiffrements utilisant AES 128 bits, AES 256 bits, ou AES 128 ou 256 bits.

source: AES in Galois Counter Mode (GCM): these ciphersuites are only supported in TLS v1.2.
fr: AES en mode Galois/Counter (GCM) : ces ensembles de chiffrements ne sont pris en charge que dans TLS v1.2.

source: cipher suites using 128 bit CAMELLIA, 256 bit CAMELLIA or either 128 or 256 bit CAMELLIA.
fr: Ensembles de chiffrements utilisant CAMELLIA 128 bits, CAMELLIA 256 bits, ou CAMELLIA 128 ou 256 bits.

source: cipher suites using triple DES.
fr: Ensembles de chiffrements utilisant le triple DES.

source: cipher suites using DES (not triple DES).
fr: Ensembles de chiffrements utilisant le DES simple (pas le triple DES).

source: cipher suites using RC4.
fr: Ensembles de chiffrements utilisant RC4.

source: cipher suites using RC2.
fr: Ensembles de chiffrements utilisant RC2.

source: cipher suites using IDEA.
fr: Ensembles de chiffrements utilisant IDEA.

source: cipher suites using SEED.
fr: Ensembles de chiffrements utilisant SEED.

source: cipher suites using MD5.
fr: Ensembles de chiffrements utilisant MD5.

source: cipher suites using SHA1.
fr: Ensembles de chiffrements utilisant SHA1.

source: ciphersuites using SHA256 or SHA384.
fr: Ensembles de chiffrements utilisant SHA256 ou SHA384.

source: cipher suites using GOST R 34.10 (either 2001 or 94) for authenticaction (needs an engine supporting GOST algorithms).
fr: Ensembles de chiffrements utilisant GOST R 34.10 (2001 ou 94) pour l'authentification (nécessite un moteur prenant en charge les algorithmes GOST).

source: cipher suites using GOST R 34.10-2001 authentication.
fr: Ensembles de chiffrements utilisant l'authentification GOST R 34.10-2001.

source: cipher suites using GOST R 34.10-94 authentication (note that R 34.10-94 standard has been expired so use GOST R 34.10-2001)
fr: Ensembles de chiffrements utilisant l'authentification GOST R 34.10-94 (remarquez que la norme R 34.10-94 est arrivée à expiration, l'utilisation de GOST R 34.10-2001 est donc préférable).

source: cipher suites, using VKO 34.10 key exchange, specified in the RFC 4357.
fr: Ensembles de chiffrements, utilisant l'échange de clefs VKO 34.10, spécifié dans la RFC 4357.

source: cipher suites, using HMAC based on GOST R 34.11-94.
fr: Ensembles de chiffrements utilisant HMAC basé sur GOST R 34.11-94.

source: cipher suites using GOST 28147-89 MAC B<instead of> HMAC.
fr: Ensembles de chiffrements utilisant MAC GOST 28147-89 B<au lieu de> HMAC.

source: cipher suites using pre-shared keys (PSK).
fr: Ensembles de chiffrements utilisant des clefs prépartagées (PSK).

source: CIPHER SUITE NAMES
fr: NOMS DES ENSEMBLES DE CHIFFREMENTS

source: The following lists give the SSL or TLS cipher suites names from the relevant specification and their OpenSSL equivalents. It should be noted, that several cipher suite names do not include the authentication used, e.g. DES-CBC3-SHA. In these cases, RSA authentication is used.
fr: La liste suivante donne les noms des ensembles de chiffrements SSL ou TLS à partir de la spécification correspondante et leurs équivalents OpenSSL. Remarquez que le nom de plusieurs ensembles de chiffrements n'inclut pas le type d'authentification utilisé, par exemple DES-CBC3-SHA. Dans ces cas, l'authentification RSA est utilisée.

source: SSL v3.0 cipher suites.
fr: Ensembles de chiffrements SSL v3.0

source: SSL_FORTEZZA_KEA_WITH_NULL_SHA Not implemented. SSL_FORTEZZA_KEA_WITH_FORTEZZA_CBC_SHA Not implemented. SSL_FORTEZZA_KEA_WITH_RC4_128_SHA Not implemented.
fr: SSL_FORTEZZA_KEA_WITH_NULL_SHA Pas implémenté. SSL_FORTEZZA_KEA_WITH_FORTEZZA_CBC_SHA Pas implémenté. SSL_FORTEZZA_KEA_WITH_RC4_128_SHA Pas implémenté.

source: TLS v1.0 cipher suites.
fr: Ensembles de chiffrements TLS v1.0

source: TLS_DH_DSS_EXPORT_WITH_DES40_CBC_SHA Not implemented. TLS_DH_DSS_WITH_DES_CBC_SHA Not implemented. TLS_DH_DSS_WITH_3DES_EDE_CBC_SHA Not implemented. TLS_DH_RSA_EXPORT_WITH_DES40_CBC_SHA Not implemented. TLS_DH_RSA_WITH_DES_CBC_SHA Not implemented. TLS_DH_RSA_WITH_3DES_EDE_CBC_SHA Not implemented. TLS_DHE_DSS_EXPORT_WITH_DES40_CBC_SHA EXP-EDH-DSS-DES-CBC-SHA TLS_DHE_DSS_WITH_DES_CBC_SHA EDH-DSS-CBC-SHA TLS_DHE_DSS_WITH_3DES_EDE_CBC_SHA EDH-DSS-DES-CBC3-SHA TLS_DHE_RSA_EXPORT_WITH_DES40_CBC_SHA EXP-EDH-RSA-DES-CBC-SHA TLS_DHE_RSA_WITH_DES_CBC_SHA EDH-RSA-DES-CBC-SHA TLS_DHE_RSA_WITH_3DES_EDE_CBC_SHA EDH-RSA-DES-CBC3-SHA
fr: TLS_DH_DSS_EXPORT_WITH_DES40_CBC_SHA Pas implémenté. TLS_DH_DSS_WITH_DES_CBC_SHA Pas implémenté. TLS_DH_DSS_WITH_3DES_EDE_CBC_SHA Pas implémenté. TLS_DH_RSA_EXPORT_WITH_DES40_CBC_SHA Pas implémenté. TLS_DH_RSA_WITH_DES_CBC_SHA Pas implémenté. TLS_DH_RSA_WITH_3DES_EDE_CBC_SHA Pas implémenté. TLS_DHE_DSS_EXPORT_WITH_DES40_CBC_SHA EXP-EDH-DSS-DES-CBC-SHA TLS_DHE_DSS_WITH_DES_CBC_SHA EDH-DSS-CBC-SHA TLS_DHE_DSS_WITH_3DES_EDE_CBC_SHA EDH-DSS-DES-CBC3-SHA TLS_DHE_RSA_EXPORT_WITH_DES40_CBC_SHA EXP-EDH-RSA-DES-CBC-SHA TLS_DHE_RSA_WITH_DES_CBC_SHA EDH-RSA-DES-CBC-SHA TLS_DHE_RSA_WITH_3DES_EDE_CBC_SHA EDH-RSA-DES-CBC3-SHA

source: AES ciphersuites from RFC3268, extending TLS v1.0
fr: Ensembles de chiffrements AES de la RFC 3268, extension pour TLS v1.0

source: Camellia ciphersuites from RFC4132, extending TLS v1.0
fr: Ensembles de chiffrements Camellia de la RFC 4132, extension pour TLS v1.0

source: SEED ciphersuites from RFC4162, extending TLS v1.0
fr: Ensembles de chiffrements SEED de la RFC 4162, extension pour TLS v1.0

source: GOST ciphersuites from draft-chudov-cryptopro-cptls, extending TLS v1.0
fr: Ensembles de chiffrements GOST de la draft-chudov-cryptopro-cptls, extension pour TLS v1.0

source: Note: these ciphers require an engine which including GOST cryptographic algorithms, such as the B<ccgost> engine, included in the OpenSSL distribution.
fr: Remarque : ces chiffrements nécessitent un moteur incluant les algorithmes cryptographiques GOST, comme le moteur B<ccgost> inclus dans la distribution OpenSSL.

source: Additional Export 1024 and other cipher suites
fr: Ensembles de chiffrements additionnels Export 1024 et autres

source: Note: these ciphers can also be used in SSL v3.
fr: Remarque : ces chiffrements peuvent aussi être utilisés pour SSL v3.

source: Elliptic curve cipher suites.
fr: Ensembles de chiffrements à courbe elliptique.

source: TLS v1.2 cipher suites
fr: Ensembles de chiffrements TLS v1.2

source: Pre shared keying (PSK) cipheruites
fr: Ensembles de chiffrements à trousseau prépartagé (PSK)

source: Deprecated SSL v2.0 cipher suites.
fr: Ensembles de chiffrements SSL v2.0 déconseillés

source: Some compiled versions of OpenSSL may not include all the ciphers listed here because some ciphers were excluded at compile time.
fr: Certaines versions compilées d'OpenSSL peuvent ne pas inclure tous les types de chiffrement indiqués ici en raison du paramétrage lors de la compilation.

source: EXAMPLES
fr: EXEMPLES

source: Verbose listing of all OpenSSL ciphers including NULL ciphers:
fr: Liste bavarde de tous les chiffrements OpenSSL incluant les chiffrements NULL :

source: Include all ciphers except NULL and anonymous DH then sort by strength:
fr: Inclure tous les chiffrements sauf NULL et DH anonyme, puis trier par force :

source: Include all ciphers except ones with no encryption (eNULL) or no authentication (aNULL):
fr: Inclure tous les chiffrements sauf ceux sans chiffrement (eNULL) ou sans authentification (aNULL) :

source: Include only 3DES ciphers and then place RSA ciphers last:
fr: Inclure seulement les chiffrements 3DES puis ajouter les chiffrements RSA à la fin :

source: Include all RC4 ciphers but leave out those without authentication:
fr: Inclure tous les chiffrements utilisant RC4, mais laisser de côté ceux sans authentification :

source: Include all chiphers with RSA authentication but leave out ciphers without encryption.
fr: Inclure tous les chiffrements avec une authentification RSA, mais laisser de côté ceux sans chiffrement :

source: SEE ALSO
fr: VOIR AUSSI

source: L<s_client(1)|s_client(1)>, L<s_server(1)|s_server(1)>, L<ssl(3)|ssl(3)>
fr: L<B<s_client>(1)|s_client(1)>, L<B<s_server>(1)|s_server(1)>, L<B<ssl>(3)|ssl(3)>

source: HISTORY
fr: HISTORIQUE

source: The B<COMPLENTOFALL> and B<COMPLEMENTOFDEFAULT> selection options for cipherlist strings were added in OpenSSL 0.9.7. The B<-V> option for the B<ciphers> command was added in OpenSSL 1.0.0.
fr: Les options de sélection B<COMPLEMENTOFALL> et B<COMPLEMENTOFDEFAULT> pour les chaînes de listes de chiffrements ont été ajoutées dans OpenSSL 0.9.7. L'option B<-V> pour la commande B<ciphers> a été ajoutée dans OpenSSL 1.0.0.

source: s_client - SSL/TLS client program
fr: s_client - programme client SSL ou TLS

source: The B<s_client> command implements a generic SSL/TLS client which connects to a remote host using SSL/TLS. It is a I<very> useful diagnostic tool for SSL servers.
fr: La commande B<s_client> implémente un client SSL ou TLS générique qui se connecte à un hôte distant en utilisant SSL ou TLS. C’est un outil de diagnostic I<très> pratique pour les serveurs SSL.

source: B<-connect host:port>
fr: B<-connect> I<hôte>B<:>I<port>

source: This specifies the host and optional port to connect to. If not specified then an attempt is made to connect to the local host on port 4433.
fr: Cela indique l’hôte et le port facultatif où se connecter. Sans indication, un essai de connexion sera réalisé vers l’hôte local sur le port 4433.

source: B<-servername name>
fr: B<-servername> I<nom>
