Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/ciphers/po/*.po
Languages: fr

source: A frequent problem when attempting to get client certificates working is that a web client complains it has no certificates or gives an empty list to choose from. This is normally because the server is not sending the clients certificate authority in its "acceptable CA list" when it requests a certificate. By using L<s_client(1)|s_client(1)> the CA list can be viewed and checked. However some servers only request client authentication after a specific URL is requested. To obtain the list in this case it is necessary to use the B<-prexit> option of L<s_client(1)|s_client(1)> and send an HTTP request for an appropriate page.
fr: Un problème classique lors d’une tentative d’obtention de certificat client fonctionnel, est qu’un client web se plaint de ne pas avoir de certificat ou donne une liste vide pour le choisir. C’est généralement dû au serveur qui n’envoie pas aux clients les autorités de certification dans sa « liste d’autorités de certification acceptables » quand il demande un certificat. En utilisant L<B<s_client>(1)|s_client(1)>, la liste d’autorités de certification peut être vue et vérifiée. Cependant, certains serveurs ne demandent une authentification du client qu’après une demande d’URL spécifique. Pour obtenir la liste dans ce cas, il faut utiliser l’option B<-prexit> de L<B<s_client>(1)|s_client(1)> et envoyer une requête HTTP pour une page appropriée.

source: Because this program does not have all the options of the L<s_client(1)|s_client(1)> program to turn protocols on and off, you may not be able to measure the performance of all protocols with all servers.
fr: Ce programme n'a pas toutes les options du programme L<B<s_client>(1)|s_client(1)> pour activer ou désactiver des protocoles, vous ne pouvez pas mesurer les performances de tous les protocoles avec tous les serveurs.

source: The B<-verify> option should really exit if the server verification fails.
fr: L'option B<-verify> devrait réellement quitter si la vérification du serveur échoue.

source: L<s_client(1)|s_client(1)>, L<s_server(1)|s_server(1)>, L<ciphers(1)|ciphers(1)>
fr: L<B<s_client>(1)|s_client(1)>, L<B<s_server>(1)|s_server(1)>, L<B<ciphers>(1)|ciphers(1)>
