Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: Non-incremental searches read the entire search string before starting to search for matching history lines. The search string may be typed by the user or be part of the contents of the current line.
fr: Les recherches non incrémentales lisent la chaîne désirée en entier avant de démarrer la recherche de correspondance dans la liste d'historique. La chaîne peut être saisie par l'utilisateur ou faire partie du contenu de la ligne courante.

source: Readline Command Names
fr: Noms des commandes readline

source: The following is a list of the names of the commands and the default key sequences to which they are bound. Command names without an accompanying key sequence are unbound by default. In the following descriptions, I<point> refers to the current cursor position, and I<mark> refers to a cursor position saved by the B<set-mark> command. The text between the point and mark is referred to as the I<region>.
fr: Ce qui suit est une liste des noms de commandes et les suites de touches auxquelles elles sont associées par défaut. Les noms de commandes sans suite de touche les accompagnant ne sont pas associées par défaut. Dans les descriptions suivantes, le I<curseur> (point) se réfère à la position courante du curseur et la I<marque> se réfère à une position de curseur sauvegardée par la commande B<set-mark>. Le texte entre le curseur et la marque est désigné comme la I<zone>.

source: Commands for Moving
fr: Commandes de déplacement

source: Move to the start of the current line.
fr: Saut au début de la ligne courante.

source: Move to the end of the line.
fr: Saut à la fin de la ligne.

source: Move forward a character.
fr: Avancer d'un caractère.

source: Move back a character.
fr: Reculer d'un caractère.

source: Move forward to the end of the next word. Words are composed of alphanumeric characters (letters and digits).
fr: Avancer jusqu'à la fin du mot suivant. Les mots sont composés de caractères alphanumériques (lettres et chiffres).

source: Move back to the start of the current or previous word. Words are composed of alphanumeric characters (letters and digits).
fr: Reculer jusqu'au début du mot courant ou du précédent. Les mots sont composés de caractères alphanumériques (lettres et chiffres).

source: Clear the screen leaving the current line at the top of the screen. With an argument, refresh the current line without clearing the screen.
fr: Effacer l'écran, en laissant la ligne courante au sommet de l'écran. S'il y a un argument, rafraîchir la ligne courante sans effacer l'écran.

source: Refresh the current line.
fr: Rafraîchir la ligne courante.

source: Commands for Manipulating the History
fr: Commandes de manipulation de l'historique

source: B<accept-line (Newline, Return)>
fr: B<accept-line (Saut de ligne, Retour-Chariot)>

source: Accept the line regardless of where the cursor is. If this line is non-empty, add it to the history list according to the state of the E<.SM> B<HISTCONTROL> variable. If the line is a modified history line, then restore the history line to its original state.
fr: Valider la ligne, sans se soucier de l'emplacement du curseur. Si la ligne n'est pas vide, l'ajouter à la file d'historique, sous contrôle de la variable E<.SM B<HISTCONTROL>.> Si cette ligne est une modification d'une ligne de l'historique, restaurer cette dernière.

source: Fetch the previous command from the history list, moving back in the list.
fr: Récupérer la commande précédente de la file d'historique, en remontant dans la file.

source: Fetch the next command from the history list, moving forward in the list.
fr: Récupérer la commande suivante dans la file d'historique, en descendant dans la file.

source: Move to the first line in the history.
fr: Récupérer la première ligne de l'historique.

source: Move to the end of the input history, i.e., the line currently being entered.
fr: Retourner à la fin de l'historique de saisie, c'est-à-dire à la ligne en cours de saisie.

source: Search backward starting at the current line and moving `up' through the history as necessary. This is an incremental search.
fr: Rechercher en arrière dans l'historique, en remontant. C'est une recherche incrémentale.

source: Search forward starting at the current line and moving `down' through the history as necessary. This is an incremental search.
fr: Rechercher en avant dans l'historique, en descendant. C'est une recherche incrémentale.

source: Search backward through the history starting at the current line using a non-incremental search for a string supplied by the user.
fr: Rechercher une chaîne en arrière dans l'historique, en remontant depuis la ligne actuelle, utiliser une recherche non incrémentale pour une chaîne fournie par l'utilisateur.

source: Search forward through the history using a non-incremental search for a string supplied by the user.
fr: Rechercher une chaîne en avant dans l'historique, utiliser une recherche non incrémentale pour une chaîne fournie par l'utilisateur.

source: Search forward through the history for the string of characters between the start of the current line and the point. This is a non-incremental search.
fr: Rechercher en avant dans l'historique la chaîne comprise entre le début de la ligne actuelle et la position du curseur. C'est une recherche non incrémentale.

source: Search backward through the history for the string of characters between the start of the current line and the point. This is a non-incremental search.
fr: Rechercher en arrière dans l'historique la chaîne comprise entre le début de la ligne actuelle et la position du curseur. C'est une recherche non incrémentale.

source: Insert the first argument to the previous command (usually the second word on the previous line) at point. With an argument I<n>, insert the I<n>th word from the previous command (the words in the previous command begin with word 0). A negative argument inserts the I<n>th word from the end of the previous command. Once the argument I<n> is computed, the argument is extracted as if the "!I<n>" history expansion had been specified.
fr: Insérer, à l'emplacement du curseur, le premier argument de la commande précédente. Généralement, il s'agit du second mot de la ligne précédente. Avec un argument I<n>, insérer le I<n>-ième mot de la commande précédente (les mots sont numérotés à partir de 0). Un argument négatif insère le I<n>-ième mot en partant de la fin de la commande précédente. Une fois que l'argument I<n> est traité, l'argument est extrait comme si le développement d'historique « !I<n> » avait été spécifié.

source: Insert the last argument to the previous command (the last word of the previous history entry). With an argument, behave exactly like B<yank-nth-arg>. Successive calls to B<yank-last-arg> move back through the history list, inserting the last argument of each line in turn. The history expansion facilities are used to extract the last argument, as if the "!$" history expansion had been specified.
fr: Insérer à la position du curseur le dernier argument de la commande précédente (le dernier mot de l'élément précédent de la file d'historique). Avec un argument, se comporte exactement comme B<yank-nth-arg>. Les appels successifs à B<yank-last-arg> remontent dans la file d'historique en insérant le dernier argument de chaque ligne tour à tour. Les outils de développement d'historique sont utilisés pour extraire le dernier argument, comme si le développement d'historique « !$ » avait été spécifié.

source: Expand the line as the shell does. This performs alias and history expansion as well as all of the shell word expansions. See E<.SM> B<HISTORY EXPANSION> below for a description of history expansion.
fr: Développer, comme le fait l'interpréteur, la ligne courante. Ceci effectue le développement des alias et de l'historique, aussi bien que l'ensemble des développements effectués par l'interpréteur. Voir plus bas E<.SM B<DÉVELOPPEMENT DE L'HISTORIQUE>,> pour une description détaillée du développement de l'historique.

source: Perform history expansion on the current line. See E<.SM> B<HISTORY EXPANSION> below for a description of history expansion.
fr: Effectuer le développement d'historique sur la ligne courante. Voir plus bas E<.SM B<DÉVELOPPEMENT DE L'HISTORIQUE>,> pour une description détaillée.

source: Perform history expansion on the current line and insert a space. See E<.SM> B<HISTORY EXPANSION> below for a description of history expansion.
fr: Effectuer le développement de l'historique sur la ligne courante et insérer une espace. Voir plus bas E<.SM B<DÉVELOPPEMENT DE L'HISTORIQUE>,> pour une description détaillée.

source: Perform alias expansion on the current line. See E<.SM> B<ALIASES> above for a description of alias expansion.
fr: Effectuer le développement des alias sur la ligne courante. Voir E<.SM B<ALIAS>> plus haut pour une description des développements d'alias.

source: Perform history and alias expansion on the current line.
fr: Effectuer le développement de l'historique et des alias sur la ligne courante.

source: A synonym for B<yank-last-arg>.
fr: un synonyme de B<yank-last-arg>.

source: Accept the current line for execution and fetch the next line relative to the current line from the history for editing. Any argument is ignored.
fr: Valider la ligne courante et récupérer la ligne suivante de l'historique pour édition. Tout argument est ignoré.

source: Invoke an editor on the current command line, and execute the result as shell commands. B<Bash> attempts to invoke E<.SM> B<$FCEDIT>, E<.SM> B<$EDITOR>, and I<emacs> as the editor, in that order.
fr: Appelle un éditeur sur la ligne de commande courante et exécute le résultat comme une commande d'interpréteur. B<Bash> tente d'appeler, dans cet ordre, E<.SM B<$FCEDIT>,> E<.SM B<$EDITOR>> et I<emacs> comme éditeur.

source: Commands for Changing Text
fr: Commande d'édition de texte

source: Delete the character at point. If point is at the beginning of the line, there are no characters in the line, and the last character typed was not bound to B<delete-char>, then return E<.SM> B<EOF>.
fr: Effacer le caractère sous le curseur. Si le curseur est au début de la ligne, si celle-ci est vide et si le dernier caractère saisi n'était pas associé à B<delete-char>, alors renvoyer E<.SM B<EOF>.>

source: B<backward-delete-char (Rubout)>
fr: B<backward-delete-char (« Rubout » : Effacement)>

source: Delete the character behind the cursor. When given a numeric argument, save the deleted text on the kill ring.
fr: Effacer le caractère avant le curseur. Lorsque un argument numérique est indiqué, le texte effacé est sauvegardé dans le tampon circulaire.

source: Delete the character under the cursor, unless the cursor is at the end of the line, in which case the character behind the cursor is deleted.
fr: Effacer le caractère sous le curseur, sauf s'il est en fin de ligne, auquel cas le caractère avant le curseur est effacé.

source: Add the next character typed to the line verbatim. This is how to insert characters like B<C-q>, for example.
fr: Ajouter littéralement sur la ligne le caractère saisi suivant. Ceci permet d'insérer des caractères comme B<C-q>, par exemple.

source: Insert a tab character.
fr: Insérer un caractère de tabulation.

source: Insert the character typed.
fr: Insérer le caractère mentionné.

source: Drag the character before point forward over the character at point, moving point forward as well. If point is at the end of the line, then this transposes the two characters before point. Negative arguments have no effect.
fr: Échanger les caractères se trouvant devant et sous le curseur. Le curseur est avancé d'un caractère. À la fin d'une ligne, les caractères échangés sont les deux précédents. Les arguments négatifs n'ont aucun effet.

source: Drag the word before point past the word after point, moving point over that word as well. If point is at the end of the line, this transposes the last two words on the line.
fr: Déplace le mot avant le curseur au-delà du mot après le curseur et déplace aussi le curseur sur ce mot. Si le curseur est à la fin de la ligne, cela échange les deux derniers mots de la ligne.

source: Uppercase the current (or following) word. With a negative argument, uppercase the previous word, but do not move point.
fr: Transformer le mot courant (ou le suivant) en majuscules. Avec un argument négatif, agir sur le mot précédent mais ne pas déplacer le curseur.

source: Lowercase the current (or following) word. With a negative argument, lowercase the previous word, but do not move point.
fr: Transformer le mot courant (ou le suivant) en minuscules. Avec un argument négatif, agir sur le mot précédent mais ne pas déplacer le curseur.

source: Capitalize the current (or following) word. With a negative argument, capitalize the previous word, but do not move point.
fr: Passer en majuscule l'initiale du mot courant (ou du suivant). Avec un argument négatif, agir sur le mot précédent mais ne pas déplacer le curseur.

source: Toggle overwrite mode. With an explicit positive numeric argument, switches to overwrite mode. With an explicit non-positive numeric argument, switches to insert mode. This command affects only B<emacs> mode; B<vi> mode does overwrite differently. Each call to I<readline()> starts in insert mode. In overwrite mode, characters bound to B<self-insert> replace the text at point rather than pushing the text to the right. Characters bound to B<backward-delete-char> replace the character before point with a space. By default, this command is unbound.
fr: Basculer en mode d'écrasement. Avec un argument numérique explicite strictement positif, bascule en mode d'écrasement. Avec un argument numérique explicite négatif ou nul, bascule en mode d'insertion. Cette commande n'affecte que le mode B<emacs> ; le mode B<vi> écrase de façon différente. Chaque appel à I<readline()> démarre en mode d'insertion. En mode d'écrasement, les caractères associés à B<self-insert> remplacent le texte sous le curseur plutôt que de déplacer le texte vers la droite. Les caractères associés à B<backward-delete-char> remplacent le caractère avant le curseur par une espace. Par défaut, cette commande n'est pas associée.

source: Killing and Yanking
fr: Effacement et récupération

source: Kill the text from point to the end of the line.
fr: Effacer le texte depuis la position du curseur jusqu'à la fin de la ligne.

source: B<backward-kill-line (C-x Rubout)>
fr: B<backward-kill-line (C-x Effacement)>

source: Kill backward to the beginning of the line.
fr: Effacer en arrière jusqu'au début de ligne.

source: Kill backward from point to the beginning of the line. The killed text is saved on the kill-ring.
fr: Effacer le texte entre le début de la ligne et la position du curseur. Le texte est sauvegardé dans le tampon circulaire.

source: Kill all characters on the current line, no matter where point is.
fr: Effacer toute la ligne sans tenir compte de la position du curseur.

source: Kill from point to the end of the current word, or if between words, to the end of the next word. Word boundaries are the same as those used by B<forward-word>.
fr: Effacer le texte entre le curseur et la fin du mot courant ou, si entre des mots, jusqu'à la fin du mot suivant. Les limites des mots sont identiques à celles utilisées par B<forward-word>.

source: B<backward-kill-word (M-Rubout)>
fr: B<backward-kill-word (M-Effacement)>

source: Kill the word behind point. Word boundaries are the same as those used by B<backward-word>.
fr: Effacer le mot sous le curseur. Les limites de mots sont identiques à celles utilisées par B<backward-word>.

source: Kill the word behind point, using white space as a word boundary. The killed text is saved on the kill-ring.
fr: Effacer le mot sous le curseur, en utilisant une espace blanche comme limite de mot. Le texte effacé est sauvegardé dans le tampon circulaire.

source: Kill the word behind point, using white space and the slash character as the word boundaries. The killed text is saved on the kill-ring.
fr: Effacer le mot sous le curseur, en utilisant l'espace blanche et la barre oblique comme limites de mot. Le texte supprimé est sauvegardé dans le tampon circulaire.

source: Delete all spaces and tabs around point.
fr: Effacer toutes les espaces blanches et les tabulations autour du curseur.

source: Kill the text in the current region.
fr: Détruire le texte dans la zone courante.

source: Copy the text in the region to the kill buffer.
fr: Copier le texte de la zone vers le tampon circulaire.

source: Copy the word before point to the kill buffer. The word boundaries are the same as B<backward-word>.
fr: Copier le mot précédant le curseur dans le tampon circulaire. Les limites de mots sont identiques à celles de B<backward-word>.

source: Copy the word following point to the kill buffer. The word boundaries are the same as B<forward-word>.
fr: Copier le mot suivant le curseur dans le tampon circulaire. Les limites de mots sont identiques à celles de B<forward-word>.

source: Yank the top of the kill ring into the buffer at point.
fr: Récupérer le texte au sommet du tampon circulaire à la position du curseur dans le tampon.

source: Rotate the kill ring, and yank the new top. Only works following B<yank> or B<yank-pop>.
fr: Exécuter une rotation du tampon circulaire et récupérer le texte situé à son nouveau sommet. Ceci ne fonctionne qu'après B<yank> ou B<yank-pop>.

source: Numeric Arguments
fr: Arguments numériques

source: Add this digit to the argument already accumulating, or start a new argument. M-- starts a negative argument.
fr: Ajouter ce chiffre à l'argument en cours de rédaction ou créer un nouvel argument. M-- crée un argument négatif.

source: This is another way to specify an argument. If this command is followed by one or more digits, optionally with a leading minus sign, those digits define the argument. If the command is followed by digits, executing B<universal-argument> again ends the numeric argument, but is otherwise ignored. As a special case, if this command is immediately followed by a character that is neither a digit or minus sign, the argument count for the next command is multiplied by four. The argument count is initially one, so executing this function the first time makes the argument count four, a second time makes the argument count sixteen, and so on.
fr: Il s'agit d'une autre façon de spécifier un argument. Si cette commande est suivie d'un ou plusieurs chiffres facultativement précédés d'un signe moins, ces chiffres définissent l'argument. Si la commande est suivie de chiffres, une nouvelle exécution de B<universal-argument> termine l'argument numérique, mais est ignorée dans les autres cas. Par exception, si cette commande est suivie immédiatement par un caractère qui n'est ni un chiffre ni le signe moins, le compteur d'arguments de la commande suivante est multiplié par 4. Le compteur d'arguments est initialement à un, donc la première exécution de cette commande amène le compteur d'arguments à quatre, une seconde fois porte le compteur d'arguments à seize et ainsi de suite.

source: Completing
fr: Complètement

source: Attempt to perform completion on the text before point. B<Bash> attempts completion treating the text as a variable (if the text begins with B<$>), username (if the text begins with B<~>), hostname (if the text begins with B<@>), or command (including aliases and functions) in turn. If none of these produces a match, filename completion is attempted.
fr: Essayer d'effectuer un complètement du texte situé avant le curseur. B<Bash> effectue le complètement en considérant tour à tour le texte comme une variable (s'il commence par B<$>), un nom d'utilisateur (s'il commence par B<~>), un nom de machine (s'il commence par B<@>) ou une commande (y compris les alias et les fonctions). Si aucun ne correspond, un complètement de nom de fichier est essayé.

source: List the possible completions of the text before point.
fr: Affiche les complètements possibles pour le texte situé avant le curseur.

source: Insert all completions of the text before point that would have been generated by B<possible-completions>.
fr: Insérer avant le curseur l'ensemble des complètements qui auraient été produits par B<possible-completions>.

source: Similar to B<complete>, but replaces the word to be completed with a single match from the list of possible completions. Repeated execution of B<menu-complete> steps through the list of possible completions, inserting each match in turn. At the end of the list of completions, the bell is rung (subject to the setting of B<bell-style>) and the original text is restored. An argument of I<n> moves I<n> positions forward in the list of matches; a negative argument may be used to move backward through the list. This command is intended to be bound to B<TAB>, but is unbound by default.
fr: Analogue à B<complete>, mais en remplaçant le mot à compléter par une seule correspondance de la liste des complètements possibles. Des exécutions répétées de B<menu-complete> parcourent la liste des complètements possibles, en insérant chaque correspondance tour à tour. À la fin de la liste des complètements, une alarme est émise (selon la configuration de B<bell-style>) et le texte original est restauré. Un argument de I<n> déplace de I<n> positions dans la liste des correspondances. Un argument négatif peut être utilisé pour revenir en arrière dans la liste. Cette commande est destinée à être associée à la touche B<TAB>, mais ne l'est pas par défaut.

source: Deletes the character under the cursor if not at the beginning or end of the line (like B<delete-char>). If at the end of the line, behaves identically to B<possible-completions>. This command is unbound by default.
fr: Effacer le caractère sous le curseur sauf au début ou en fin de ligne (comme B<delete-char>). En fin de ligne, se comporte comme B<possible-completions>. Cette commande n'est associée à aucune touche par défaut.

source: Attempt filename completion on the text before point.
fr: Essayer le complètement des noms de fichiers sur le texte situé avant le curseur.

source: List the possible completions of the text before point, treating it as a filename.
fr: Afficher les complètements possibles du texte situé avant le curseur, traité comme un nom de fichier.

source: Attempt completion on the text before point, treating it as a username.
fr: Essayer le complètement sur le texte situé avant le curseur, en le traitant comme un nom d'utilisateur.

source: List the possible completions of the text before point, treating it as a username.
fr: Afficher les complètements possibles du texte situé avant le curseur, en le traitant comme un nom d'utilisateur.

source: Attempt completion on the text before point, treating it as a shell variable.
fr: Essayer le complètement sur le texte situé avant le curseur, en le traitant comme une variable de l'interpréteur.

source: List the possible completions of the text before point, treating it as a shell variable.
fr: Afficher les complètements possibles du texte situé avant le curseur, en le traitant comme une variable de l'interpréteur.

source: Attempt completion on the text before point, treating it as a hostname.
fr: Essayer le complètement sur le texte situé avant le curseur, en le traitant comme un nom de machine.

source: List the possible completions of the text before point, treating it as a hostname.
fr: Afficher les complètements possibles du texte situé avant le curseur, en le traitant comme un nom de machine.
