Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: A I<pipeline> is a sequence of one or more commands separated by the character B<|>. The format for a pipeline is:
fr: Une I<conduite> (I<pipeline>) est une suite d'une ou plusieurs commandes séparées par le caractère tube B<|>. Le format d'une conduite est :

source: [B<time> [B<-p>]] [ ! ] I<command> [ B<|> I<command2> ... ]
fr: [B<time> [B<-p>]] [ ! ] I<commande_1> [ B<|> I<commande_2> ... ]

source: The standard output of I<command> is connected via a pipe to the standard input of I<command2>. This connection is performed before any redirections specified by the command (see E<.SM> B<REDIRECTION> below).
fr: La sortie standard de la I<commande_1> est connectée par un tube à l'entrée standard de la I<commande_2>. Cette connexion est effectuée avant toute redirection spécifiée par la commande elle-même (voir E<.SM B<REDIRECTIONS>> plus bas).

source: The return status of a pipeline is the exit status of the last command, unless the B<pipefail> option is enabled. If B<pipefail> is enabled, the pipeline's return status is the value of the last (rightmost) command to exit with a non-zero status, or zero if all commands exit successfully. If the reserved word B<!> precedes a pipeline, the exit status of that pipeline is the logical negation of the exit status as described above. The shell waits for all commands in the pipeline to terminate before returning a value.
fr: L'état renvoyé par une conduite est l'état final de la dernière commande, à moins que l'option B<pipefail> soit activée. Si B<pipefail> est activée, l'état renvoyé par la conduite est la valeur de la dernière commande (la plus à droite) à terminer avec un état différent de zéro ou zéro si toutes les commandes se terminent avec succès. Si le mot réservé B<!> précède une conduite, l'état final de cette conduite sera la négation logique de l'état final tel que décrit plus haut. L'interpréteur attend que toutes les commandes de la conduite soient terminées avant de renvoyer une valeur.

source: If the B<time> reserved word precedes a pipeline, the elapsed as well as user and system time consumed by its execution are reported when the pipeline terminates. The B<-p> option changes the output format to that specified by POSIX. The E<.SM> B<TIMEFORMAT> variable may be set to a format string that specifies how the timing information should be displayed; see the description of E<.SM> B<TIMEFORMAT> under B<Shell Variables> below.
fr: Si le mot réservé B<time> précède une conduite, les temps passés par le programme en modes utilisateur et système sont indiqués quand la conduite se termine. L'option B<-p> modifie le format de sortie pour celui spécifié par POSIX. La variable E<.SM B<TIMEFORMAT>> peut contenir une chaîne de format indiquant comment les informations de chronométrage doivent être affichées ; consultez plus bas la descriptions de E<.SM B<TIMEFORMAT>> dans B<Variables de l'interpréteur>.

source: Each command in a pipeline is executed as a separate process (i.e., in a subshell).
fr: Chaque commande dans une conduite est exécutée comme un processus indépendant (c'est-à-dire dans un sous-interpréteur).

source: Lists
fr: Listes

source: A I<list> is a sequence of one or more pipelines separated by one of the operators B<;>, B<&>, B<&&>, or B<\(bv\(bv>, and optionally terminated by one of B<;>, B<&>, or B<E<lt>newlineE<gt>>.
fr: Une I<liste> est une suite d'une ou plusieurs conduites séparées par l'un des opérateurs B<;>, B<&>, B<&&> ou B<\(bv\(bv> et facultativement terminée par l'un au choix des B<;>, B<&> ou B<E<lt>saut de ligneE<gt>>.

source: Of these list operators, B<&&> and B<\(bv\(bv> have equal precedence, followed by B<;> and B<&,> which have equal precedence.
fr: Dans cette liste d'opérateurs, B<&&> et B<\(bv\(bv> ont une priorité identique, suivis par B<;> et B<&>, qui ont également une priorité identique.

source: A sequence of one or more newlines may appear in a I<list> instead of a semicolon to delimit commands.
fr: Une suite d'un ou plusieurs sauts de ligne peut apparaître dans une I<liste> à la place d'un point-virgule pour délimiter les commandes.

source: If a command is terminated by the control operator B<&>, the shell executes the command in the I<background> in a subshell. The shell does not wait for the command to finish, and the return status is 0. Commands separated by a B<;> are executed sequentially; the shell waits for each command to terminate in turn. The return status is the exit status of the last command executed.
fr: Si une commande se termine par l'opérateur de contrôle B<&>, l'interpréteur l'exécute en I<arrière-plan>, dans un sous-interpréteur. L'interpréteur n'attend pas que la commande se termine et l'état renvoyé est 0. Les commandes séparées par un B<;> sont exécutées successivement, l'interpréteur attend que chaque commande se termine tour à tour. L'état renvoyé est l'état final de la dernière commande exécutée.

source: The control operators B<&&> and B<\(bv\(bv> denote AND lists and OR lists, respectively. An AND list has the form
fr: Les opérateurs de contrôle B<&&> et B<\(bv\(bv> indiquent respectivement des listes de ET et des listes de OU. Une liste ET est de la forme

source: I<command1> B<&&> I<command2>
fr: I<commande_1> B<&&> I<commande_2>

source: I<command2> is executed if, and only if, I<command1> returns an exit status of zero.
fr: I<commande_2> est exécutée si, et seulement si, I<commande_1> renvoie un état final de zéro.

source: An OR list has the form
fr: Une liste OU a la forme

source: I<command1> B<\(bv\(bv> I<command2>
fr: I<commande_1> B<\(bv\(bv> I<commande_2>

source: I<command2> is executed if and only if I<command1> returns a non-zero exit status. The return status of AND and OR lists is the exit status of the last command executed in the list.
fr: I<commande_2> est exécutée si et seulement si I<commande_1> renvoie un état final différent de zéro. L'état renvoyé par des listes de ET et de OU est l'état final de la dernière commande exécutée dans la liste.

source: Compound Commands
fr: Commandes composées

source: A I<compound command> is one of the following:
fr: Une I<commande composée> est l'une des constructions suivantes :

source: (I<list>)
fr: (I<liste>)

source: I<list> is executed in a subshell environment (see E<.SM> B<COMMAND EXECUTION ENVIRONMENT> below). Variable assignments and builtin commands that affect the shell's environment do not remain in effect after the command completes. The return status is the exit status of I<list>.
fr: I<liste> est exécutée dans un sous-interpréteur (voir plus bas E<.SM B<ENVIRONNEMENT D'EXÉCUTION DES COMMANDES>>). Les affectations de variables et les commandes internes qui affectent l'environnement de l'interpréteur n'ont pas d'effet une fois que la commande se termine. L'état renvoyé est l'état final de la I<liste>.

source: { I<list>; }
fr: { I<liste>; }

source: I<list> is simply executed in the current shell environment. I<list> must be terminated with a newline or semicolon. This is known as a I<group command>. The return status is the exit status of I<list>. Note that unlike the metacharacters B<(> and B<)>, B<{> and B<}> are I<reserved words> and must occur where a reserved word is permitted to be recognized. Since they do not cause a word break, they must be separated from I<list> by whitespace.
fr: I<liste> est simplement exécutée avec l'environnement de l'interpréteur en cours. I<liste> doit se terminer par un caractère de saut de ligne ou un point-virgule. Cette construction est connue sous le nom de I<commandes groupées>. L'état renvoyé est l'état final de la I<liste>. Remarquez que contrairement aux métacaractères B<(> et B<)>, B<{> et B<}> sont des I<mots réservés> qui ne doivent apparaître que là où un mot réservé peut être reconnu. Puisqu'ils ne conduiront pas un découpage en mots, ils doivent être séparés de la I<liste> par une espace.

source: The I<expression> is evaluated according to the rules described below under E<.SM> B<ARITHMETIC EVALUATION>. If the value of the expression is non-zero, the return status is 0; otherwise the return status is 1. This is exactly equivalent to B<let ">I<expression>B<">.
fr: L'I<expression> est évaluée selon les règles décrites plus bas dans E<.SM B<ÉVALUATION ARITHMÉTIQUE>.> Si la valeur arithmétique de l'expression est différente de zéro, l'état renvoyé est 0 ; sinon l'état renvoyé est 1. Ceci est exactement équivalent à B<let ">I<expression>B<">.

source: Return a status of 0 or 1 depending on the evaluation of the conditional expression I<expression>. Expressions are composed of the primaries described below under E<.SM> B<CONDITIONAL EXPRESSIONS>. Word splitting and pathname expansion are not performed on the words between the B<[[> and B<]]>; tilde expansion, parameter and variable expansion, arithmetic expansion, command substitution, process substitution, and quote removal are performed. Conditional operators such as B<-f> must be unquoted to be recognized as primaries.
fr: Renvoie un état de 0 ou 1 selon l'évaluation de la condition I<expression>. Les conditions sont composées de primitives décrites plus bas dans E<.SM B<CONDITIONS>.> Le découpage en mots et le développement des chemins ne sont pas effectués sur les mots entre B<[[> et B<]]> ; le développement des tildes, des paramètres, des variables, le développement arithmétique, la substitution de commande et de processus, ainsi que la suppression des protections sont effectués. Les opérateurs conditionnels comme B<-f> ne doivent pas être protégés afin d'être reconnus comme primitives.

source: When the B<==> and B<!=> operators are used, the string to the right of the operator is considered a pattern and matched according to the rules described below under B<Pattern Matching>. If the shell option B<nocasematch> is enabled, the match is performed without regard to the case of alphabetic characters. The return value is 0 if the string matches (B<==>) or does not match (B<!=>) the pattern, and 1 otherwise. Any part of the pattern may be quoted to force it to be matched as a string.
fr: Quand les opérateurs B<==> et B<!=> sont utilisés, la chaîne placée à droite de l'opérateur est considérée comme étant un motif dont la correspondance est recherchée selon les règles décrites plus bas dans B<Motifs génériques>. Si l'option d'interpréteur B<nocasematch> est activée, la mise en correspondance est effectuée sans tenir compte de la casse (différence majuscule/minuscule) des caractères alphabétiques. La valeur renvoyée est 0 si les chaînes correspondent (B<==>) (ou respectivement ne correspondent pas (B<!=>) au motif et 1 sinon. Toute partie du motif peut être protégée pour la forcer à correspondre en tant que chaîne.

source: An additional binary operator, B<=~>, is available, with the same precedence as B<==> and B<!=>. When it is used, the string to the right of the operator is considered an extended regular expression and matched accordingly (as in I<regex>(3)). The return value is 0 if the string matches the pattern, and 1 otherwise. If the regular expression is syntactically incorrect, the conditional expression's return value is 2. If the shell option B<nocasematch> is enabled, the match is performed without regard to the case of alphabetic characters. Substrings matched by parenthesized subexpressions within the regular expression are saved in the array variable B<BASH_REMATCH>. The element of B<BASH_REMATCH> with index 0 is the portion of the string matching the entire regular expression. The element of B<BASH_REMATCH> with index I<n> is the portion of the string matching the I<n>th parenthesized subexpression.
fr: Un opérateur binaire supplémentaire, B<=~>, est disponible, avec la même priorité que B<==> et B<!=>. Lorsqu'il est utilisé, la chaîne à droite de l'opérateur est considérée comme une expression rationnelle étendue et est mise en correspondance en conséquence (comme avec B<regex>(3)). La valeur renvoyée est 0 si la chaîne correspond au motif et 1 si elle ne correspond pas. Si l'expression rationnelle n'est pas syntaxiquement correcte, la valeur renvoyée de l'expression conditionnelle est 2. Si l'option d'interpréteur B<nocasematch> est activée, la mise en correspondance est effectuée sans tenir compte de la casse. Les sous-chaînes mises en correspondance avec des sous-expressions entre parenthèses dans l'expression rationnelle sont sauvegardées dans la variable tableau B<BASH_REMATCH>. L'élément d'indice 0 de B<BASH_REMATCH> est la partie de la chaîne correspondant à l'expression rationnelle complète. L'élément d'indice I<n> de B<BASH_REMATCH> est la partie de la chaîne correspondant à la I<n>ème sous-expression entre parenthèses.

source: Expressions may be combined using the following operators, listed in decreasing order of precedence:
fr: Les expressions peuvent être combinées en utilisant les opérateurs suivants, décrits par ordre de priorité décroissante :

source: Returns the value of I<expression>. This may be used to override the normal precedence of operators.
fr: Renvoie la valeur de l'I<expression>. Cela peut être utilisé pour surpasser la priorité normale des opérateurs.

source: True if I<expression> is false.
fr: Vrai si I<expression> est fausse.

source: True if both I<expression1> and I<expression2> are true.
fr: Vrai si I<expression1> et I<expression2> sont toutes les deux vraies.

source: True if either I<expression1> or I<expression2> is true.
fr: Vrai si I<expression1> ou I<expression2> est vraie.

source: The B<&&> and
fr: Les opérateurs B<&&> et

source: operators do not evaluate I<expression2> if the value of I<expression1> is sufficient to determine the return value of the entire conditional expression.
fr: n'évaluent pas I<expression2> si la valeur de I<expression1> suffit à déterminer la valeur renvoyée par la condition tout entière.

source: B<for> I<name> [ B<in> I<word> ] ; B<do> I<list> ; B<done>
fr: B<for> I<nom> [ B<in> I<mot> ] ; B<do> I<liste> ; B<done>

source: The list of words following B<in> is expanded, generating a list of items. The variable I<name> is set to each element of this list in turn, and I<list> is executed each time. If the B<in> I<word> is omitted, the B<for> command executes I<list> once for each positional parameter that is set (see E<.SM> B<PARAMETERS> below). The return status is the exit status of the last command that executes. If the expansion of the items following B<in> results in an empty list, no commands are executed, and the return status is 0.
fr: La liste de mots suivant B<in> est développée, produisant une liste d'éléments. La variable I<nom> prend tour à tour la valeur de chacun des éléments et I<liste> est exécutée à chaque fois. Si B<in> I<mot> est omis, la commande B<for> exécute la I<liste> une fois pour chacun des paramètres positionnels existants (voir E<.SM B<PARAMÈTRES>> plus bas). L'état renvoyé est l'état final de la dernière commande exécutée. Si le développement des éléments suivant B<in> conduit à une liste vide, aucune commande n'est exécutée et l'état renvoyé est 0.

source: B<for> (( I<expr1> ; I<expr2> ; I<expr3> )) ; B<do> I<list> ; B<done>
fr: B<for> (( I<expr1> ; I<expr2> ; I<expr3> )) ; B<do> I<liste> ; B<done>

source: First, the arithmetic expression I<expr1> is evaluated according to the rules described below under E<.SM> B<ARITHMETIC EVALUATION>. The arithmetic expression I<expr2> is then evaluated repeatedly until it evaluates to zero. Each time I<expr2> evaluates to a non-zero value, I<list> is executed and the arithmetic expression I<expr3> is evaluated. If any expression is omitted, it behaves as if it evaluates to 1. The return value is the exit status of the last command in I<list> that is executed, or false if any of the expressions is invalid.
fr: L'expression arithmétique I<expr1> est d'abord évaluée selon les règles décrites plus bas sous E<.SM B<ÉVALUATION ARITHMÉTIQUE>.> L'expression arithmétique I<expr2> est ensuite évaluée répétitivement jusqu'à valoir zéro. Chaque fois que I<expr2> est évaluée en une valeur différente de zéro, I<liste> est exécutée et l'expression arithmétique I<expr3> est évaluée. Si une quelconque des expressions est omise, elle est considérée comme s'évaluant à 1. La valeur renvoyée est l'état final de la dernière commande dans I<liste> qui est exécutée ou faux si l'une quelconque des expressions est incorrecte.

source: B<select> I<name> [ B<in> I<word> ] ; B<do> I<list> ; B<done>
fr: B<select> I<nom> [ B<in> I<mot> ] ; B<do> I<liste> ; B<done>

source: The list of words following B<in> is expanded, generating a list of items. The set of expanded words is printed on the standard error, each preceded by a number. If the B<in> I<word> is omitted, the positional parameters are printed (see E<.SM> B<PARAMETERS> below). The B<PS3> prompt is then displayed and a line read from the standard input. If the line consists of a number corresponding to one of the displayed words, then the value of I<name> is set to that word. If the line is empty, the words and prompt are displayed again. If EOF is read, the command completes. Any other value read causes I<name> to be set to null. The line read is saved in the variable B<REPLY>. The I<list> is executed after each selection until a B<break> command is executed. The exit status of B<select> is the exit status of the last command executed in I<list>, or zero if no commands were executed.
fr: La liste de mots à la suite de B<in> est développée, produisant une liste d'éléments. L'ensemble des mots développés est imprimé sur la sortie d'erreur standard, chacun précédé par un nombre. Si B<in> I<mot> est omis, les paramètres positionnels sont imprimés (voir E<.SM B<PARAMÈTRES>> plus bas). L'invite B<PS3> est affichée et une ligne est lue depuis l'entrée standard. Si la ligne est constituée d'un nombre correspondant à l'un des mots affichés, alors ce mot est affecté à la valeur de la variable I<nom>. Si la ligne est vide, les mots et l'invite sont affichés à nouveau. Si une fin de fichier (EOF) est lue, la commande se termine. Pour toutes les autres valeurs lues, la variable I<nom> est mise à vide. La ligne lue est conservée dans la variable B<REPLY>. La I<liste> est exécutée après chaque sélection, jusqu'à ce qu'une commande B<break> soit atteinte. L'état final de B<select> est l'état final de la dernière commande exécutée dans la I<liste> ou zéro si aucune commande n'a été exécutée.

source: B<case> I<word> B<in> [ [(] I<pattern> [ B<|> I<pattern> ] ... ) I<list> ;; ] ... B<esac>
fr: B<case> I<mot> B<in> [ [(] I<motif> [ B<|> I<motif> ] ... ) I<liste> ;; ] ... B<esac>

source: A B<case> command first expands I<word>, and tries to match it against each I<pattern> in turn, using the same matching rules as for pathname expansion (see B<Pathname Expansion> below). The I<word> is expanded using tilde expansion, parameter and variable expansion, arithmetic substitution, command substitution, process substitution and quote removal. Each I<pattern> examined is expanded using tilde expansion, parameter and variable expansion, arithmetic substitution, command substitution, and process substitution. If the shell option B<nocasematch> is enabled, the match is performed without regard to the case of alphabetic characters. When a match is found, the corresponding I<list> is executed. After the first match, no subsequent matches are attempted. The exit status is zero if no pattern matches. Otherwise, it is the exit status of the last command executed in I<list>.
fr: Une commande B<case> commence d'abord par développer le I<mot>, puis essaye de le mettre en correspondance tour à tour avec chacun des I<motifs> en utilisant les mêmes règles que pour le développement des chemins (voir plus bas B<Développement des chemins>). Le I<mot> est développé en utilisant le développement du tilde, le développement des paramètres et des variables, la substitution arithmétique, la substitution de commande, la substitution de processus et la suppression des protections. Chaque I<motif> examiné est développé en utilisant le développement du tilde, le développement des paramètres et des variables, la substitution arithmétique, la substitution de commande et la substitution de processus. Si l'option d'interpréteur B<nocasematch> est activée, la mise en correspondance est effectuée sans tenir compte de la casse des caractères alphabétiques. Quand une correspondance est trouvée, la I<liste> associée est exécutée. Dès qu'un motif correct a été trouvé, il n'y a plus d'autre essai. L'état final est zéro si aucun motif ne correspond. Sinon il est l'état final de la dernière commande exécutée dans la I<liste>.

source: B<if> I<list>; B<then> I<list;> [ B<elif> I<list>; B<then> I<list>; ] ... [ B<else> I<list>; ] B<fi>
fr: B<if> I<liste>; B<then> I<liste>; [ B<elif> I<liste>; B<then> I<liste>; ] ... [ B<else> I<liste>; ] B<fi>

source: The B<if> I<list> is executed. If its exit status is zero, the B<then> I<list> is executed. Otherwise, each B<elif> I<list> is executed in turn, and if its exit status is zero, the corresponding B<then> I<list> is executed and the command completes. Otherwise, the B<else> I<list> is executed, if present. The exit status is the exit status of the last command executed, or zero if no condition tested true.
fr: La I<liste> du B<if> est exécutée. Si son état final est zéro, la I<liste> du B<then> est exécutée. Sinon, chacune des I<listes> des B<elif> est exécutée tour à tour et si son état final est zéro, la I<liste> du B<then> associé est exécutée et la commande termine. Sinon, la I<liste> du B<else>, si présente, est exécutée. L'état final est l'état final de la dernière commande exécutée ou zéro si aucune condition n'a été satisfaite.

source: B<while> I<list>; B<do> I<list>; B<done>
fr: B<while> I<liste>; B<do> I<liste>; B<done>

source: B<until> I<list>; B<do> I<list>; B<done>
fr: B<until> I<liste>; B<do> I<liste>; B<done>

source: The B<while> command continuously executes the B<do> I<list> as long as the last command in I<list> returns an exit status of zero. The B<until> command is identical to the B<while> command, except that the test is negated; the B<do> I<list> is executed as long as the last command in I<list> returns a non-zero exit status. The exit status of the B<while> and B<until> commands is the exit status of the last B<do> I<list> command executed, or zero if none was executed.
fr: La commande B<while> répète la I<liste> du B<do> tant que la dernière commande de la I<liste> du B<while> renvoie un état final de zéro. La commande B<until> est identique à la commande B<while>, sauf que le test est inversé ; la I<liste> du B<do> est exécutée tant que la dernière commande de la I<liste> renvoie un état final différent de zéro. L'état final des commandes B<while> et B<until> est l'état final de la dernière commande exécutée dans la I<liste> du B<do> ou zéro si aucune commande n'a été exécutée.

source: Shell Function Definitions
fr: Définitions des fonctions de l'interpréteur

source: A shell function is an object that is called like a simple command and executes a compound command with a new set of positional parameters. Shell functions are declared as follows:
fr: Une fonction de l'interpréteur est un objet qui est appelé comme une commande simple et qui exécute une commande composée avec un nouveau jeu de paramètres positionnels. Les fonctions de l'interpréteur sont déclarées de la façon suivante :

source: [ B<function> ] I<name> () I<compound-command> [I<redirection>]
fr: [ B<function> ] I<nom> () I<commande-composée> [I<redirection>]
