Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: The shell exits by default upon receipt of a E<.SM> B<SIGHUP>. Before exiting, an interactive shell resends the E<.SM> B<SIGHUP> to all jobs, running or stopped. Stopped jobs are sent E<.SM> B<SIGCONT> to ensure that they receive the E<.SM> B<SIGHUP>. To prevent the shell from sending the signal to a particular job, it should be removed from the jobs table with the B<disown> builtin (see E<.SM> B<SHELL BUILTIN COMMANDS> below) or marked to not receive E<.SM> B<SIGHUP> using B<disown -h>.
fr: Par défaut, l'interpréteur termine à la réception de E<.SM B<SIGHUP>.> Avant de terminer, un interpréteur interactif renvoie le E<.SM B<SIGHUP>> à toutes les tâches en cours ou suspendues. Les tâches suspendues reçoivent aussi E<.SM B<SIGCONT>> pour s'assurer qu'elles reçoivent bien le E<.SM B<SIGHUP>.> Pour empêcher l'interpréteur d'envoyer le signal à une tâche particulière, elle devrait être retirée de la table des tâches avec la commande interne B<disown> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>) ou marquée comme exemptée de E<.SM B<SIGHUP>> en utilisant B<disown -h>.

source: If the B<huponexit> shell option has been set with B<shopt>, B<bash> sends a E<.SM> B<SIGHUP> to all jobs when an interactive login shell exits.
fr: Si l'option d'interpréteur B<huponexit> a été mise avec la fonction B<shopt>, B<bash> envoie un signal E<.SM B<SIGHUP>> à toutes les tâches lorsqu'un interpréteur de commandes de connexion interactif termine.

source: If B<bash> is waiting for a command to complete and receives a signal for which a trap has been set, the trap will not be executed until the command completes. When B<bash> is waiting for an asynchronous command via the B<wait> builtin, the reception of a signal for which a trap has been set will cause the B<wait> builtin to return immediately with an exit status greater than 128, immediately after which the trap is executed.
fr: Lorsque B<bash> attend qu'une commande se termine et qu'il reçoit un signal pour lequel une capture a été mise, la capture ne sera pas exécutée tant que la commande n'est pas terminée. Lorsque B<bash> attend la fin d'une commande asynchrone par la commande interne B<wait>, la réception d'un signal pour lequel une capture a été mise conduira à un retour immédiat de la commande interne B<wait> avec un état final supérieur à 128, à la suite de quoi la capture est immédiatement exécutée.

source: JOB CONTROL
fr: CONTRÔLE DES TÂCHES

source: I<Job control> refers to the ability to selectively stop (I<suspend>) the execution of processes and continue (I<resume>) their execution at a later point. A user typically employs this facility via an interactive interface supplied jointly by the system's terminal driver and B<bash>.
fr: Le I<contrôle des tâches> permet de suspendre (I<suspend>) sélectivement l'exécution d'un processus et de la reprendre (I<resume>) ultérieurement. L'utilisateur bénéficie généralement de cette possibilité grâce à l'action conjointe du pilote de terminal du système et de B<bash>.

source: The shell associates a I<job> with each pipeline. It keeps a table of currently executing jobs, which may be listed with the B<jobs> command. When B<bash> starts a job asynchronously (in the I<background>), it prints a line that looks like:
fr: L'interpréteur associe une I<tâche> à chaque conduite. Il maintient une table des tâches en cours d'exécution, cette table pouvant être affichée avec la commande B<jobs>. Quand B<bash> lance une tâche de façon asynchrone (en I<arrière-plan>), il affiche une ligne quiressemble à :

source: indicating that this job is job number 1 and that the process ID of the last process in the pipeline associated with this job is 25647. All of the processes in a single pipeline are members of the same job. B<Bash> uses the I<job> abstraction as the basis for job control.
fr: Cette ligne indique que la tâche est la tâche numéro 1 et que le PID du dernier processus dans la conduite associée à cette tâche est 25647. Tous les processus d'une même conduite font partie de la même tâche. B<Bash> utilise la notion de I<tâche> comme base du contrôle des tâches.

source: To facilitate the implementation of the user interface to job control, the operating system maintains the notion of a I<current terminal process group ID>. Members of this process group (processes whose process group ID is equal to the current terminal process group ID) receive keyboard-generated signals such as E<.SM> B<SIGINT>. These processes are said to be in the I<foreground>. I<Background> processes are those whose process group ID differs from the terminal's; such processes are immune to keyboard-generated signals. Only foreground processes are allowed to read from or write to the terminal. Background processes which attempt to read from (write to) the terminal are sent a E<.SM> B<SIGTTIN (SIGTTOU)> signal by the terminal driver, which, unless caught, suspends the process.
fr: Pour faciliter l'implémentation d'une interface utilisateur pour le contrôle de tâches, le système introduit la notion d'I<ID de groupe de processus associés à un terminal>. Les membres de ce groupe de processus (processus dont le GID est égal au Process Group ID du terminal courant) reçoivent les signaux émis par le clavier comme E<.SM B<SIGINT>.> Ces processus sont dits être au I<premier plan>. Les processus en I<arrière-plan> sont ceux dont le Process-GID diffère de celui du terminal ; ils sont indifférents aux signaux émis par le clavier. Seuls les processus au premier plan peuvent lire depuis le terminal ou y écrire. Les processus en arrière-plan qui tentent une lecture (ou une écriture) dans le terminal reçoivent un signal E<.SM B<SIGTTIN (SIGTTOU)>> émis par le pilote du terminal, qui, sauf interception, suspend le processus.

source: If the operating system on which B<bash> is running supports job control, B<bash> contains facilities to use it. Typing the I<suspend> character (typically B<^Z>, Control-Z) while a process is running causes that process to be stopped and returns control to B<bash>. Typing the I<delayed suspend> character (typically B<^Y>, Control-Y) causes the process to be stopped when it attempts to read input from the terminal, and control to be returned to B<bash>. The user may then manipulate the state of this job, using the B<bg> command to continue it in the background, the B<fg> command to continue it in the foreground, or the B<kill> command to kill it. A B<^Z> takes effect immediately, and has the additional side effect of causing pending output and typeahead to be discarded.
fr: Si le système d'exploitation sur lequel B<bash> fonctionne permet le contrôle des tâches, B<bash> fournit des outils pour l'utiliser. La frappe d'un caractère de I<suspension> (généralement B<^Z>, Contrôle-Z) pendant l'exécution d'un processus conduit à la suspension de celui-ci et redonne la main à B<bash>. La frappe d'un caractère de I<suspension différée> (généralement B<^Y>, Contrôle-Y) conduira à la suspension du processus au moment où il tentera de lire des saisies depuis le terminal et la main reviendra à B<bash>. L'utilisateur peut alors manipuler l'état de cette tâche en utilisant la commande B<bg> (background = arrière-plan) pour en continuer l'exécution en arrière-plan, la commande B<fg> (foreground = premier plan) pour la continuer au premier plan ou encore la commande B<kill> pour la tuer. Un B<^Z> s'applique immédiatement et a pour effet de bord d'éliminer les sorties et saisies en attente.

source: There are a number of ways to refer to a job in the shell. The character B<%> introduces a job name. Job number I<n> may be referred to as B<%n>. A job may also be referred to using a prefix of the name used to start it, or using a substring that appears in its command line. For example, B<%ce> refers to a stopped B<ce> job. If a prefix matches more than one job, B<bash> reports an error. Using B<%?ce>, on the other hand, refers to any job containing the string B<ce> in its command line. If the substring matches more than one job, B<bash> reports an error. The symbols B<%%> and B<%+> refer to the shell's notion of the I<current job>, which is the last job stopped while it was in the foreground or started in the background. The I<previous job> may be referenced using B<%->. In output pertaining to jobs (e.g., the output of the B<jobs> command), the current job is always flagged with a B<+>, and the previous job with a B<->. A single % (with no accompanying job specification) also refers to the current job.
fr: Il y a plusieurs façons de faire référence à une tâche. Le caractère B<%> introduit un nom de tâche. La tâche numéro I<n> peut être notée B<%n>. On peut également faire référence à une tâche en utilisant un préfixe du nom utilise pour le lancer ou une sous-chaîne qui apparaît dans sa ligne de commande. Par exemple, B<%ce> se réfère à une tâche suspendue nommée B<ce>. Si ce préfixe correspond à plusieurs tâches, B<bash> signale une erreur. D'autre part, B<%?ce>, fait référence à n'importe quel tâche contenant la chaîne B<ce> dans sa ligne de commande. Si la sous-chaîne correspond à plusieurs tâches, B<bash> signale une erreur. Les symboles B<%%> et B<%+> se réfèrent à la notion de I<tâche courante> de l'interpréteur, c'est-à-dire la dernière tâche suspendue alors qu'elle était au premier plan ou démarrée en arrière-plan. La I<tâche précédente> peut être désignée en utilisant B<%->. Dans les affichages se rapportant aux tâches (par exemple la sortie de la commande B<jobs>), la tâche courante est toujours annotée d'un B<+> et la tâche précédente d'un B<->. Un simple % (non accompagné de spécification de tâche) désigne également la tâche courante.

source: Simply naming a job can be used to bring it into the foreground: B<%1> is a synonym for B<``fg %1''>, bringing job 1 from the background into the foreground. Similarly, B<``%1 &''> resumes job 1 in the background, equivalent to B<``bg %1''>.
fr: Il suffit de nommer une tâche pour la ramener au premier plan : B<%1> est synonyme de B<« fg %1 »> et ramène la tâche 1 de l'arrière-plan vers le premier plan. De même, B<« %1 & »> reprend la tâche 1 en arrière-plan, de façon équivalente à B<« bg %1 »>.

source: The shell learns immediately whenever a job changes state. Normally, B<bash> waits until it is about to print a prompt before reporting changes in a job's status so as to not interrupt any other output. If the B<-b> option to the B<set> builtin command is enabled, B<bash> reports such changes immediately. Any trap on E<.SM> B<SIGCHLD> is executed for each child that exits.
fr: L'interpréteur est immédiatement prévenu lorsqu'une tâche change d'état. Normalement B<bash> attend d'être prêt à afficher son interpréteur avant de signaler des changements dans l'état des tâches, afin de ne pas interrompre toute autre sortie. Si l'option B<-b> de la commande interne B<set> est activée, B<bash> signalera de telles modifications immédiatement. Toute capture sur E<.SM B<SIGCHLD>> est exécutée pour chaque enfant qui termine.

source: If an attempt to exit B<bash> is made while jobs are stopped, the shell prints a warning message. The B<jobs> command may then be used to inspect their status. If a second attempt to exit is made without an intervening command, the shell does not print another warning, and the stopped jobs are terminated.
fr: Si une tentative est faite de terminer B<bash> alors que des tâches sont suspendues, l'interpréteur affiche un message d'avertissement. La commande B<jobs> peut alors être utilisée pour examiner leur états. Si une deuxième tentative est faite de terminer sans commande intercalaire, l'interpréteur n'affiche aucun autre avertissement et les tâches suspendues sont terminées.

source: PROMPTING
fr: INVITES

source: When executing interactively, B<bash> displays the primary prompt E<.SM> B<PS1> when it is ready to read a command, and the secondary prompt E<.SM> B<PS2> when it needs more input to complete a command. B<Bash> allows these prompt strings to be customized by inserting a number of backslash-escaped special characters that are decoded as follows:
fr: Quand il est exécuté de façon interactive, B<bash> affiche l'invite de base E<.SM B<PS1>> dès qu'il est prêt à lire une commande et l'invite secondaire E<.SM B<PS2>> quand il a besoin de plus de saisies pour exécuter une commande. B<Bash> permet de personnaliser ces chaînes d'invite, en insérant un certain nombre de suites de caractères spéciaux d'échappement par des contre-obliques qui sont décodés comme suit :

source: an ASCII bell character (07)
fr: un caractère ASCII d'alarme (07)

source: the date in "Weekday Month Date" format (e.g., "Tue May 26")
fr: la date au format « Jour_de_la_semaine Mois Quantième » (par exemple : « Tue May 26 »)

source: the I<format> is passed to I<strftime>(3) and the result is inserted into the prompt string; an empty I<format> results in a locale-specific time representation. The braces are required
fr: le I<format> est passé à I<strftime>(3) et le résultat est inséré dans la chaîne de l'invite ; un I<format> vide implique une représentation du temps spécifique aux paramètres linguistiques régionaux. Les accolades sont nécessaires.

source: an ASCII escape character (033)
fr: un caractère d'échappement ASCII (033)

source: the hostname up to the first `.'
fr: le nom de la machine, jusqu'au premier point « . »

source: the hostname
fr: le nom de la machine

source: the number of jobs currently managed by the shell
fr: le nombre de tâches actuellement gérées par l'interpréteur

source: the basename of the shell's terminal device name
fr: le nom de base du nom de périphérique de terminal de l'interpréteur

source: newline
fr: saut de ligne

source: the name of the shell, the basename of B<$0> (the portion following the final slash)
fr: le nom de l'interpréteur, c'est-à-dire le nom de base de B<$0> (la portion suivant là dernière barre oblique)

source: the current time in 24-hour HH:MM:SS format
fr: l'heure actuelle au format HH:MM:SS sur 24 heures

source: the current time in 12-hour HH:MM:SS format
fr: l'heure actuelle au format HH:MM:SS sur 12 heures

source: the current time in 12-hour am/pm format
fr: l'heure actuelle sur 12 heures au format HH:MM am/pm

source: the current time in 24-hour HH:MM format
fr: l'heure actuelle au format HH:MM sur 24 heures

source: the username of the current user
fr: le nom de l'utilisateur

source: the version of B<bash> (e.g., 2.00)
fr: la version de B<bash> (par exemple, 2.00)

source: the release of B<bash>, version + patch level (e.g., 2.00.0)
fr: le numéro de version complet (avec niveau de correctifs) de B<bash>, (par exemple, 2.00.0)

source: the current working directory, with B<$HOME> abbreviated with a tilde
fr: le répertoire de travail courant, avec B<$HOME> abrégé en tilde (« ~ »)

source: the basename of the current working directory, with B<$HOME> abbreviated with a tilde
fr: le nom de base du répertoire de travail courant, avec B<$HOME> abrégé en tilde (« ~ »)

source: the history number of this command
fr: le numéro d'historique de la commande

source: the command number of this command
fr: le numéro de la commande

source: if the effective UID is 0, a B<#>, otherwise a B<$>
fr: B<#> si l'UID effectif est 0, B<$> sinon

source: the character corresponding to the octal number I<nnn>
fr: le caractère de code octal I<nnn>

source: a backslash
fr: une contre-oblique

source: begin a sequence of non-printing characters, which could be used to embed a terminal control sequence into the prompt
fr: débute une suite de caractères non imprimables, qui peuvent être utilisés pour inclure une suite de caractères de contrôle du terminal dans l'interpréteur

source: end a sequence of non-printing characters
fr: fin d'une suite de caractères non imprimables

source: The command number and the history number are usually different: the history number of a command is its position in the history list, which may include commands restored from the history file (see E<.SM> B<HISTORY> below), while the command number is the position in the sequence of commands executed during the current shell session. After the string is decoded, it is expanded via parameter expansion, command substitution, arithmetic expansion, and quote removal, subject to the value of the B<promptvars> shell option (see the description of the B<shopt> command under E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: Le numéro de commande et le numéro d'historique sont généralement différents : le numéro d'historique d'une commande correspond à sa position dans la file d'historique qui peut contenir des commandes relues depuis cette liste (voir E<.SM B<HISTORIQUE>> plus bas), alors que le numéro de commande est simplement une position dans la suite de commandes exécutées depuis le début de la session d'interpréteur courante. Après que la chaîne a été décodée, elle est soumise au développement des paramètres, à la substitution de commande, au développement arithmétique au découpage des mots et à la suppression des protections, selon la valeur de l'option d'interpréteur B<promptvars> (voir plus bas la description de B<shopt> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: This is the library that handles reading input when using an interactive shell, unless the B<--noediting> option is given at shell invocation. By default, the line editing commands are similar to those of emacs. A vi-style line editing interface is also available. To turn off line editing after the shell is running, use the B<+o emacs> or B<+o vi> options to the B<set> builtin (see E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: C'est la bibliothèque qui gère la lecture des saisies lors des sessions interactives de l'interpréteur, à moins que l'option B<--noediting> ne soit indiquée à l'appel de l'interpréteur. Par défaut les commandes d'édition de ligne sont similaires à celles d'emacs. Une interface d'édition de ligne dans le style vi est aussi disponible. Pour arrêter l'édition de ligne après le démarrage de l'interpréteur, utiliser l'option B<+o emacs> ou B<+o vi> de la commande interne B<set> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: Readline Notation
fr: Notation readline

source: In this section, the emacs-style notation is used to denote keystrokes. Control keys are denoted by C-I<key>, e.g., C-n means Control-N. Similarly, I<meta> keys are denoted by M-I<key>, so M-x means Meta-X. (On keyboards without a I<meta> key, M-I<x> means ESC I<x>, i.e., press the Escape key then the I<x> key. This makes ESC the I<meta prefix>. The combination M-C-I<x> means ESC-Control-I<x>, or press the Escape key then hold the Control key while pressing the I<x> key.)
fr: Dans ce paragraphe on utilisera la notation « à la emacs » pour indiquer les frappes de touches. Les touches Contrôle sont notées C-I<touche>, par exemple C-n signifie Contrôle-N. De même, les touches I<Méta> sont notées par M-I<touche>, ainsi M-x signifie Méta-X. (Sur les claviers sans touches I<Méta>, M-I<x> signifie ESC I<x>, c'est-à-dire presser la touche d'Échappement puis la touche I<x>. Cela fait de ESC le I<préfixe méta>. La combinaison M-C-I<x> signifie ESC-Contrôle-I<x> ou encore presser la touche d'Échappement puis maintenez la touche Contrôle enfoncée tout en pressant la touche I<x>.)

source: Readline commands may be given numeric I<arguments>, which normally act as a repeat count. Sometimes, however, it is the sign of the argument that is significant. Passing a negative argument to a command that acts in the forward direction (e.g., B<kill-line>) causes that command to act in a backward direction. Commands whose behavior with arguments deviates from this are noted below.
fr: Les commandes readline peuvent recevoir des I<arguments> numériques, qui fonctionnent en règle générale comme compteurs de répétitions. Parfois, cependant, c'est le signe de l'argument qui est significatif. L'utilisation d'un argument négatif pour une commande agissant dans un sens donné (par ex. B<kill-line>) conduit cette commande à agir dans la direction opposée. Les commandes dont le comportement avec les arguments diffère de ceci sont indiquées plus bas.

source: When a command is described as I<killing> text, the text deleted is saved for possible future retrieval (I<yanking>). The killed text is saved in a I<kill ring>. Consecutive kills cause the text to be accumulated into one unit, which can be yanked all at once. Commands which do not kill text separate the chunks of text on the kill ring.
fr: Lorsqu'une commande est indiquée comme I<détruisant> du texte, le texte effacé est en fait sauvegardé pour une éventuelle récupération ultérieure (I<yanking>). Il est conservé dans un tampon circulaire. Les suppressions successives conduisent à l'accumulation du texte en un seul bloc qui peut être récupéré en une fois. Les commandes non destructrices séparent les blocs de textes dans le tampon circulaire.

source: Readline Initialization
fr: Initialisation de readline

source: Readline is customized by putting commands in an initialization file (the I<inputrc> file). The name of this file is taken from the value of the E<.SM> B<INPUTRC> variable. If that variable is unset, the default is I<~/.inputrc>. When a program which uses the readline library starts up, the initialization file is read, and the key bindings and variables are set. There are only a few basic constructs allowed in the readline initialization file. Blank lines are ignored. Lines beginning with a B<#> are comments. Lines beginning with a B<$> indicate conditional constructs. Other lines denote key bindings and variable settings.
fr: Readline est personnalisé en mettant des commandes dans un fichier d'initialisation (le fichier I<inputrc>). Le nom de ce fichier est pris dans la variable de l'interpréteur E<.SM B<INPUTRC>.> Si cette variable est inexistante, le nom par défaut est I<~/.inputrc>. Lorsqu'un programme utilisant la bibliothèque readline démarre, le fichier d'initialisation est lu et les raccourcis clavier et les variables sont mis en place. Il n'y a que quelques constructions élémentaires de possibles dans le fichier d'initialisation de readline. Les lignes blanches sont ignorées. Les lignes commençant par B<#> sont des commentaires. Les lignes commençant par B<$> indiquent des constructions conditionnelles. Les autres lignes indiquent des raccourcis clavier et des paramétrages de variables.

source: The default key-bindings may be changed with an I<inputrc> file. Other programs that use this library may add their own commands and bindings.
fr: Les raccourcis clavier par défaut peuvent être modifiés par un fichier I<inputrc>. D'autres programmes qui utilisent cette bibliothèque peuvent ajouter leurs propres commandes et raccourcis.

source: For example, placing
fr: Par exemple, en plaçant

source: into the I<inputrc> would make M-C-u execute the readline command I<universal-argument>.
fr: dans le fichier I<inputrc>, on associera la suite de touches M-C-u à la commande readline I<universal-argument>.

source: The following symbolic character names are recognized: I<RUBOUT>, I<DEL>, I<ESC>, I<LFD>, I<NEWLINE>, I<RET>, I<RETURN>, I<SPC>, I<SPACE>, and I<TAB>.
fr: Les caractères symboliques suivants sont acceptés : I<RUBOUT>, I<DEL>, I<ESC>, I<LFD>, I<NEWLINE>, I<RET>, I<RETURN>, I<SPC>, I<SPACE> et I<TAB>.

source: In addition to command names, readline allows keys to be bound to a string that is inserted when the key is pressed (a I<macro>).
fr: En plus des noms de commandes, readline permet d'associer à une touche une chaîne de caractères qui sera insérée lorsque la touche est pressée (une I<macro>).

source: Readline Key Bindings
fr: Raccourcis clavier readline
