Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: Treat unset variables as an error when performing parameter expansion. If expansion is attempted on an unset variable, the shell prints an error message, and, if not interactive, exits with a non-zero status.
fr: Considérer les variables inexistantes comme des erreurs lors du développement des paramètres. Si on tente de développer une variable inexistante, l'interpréteur affiche un message d'erreur et, s'il n'est pas interactif, termine avec un état différent de zéro.

source: Print shell input lines as they are read.
fr: Affichage les lignes en entrée de l'interpréteur lorsqu'elles sont lues.

source: After expanding each I<simple command>, B<for> command, B<case> command, B<select> command, or arithmetic B<for> command, display the expanded value of E<.SM> B<PS4>, followed by the command and its expanded arguments or associated word list.
fr: Après le développement de chaque I<commande simple>, commande B<for>, commande B<case>, commande B<select> ou commande B<for> arithmétique, B<bash> affiche la valeur de E<.SM B<PS4>,> suivie par la commande et ses arguments développés ou la liste de mots associés.

source: The shell performs brace expansion (see B<Brace Expansion> above). This is on by default.
fr: L'interpréteur effectue le développement des accolades (voir B<Développement des accolades> plus haut). Cette option est active par défaut.

source: If set, B<bash> does not overwrite an existing file with the B<E<gt>>, B<E<gt>&>, and B<E<lt>E<gt>> redirection operators. This may be overridden when creating output files by using the redirection operator B<E<gt>|> instead of B<E<gt>>.
fr: Si mise, B<bash> n'écrasera pas un fichier existant avec les opérateurs B<E<gt>>, B<E<gt>&> et B<E<lt>E<gt>>. Ce comportement peut être surpassé lors de la création d'un fichier de sortie en utilisant l'opérateur de redirection B<E<gt>|> à la place de B<E<gt>>.

source: If set, any trap on B<ERR> is inherited by shell functions, command substitutions, and commands executed in a subshell environment. The B<ERR> trap is normally not inherited in such cases.
fr: Si mise, toute capture sur B<ERR> est héritée par les fonctions d'interpréteur, les substitutions de commandes et les commandes exécutées dans un sous-interpréteur. La capture de B<ERR> n'est normalement pas héritée dans de tels cas.

source: Enable B<!> style history substitution. This option is on by default when the shell is interactive.
fr: Activer le style B<!> de substitution historique. C'est le comportement par défaut lorsque l'interpréteur est interactif.

source: If set, the shell does not follow symbolic links when executing commands such as B<cd> that change the current working directory. It uses the physical directory structure instead. By default, B<bash> follows the logical chain of directories when performing commands which change the current directory.
fr: Si mise, l'interpréteur ne doit pas suivre les liens symboliques en exécutant des commandes comme B<cd> qui modifient le répertoire de travail. Utiliser à la place le répertoire physique. Par défaut B<bash> suit la chaîne logique des répertoires lors des commandes qui modifient le répertoire courant.

source: If set, any traps on B<DEBUG> and B<RETURN> are inherited by shell functions, command substitutions, and commands executed in a subshell environment. The B<DEBUG> and B<RETURN> traps are normally not inherited in such cases.
fr: Si mise, toutes les captures de B<DEBUG> et B<RETURN> sont héritées par les fonctions de l'interpréteur, les substitutions de commande et les commandes exécutées dans un sous-interpréteur. Les captures de B<DEBUG> et B<RETURN> ne sont normalement pas héritées dans de tels cas.

source: If no arguments follow this option, then the positional parameters are unset. Otherwise, the positional parameters are set to the I<arg>s, even if some of them begin with a B<->.
fr: Si aucun argument ne suit cet option, alors les paramètres positionnels sont détruits. Sinon, les paramètres positionnels sont mis aux I<arguments>, même si certains d'entre eux commencent par un B<->.

source: Signal the end of options, cause all remaining I<arg>s to be assigned to the positional parameters. The B<-x> and B<-v> options are turned off. If there are no I<arg>s, the positional parameters remain unchanged.
fr: Marque la fin des options conduisant tous les I<arguments> restants à être affectés aux paramètres positionnels. Les options B<-x> et B<-v> sont désactivées. S'il n'y a pas d'I<arguments>, les paramètres positionnels ne sont pas modifiés.

source: The options are off by default unless otherwise noted. Using + rather than - causes these options to be turned off. The options can also be specified as arguments to an invocation of the shell. The current set of options may be found in B<$->. The return status is always true unless an invalid option is encountered.
fr: Par défaut les attributs sont désactivés, sauf indication contraire. En utilisant + à la place de - on désactive explicitement un drapeau. Les attributs peuvent également être fournis en argument lors de l'appel de l'interpréteur. Le jeu courant des options peut être trouvé dans B<$->. La valeur renvoyée est toujours vrai sauf si une option incorrecte est rencontrée.

source: The positional parameters from I<n>+1 ... are renamed to B<$1> B<....> Parameters represented by the numbers B<$#> down to B<$#>-I<n>+1 are unset. I<n> must be a non-negative number less than or equal to B<$#>. If I<n> is 0, no parameters are changed. If I<n> is not given, it is assumed to be 1. If I<n> is greater than B<$#>, the positional parameters are not changed. The return status is greater than zero if I<n> is greater than B<$#> or less than zero; otherwise 0.
fr: Les paramètres positionnels à partir de I<n>+1 ... sont renommés en B<$1> B<....> Les paramètres représentés par les nombres B<$#> jusqu'à B<$#>-I<n>+1 sont détruits. I<n> doit être un entier positif inférieur ou égal à B<$#>. Si I<n> vaut 0, aucun paramètres n'est modifié. Si I<n> est omis, on suppose qu'il vaut 1. Si I<n> est supérieur à B<$#>, les paramètres positionnels ne sont pas modifiés. L'état renvoyé est strictement plus grand que zéro si I<n> est plus grand que B<$#> ou plus petit que zéro ; sinon 0.

source: B<shopt> [B<-pqsu>] [B<-o>] [I<optname> ...]
fr: B<shopt> [B<-pqsu>] [B<-o>] [I<nom_opt> ...]

source: Toggle the values of variables controlling optional shell behavior. With no options, or with the B<-p> option, a list of all settable options is displayed, with an indication of whether or not each is set. The B<-p> option causes output to be displayed in a form that may be reused as input. Other options have the following meanings:
fr: Bascule la valeur des variables contrôlant le comportement facultatif de l'interpréteur. Sans option ou avec l'option B<-p>, une liste de toutes les options configurables est affichée, avec l'indication de l'état de chacune d'entre elles. L'option B<-p> conduit à un affichage de la sortie sous une forme susceptible d'être réutilisée en entrée. Les autres options ont les significations suivantes :

source: Enable (set) each I<optname>.
fr: Activer (créer) chaque I<nom_opt>.

source: Disable (unset) each I<optname>.
fr: Désactiver (détruire) chaque I<nom_opt>.

source: Suppresses normal output (quiet mode); the return status indicates whether the I<optname> is set or unset. If multiple I<optname> arguments are given with B<-q>, the return status is zero if all I<optnames> are enabled; non-zero otherwise.
fr: Supprimer la sortie normale (mode silencieux) ; l'état renvoyé indique si I<nom_opt> est existante ou non. Si plusieurs arguments I<nom_opt> sont indiqués avec B<-q>, l'état renvoyé est zéro si tous les I<nom_opt> sont activés ; différent de zéro sinon.

source: Restricts the values of I<optname> to be those defined for the B<-o> option to the B<set> builtin.
fr: Restreindre les valeurs des I<nom_opts> à celles définies pour l'option B<-o> de la commande interne B<set>.

source: If either B<-s> or B<-u> is used with no I<optname> arguments, the display is limited to those options which are set or unset, respectively. Unless otherwise noted, the B<shopt> options are disabled (unset) by default.
fr: Si l'option B<-s> ou B<-u> est utilisée sans argument I<nom_opt>, l'affichage est limité aux options qui sont respectivement existantes ou non. Sauf indication contraire, les options B<shopt> sont désactivées (détruites) par défaut.

source: The return status when listing options is zero if all I<optnames> are enabled, non-zero otherwise. When setting or unsetting options, the return status is zero unless an I<optname> is not a valid shell option.
fr: L'état renvoyé lors d'un affichage des options est zéro si tous les I<nom_opt> sont activés, différent de zéro sinon. Lors de la création ou de la destruction d'options, l'état renvoyé est zéro sauf si I<nom_opt> n'est pas une option correcte de l'interpréteur.

source: The list of B<shopt> options is:
fr: La liste des options B<shopt> est :

source: If set, an argument to the B<cd> builtin command that is not a directory is assumed to be the name of a variable whose value is the directory to change to.
fr: Si existante, un argument de la commande interne B<cd> qui n'est pas un répertoire est supposé être un nom de variable dont la valeur est le répertoire visé.

source: If set, minor errors in the spelling of a directory component in a B<cd> command will be corrected. The errors checked for are transposed characters, a missing character, and one character too many. If a correction is found, the corrected file name is printed, and the command proceeds. This option is only used by interactive shells.
fr: Si existante, les erreurs minimes de frappe dans un composant du répertoire en argument de la commande B<cd> seront corrigées. Les erreurs corrigées sont les inversions d'un caractère, un caractère manquant et un caractère en trop. Si une correction est possible, le nom de répertoire corrigé est affiché et la commande est exécuté. Cette option n'est utilisée que par les interpréteurs interactifs.

source: If set, B<bash> checks that a command found in the hash table exists before trying to execute it. If a hashed command no longer exists, a normal path search is performed.
fr: Si existante, B<bash> vérifie si une commande trouvée dans la table de hachage existe avant d'essayer de l'exécuter. Si une commande hachée n'existe plus, une recherche normale de chemin est effectuée.

source: If set, B<bash> checks the window size after each command and, if necessary, updates the values of E<.SM> B<LINES> and E<.SM> B<COLUMNS>.
fr: Si existante, B<bash> vérifie la taille de la fenêtre après chaque commande et, au besoin, mettra à jour les valeurs des variables E<.SM B<LINES>> et E<.SM B<COLUMNS>.>

source: If set, B<bash> attempts to save all lines of a multiple-line command in the same history entry. This allows easy re-editing of multi-line commands.
fr: Si existante, B<bash> essaie de sauvegarder les commandes s'étendant sur plusieurs lignes en un seul élément d'historique. Ceci facilite l'édition ultérieure de commandes multilignes.

source: If set, B<bash> includes filenames beginning with a `.' in the results of pathname expansion.
fr: Si existante, B<bash> inclut les noms de fichiers commençant par un « . » dans les résultats des développements de chemins.

source: If set, a non-interactive shell will not exit if it cannot execute the file specified as an argument to the B<exec> builtin command. An interactive shell does not exit if B<exec> fails.
fr: Si existante, un interpréteur non interactif ne terminera pas s'il ne peut exécuter un fichier spécifié en argument de la commande interne B<exec>. Un interpréteur interactif ne termine pas si B<exec> échoue.

source: If set, aliases are expanded as described above under E<.SM> B<ALIASES>. This option is enabled by default for interactive shells.
fr: Si existante, les alias sont développés comme décrit plus haut, dans E<.SM B<ALIAS>.> Cette option est activée par défaut pour les interpréteurs interactifs.

source: If set, behavior intended for use by debuggers is enabled:
fr: Si existante, le comportement attendu par les traceurs est activé :

source: The B<-F> option to the B<declare> builtin displays the source file name and line number corresponding to each function name supplied as an argument.
fr: L'option B<-F> de la commande interne B<declare> affiche le nom du fichier source et le numéro de ligne correspondant à chaque nom de fonction fourni comme argument.

source: If the command run by the B<DEBUG> trap returns a non-zero value, the next command is skipped and not executed.
fr: Si la commande lancée par la capture de B<DEBUG> renvoie une valeur différente de zéro, la commande suivante est sautée et n'est pas exécutée.

source: If the command run by the B<DEBUG> trap returns a value of 2, and the shell is executing in a subroutine (a shell function or a shell script executed by the B<.> or B<source> builtins), a call to B<return> is simulated.
fr: Si la commande lancée par la capture de B<DEBUG> renvoie la valeur 2 et si l'interpréteur s'exécute dans un sous-programme (une fonction de l'interpréteur ou un script exécuté par les commandes internes B<.> ou B<source>), un appel à B<return> est simulé.

source: B<BASH_ARGC> and B<BASH_ARGV> are updated as described in their descriptions above.
fr: B<BASH_ARGC> et B<BASH_ARGV> sont mises à jour comme expliqué dans leurs descriptions plus haut.

source: Function tracing is enabled: command substitution, shell functions, and subshells invoked with B<(> I<command> B<)> inherit the B<DEBUG> and B<RETURN> traps.
fr: Le traçage des fonctions est activé : la substitution de commande, les fonctions de l'interpréteur et les sous-interpréteurs appelés avec B<(> I<command> B<)> héritent des captures de B<DEBUG> et B<RETURN>.

source: Error tracing is enabled: command substitution, shell functions, and subshells invoked with B<(> I<command> B<)> inherit the B<ERROR> trap.
fr: Le traçage d'erreur est activé : la substitution de commande, les fonctions de l'interpréteur et les sous-interpréteurs appelés avec B<(> I<command> B<)> héritent de la capture de B<ERROR>.

source: If set, the extended pattern matching features described above under B<Pathname Expansion> are enabled.
fr: Si existante, les fonctionnalités étendues de mise en correspondance décrites plus haut dans B<Développement des chemins> sont activées.

source: If set, B<$>'I<string>' and B<$>"I<string>" quoting is performed within B<${>I<parameter>B<}> expansions enclosed in double quotes. This option is enabled by default.
fr: Si existante, la protection par B<$>'I<chaîne>' et B<$>"I<chaîne>" est effectuée à l'intérieur des développements de B<${>I<paramètres>B<}> entre guillemets doubles. Cette option est activée par défaut.

source: If set, patterns which fail to match filenames during pathname expansion result in an expansion error.
fr: Si existante, les motifs qui échouent à faire correspondre les noms de fichiers pendant le développement des chemins font qu'ils provoqueront une erreur de développement.

source: If set, the suffixes specified by the B<FIGNORE> shell variable cause words to be ignored when performing word completion even if the ignored words are the only possible completions. See E<.SM> B<SHELL VARIABLES> above for a description of B<FIGNORE>. This option is enabled by default.
fr: Si existante, les suffixes spécifiés par la variable de l'interpréteur B<FIGNORE> conduiront les mots à être ignorés lors du complètement de mots, même si les mots ignorés sont des complètements possibles. Voir E<.SM B<VARIABLES DE L'INTERPRÉTEUR>> plus haut pour une description de B<FIGNORE>. Cette option est activée par défaut.

source: If set, shell error messages are written in the standard GNU error message format.
fr: Si existante, les messages d'erreur de l'interpréteur seront écrits dans le format standard GNU des messages d'erreurs.

source: If set, the history list is appended to the file named by the value of the B<HISTFILE> variable when the shell exits, rather than overwriting the file.
fr: Si existante, la file d'historique est ajoutée au fichier désigné par la valeur de la variable B<HISTFILE> lorsque l'interpréteur termine, plutôt que d'écraser ce fichier.

source: If set, and B<readline> is being used, a user is given the opportunity to re-edit a failed history substitution.
fr: Si existante et si B<readline> est utilisée, un utilisateur peut rééditer une substitution d'historique qui a échoué.

source: If set, and B<readline> is being used, the results of history substitution are not immediately passed to the shell parser. Instead, the resulting line is loaded into the B<readline> editing buffer, allowing further modification.
fr: Si existante et si B<readline> est utilisée, le résultat de la substitution d'historique n'est pas transmise immédiatement à l'analyseur de l'interpréteur. À la place, la ligne résultant est chargée dans le tampon d'édition de B<readline> permettant des modifications ultérieures.

source: If set, and B<readline> is being used, B<bash> will attempt to perform hostname completion when a word containing a B<@> is being completed (see B<Completing> under E<.SM> B<READLINE> above). This is enabled by default.
fr: Si existante et si B<readline> est utilisée, B<bash> essayera d'effectuer le complètement des noms de machines lorsqu'un mot contient un B<@> (voir B<Complètement> dans E<.SM B<READLINE>> plus haut). Cette option est activée par défaut.

source: If set, B<bash> will send E<.SM> B<SIGHUP> to all jobs when an interactive login shell exits.
fr: Si existante, B<bash> enverra un signal E<.SM B<SIGHUP>> à toutes les tâches lorsqu'un interpréteur de connexion interactif termine.

source: If set, allow a word beginning with B<#> to cause that word and all remaining characters on that line to be ignored in an interactive shell (see E<.SM> B<COMMENTS> above). This option is enabled by default.
fr: Si existante, un mot commençant par un B<#> conduira ce mot et tous les autres caractères restants de la ligne à être ignorés dans un interpréteur interactif (voir E<.SM B<COMMENTAIRES>> plus haut). Cette option est activée par défaut.

source: If set, and the B<cmdhist> option is enabled, multi-line commands are saved to the history with embedded newlines rather than using semicolon separators where possible.
fr: Si existante et si l'option B<cmdhist> est activée, les commandes multilignes sont sauvegardées dans l'historique avec des sauts de ligne incorporés comme séparateurs plutôt que des points-virgules là où c'est possible.

source: The shell sets this option if it is started as a login shell (see E<.SM> B<INVOCATION> above). The value may not be changed.
fr: L'interpréteur crée cette option s'il est démarré en tant qu'interpréteur de connexion (voir E<.SM B<APPEL>> plus haut). La valeur ne peut être modifiée.

source: If set, and a file that B<bash> is checking for mail has been accessed since the last time it was checked, the message ``The mail in I<mailfile> has been read'' is displayed.
fr: Si existante et s'il a été accédé à un fichier que B<bash> surveille pour les courriels depuis sa dernière vérification, le message « The mail in I<fichier_de_courriel> has been read » est affiché.

source: If set, and B<readline> is being used, B<bash> will not attempt to search the B<PATH> for possible completions when completion is attempted on an empty line.
fr: Si existante et si B<readline> est utilisée, B<bash> n'essaiera pas d'utiliser le B<PATH> pour de possibles complètements quand le complètement est tenté sur une ligne vide.

source: If set, B<bash> matches filenames in a case-insensitive fashion when performing pathname expansion (see B<Pathname Expansion> above).
fr: Si existante, B<bash> fait correspondre les noms de fichiers d'une façon insensible à la casse lors du développement des chemins (voir B<Développement des chemins> plus haut).

source: If set, B<bash> matches patterns in a case-insensitive fashion when performing matching while executing B<case> or B<[[> conditional commands.
fr: Si existante, B<bash> fait correspondre les motifs d'une façon insensible à la casse lors de la mise en correspondance pendant l'exécution des commandes conditionnelles B<case> ou B<[[>.

source: If set, B<bash> allows patterns which match no files (see B<Pathname Expansion> above) to expand to a null string, rather than themselves.
fr: Si existante, B<bash> autorise les motifs ne correspondant à aucun fichier (voir B<Développement des chemins> plus haut) à se développer en une chaîne vide plutôt qu'en une valeur littérale.

source: If set, the programmable completion facilities (see B<Programmable Completion> above) are enabled. This option is enabled by default.
fr: Si existante, les outils de complètement programmables (voir B<Complètement programmable> plus haut) sont activés. Cette option est activée par défaut.

source: If set, prompt strings undergo parameter expansion, command substitution, arithmetic expansion, and quote removal after being expanded as described in E<.SM> B<PROMPTING> above. This option is enabled by default.
fr: Si existante, les chaînes d'invite sont sujettes au développement des paramètres, à la substitution de commande, au développement arithmétique et à la suppression des protections après avoir été développée comme décrit plus haut dans E<.SM B<INVITES>.> Cette option est activée par défaut.

source: The shell sets this option if it is started in restricted mode (see E<.SM> B<RESTRICTED SHELL> below). The value may not be changed. This is not reset when the startup files are executed, allowing the startup files to discover whether or not a shell is restricted.
fr: L'interpréteur crée cette option s'il est démarré en mode restreint (voir plus bas E<.SM B<INTERPRÉTEUR RESTREINT>>). Cette valeur ne peut pas être changée. Elle n'est pas réinitialisée lorsque les fichiers de démarrage sont exécutés, ce qui permet à ces fichiers de découvrir si un interpréteur est restreint ou non.

source: If set, the B<shift> builtin prints an error message when the shift count exceeds the number of positional parameters.
fr: Si existante, la commande interne B<shift> affiche un message d'erreur lorsque le nombre de décalages dépasse le nombre de paramètres positionnels.

source: If set, the B<source> (B<.>) builtin uses the value of E<.SM> B<PATH> to find the directory containing the file supplied as an argument. This option is enabled by default.
fr: Si existante, la commande interne B<source> (B<.>) utilise la valeur de la variable E<.SM B<PATH>> pour trouver le répertoire contenant le fichier fourni en argument. Cette option est activée par défaut.

source: If set, the B<echo> builtin expands backslash-escape sequences by default.
fr: Si existante, la commande interne B<echo> développe par défaut les suites de caractères d'échappement par contre-oblique.

source: Suspend the execution of this shell until it receives a E<.SM> B<SIGCONT> signal. The B<-f> option says not to complain if this is a login shell; just suspend anyway. The return status is 0 unless the shell is a login shell and B<-f> is not supplied, or if job control is not enabled.
fr: Suspend l'exécution de l'interpréteur jusqu'à la réception d'un signal E<.SM B<SIGCONT>.> L'option B<-f> élimine le message d'erreur s'il s'agit d'un interpréteur de connexion et force sa suspension. L'état renvoyé est 0 sauf si l'interpréteur est un interpréteur de connexion et si l'option B<-f> n'est pas fournie ou si le contrôle des tâches n'est pas activé.
