Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: redirecting output using the E<gt>, E<gt>|, E<lt>E<gt>, E<gt>&, &E<gt>, and E<gt>E<gt> redirection operators
fr: rediriger la sortie en utilisant les opérateurs de redirection E<gt>, E<gt>|, E<lt>E<gt>, E<gt>&, &E<gt> et E<gt>E<gt>

source: using the B<exec> builtin command to replace the shell with another command
fr: utiliser la commande interne B<exec> pour remplacer l'interpréteur par une autre commande

source: adding or deleting builtin commands with the B<-f> and B<-d> options to the B<enable> builtin command
fr: ajouter ou supprimer des commandes internes avec les options B<-f> et B<-d> de la commande interne B<enable> ;

source: Using the B<enable> builtin command to enable disabled shell builtins
fr: utiliser la commande interne B<enable> pour activer les commandes internes de l'interpréteur désactivées ;

source: specifying the B<-p> option to the B<command> builtin command
fr: indiquer l'option B<-p> à la commande interne B<commande>

source: turning off restricted mode with B<set +r> or B<set +o restricted>.
fr: supprimer le mode restreint avec B<set +r> ou B<set +o restricted>.

source: These restrictions are enforced after any startup files are read.
fr: Ces restrictions sont mises en place après la lecture des fichiers de démarrage.

source: B<rbash> turns off any restrictions in the shell spawned to execute the script.
fr: B<rbash> supprime les restrictions dans l'interpréteur créé pour exécuter le script.

source: SEE ALSO
fr: VOIR AUSSI

source: I<Bash Reference Manual>, Brian Fox and Chet Ramey
fr: I<Manuel de référence de Bash>, Brian Fox et Chet Ramey

source: I<The Gnu Readline Library>, Brian Fox and Chet Ramey
fr: I<The GNU Readline Library>, Brian Fox et Chet Ramey

source: I<The Gnu History Library>, Brian Fox and Chet Ramey
fr: I<The GNU History Library>, Brian Fox et Chet Ramey

source: FILES
fr: FICHIERS

source: The B<bash> executable
fr: L'exécutable B<bash>

source: The systemwide initialization file, executed for login shells
fr: Le fichier d'initialisation commun à tout le système, exécuté pour les interpréteurs de commandes de connexion

source: The systemwide per-interactive-shell startup file
fr: Le fichier de démarrage commun à tout le système pour chacun des interpréteurs interactifs

source: The systemwide login shell cleanup file, executed when a login shell exits
fr: Le fichier de nettoyage des interpréteurs de connexion commun à tout le système, exécuté lorsqu'un interpréteur de connexion termine

source: The personal initialization file, executed for login shells
fr: Le fichier d'initialisation personnel exécuté pour les interpréteurs de commandes de connexion

source: The individual per-interactive-shell startup file
fr: Le fichier de démarrage personnel, pour chacun des interpréteurs interactifs

source: The individual login shell cleanup file, executed when a login shell exits
fr: Le fichier de nettoyage personnel des interpréteurs de commandes de connexion, exécuté lorsqu'un interpréteur de commandes de connexion termine

source: Individual I<readline> initialization file
fr: Le fichier d'initialisation personnalisée de I<readline>

source: AUTHORS
fr: AUTEURS

source: BUG REPORTS
fr: SIGNALEMENTS D'ANOMALIES

source: If you find a bug in B<bash,> you should report it. But first, you should make sure that it really is a bug, and that it appears in the latest version of B<bash>. The latest version is always available from I<ftp://ftp.gnu.org/pub/bash/>.
fr: Si vous trouvez une anomalie dans B<bash,> vous devriez la signaler. Tout d'abord vous devez vous assurer qu'il s'agit réellement d'une anomalie et qu'elle apparaît bien dans la dernière version de B<bash> disponible. La dernière version est toujours disponible à partir de I<ftp://ftp.gnu.org/pub/bash/>.

source: Once you have determined that a bug actually exists, use the I<bashbug> command to submit a bug report. If you have a fix, you are encouraged to mail that as well! Suggestions and `philosophical' bug reports may be mailed to I<bug-bash@gnu.org> or posted to the Usenet newsgroup B<gnu.bash.bug>.
fr: Une fois que vous avez déterminé qu'une anomalie existe effectivement, utilisez la commande I<bashbug> pour envoyer un signalement d'anomalie. Si vous avez un correctif, vous êtes encouragé à l'envoyer en même temps ! Les suggestions ou les signalements d'anomalies de nature « philosophique » peuvent être envoyés (en anglais) à I<bug-bash@gnu.org> ou postés dans le groupe Usenet B<gnu.bash.bug>.

source: ALL bug reports should include:
fr: TOUS les signalements d'anomalie doivent contenir :

source: The version number of B<bash>
fr: Le numéro de version de B<bash>

source: The hardware and operating system
fr: Le matériel et le système d'exploitation utilisés

source: The compiler used to compile
fr: Le compilateur utilisé pour compiler

source: A description of the bug behaviour
fr: Une description (en anglais) de l'anomalie

source: A short script or `recipe' which exercises the bug
fr: Un petit script ou une « recette » qui démontre l'anomalie

source: I<bashbug> inserts the first three items automatically into the template it provides for filing a bug report.
fr: I<bashbug> insère automatiquement les trois premiers éléments de cette liste dans le formulaire qu'il fournit pour remplir un signalement d'anomalie.

source: Comments and bug reports concerning this manual page should be directed to I<chet@po.cwru.edu>.
fr: Les commentaires et signalement d'anomalies concernant la version originale de cette page de manuel (en anglais) doivent être transmis à I<chet@po.cwru.edu>. Ceux concernant cette version française peuvent être envoyés à I<debian-l10n-french@lists.debian.org>.

source: BUGS
fr: ANOMALIES

source: It's too big and too slow.
fr: Cet interpréteur de commandes est trop gros et trop lent.

source: There are some subtle differences between B<bash> and traditional versions of B<sh>, mostly because of the E<.SM> B<POSIX> specification.
fr: Il y a quelques différences subtiles de comportement entre B<bash> et les versions traditionnelles de B<sh>, principalement à cause des spécifications E<.SM B<POSIX>.>

source: Aliases are confusing in some uses.
fr: L'utilisation des alias peut avoir des conséquences inattendues.

source: Shell builtin commands and functions are not stoppable/restartable.
fr: Les commandes internes et les fonctions de l'interpréteur ne peuvent pas être suspendues/relancées.

source: Compound commands and command sequences of the form `a ; b ; c' are not handled gracefully when process suspension is attempted. When a process is stopped, the shell immediately executes the next command in the sequence. It suffices to place the sequence of commands between parentheses to force it into a subshell, which may be stopped as a unit.
fr: Les commandes composées et les suites de commandes de la forme « a ; b ; c » ne sont pas gérées élégamment lors d'une interruption de processus. En cas de suspension d'un processus, l'interpréteur exécute immédiatement la commande suivante. Il suffit de placer cette suite de commandes entre parenthèses pour la forcer à créer un sous-interpréteur, qui, lui, pourra être suspendu en bloc.

source: Commands inside of B<$(>...B<)> command substitution are not parsed until substitution is attempted. This will delay error reporting until some time after the command is entered. For example, unmatched parentheses, even inside shell comments, will result in error messages while the construct is being read.
fr: Les commandes à l'intérieur de la substitution de commande B<$(>...B<)> ne sont pas analysées avant la tentative de substitution. Cela retardera l'affichage de messages d'erreurs pendant un certain temps après que la commande a été saisie. Par exemple, des parenthèses qui ne concordent pas, même à l'intérieur de commentaires, provoqueront des messages d'erreur lorsque la structure sera lue.

source: Array variables may not (yet) be exported.
fr: Les variables de type tableau ne peuvent pas (encore) être exportées.

source: 1998 July 30
fr: 30 juillet 1998

source: bashbug - report a bug in bash
fr: bashbug - Signaler une anomalie dans bash

source: B<bashbug> [I<address>]
fr: B<bashbug> [I<adresse>]

source: B<bashbug> is a shell script to help the user compose and mail bug reports concerning bash in a standard format. B<bashbug> invokes the editor specified by the environment variable E<.SM> B<EDITOR> on a temporary copy of the bug report format outline. The user must fill in the appropriate fields and exit the editor. B<bashbug> then mails the completed report to I<bug-bash@gnu.org>, or I<address>. If the report cannot be mailed, it is saved in the file I<dead.bashbug> in the invoking user's home directory.
fr: B<bashbug> est un script destiné à aider l'utilisateur à composer et envoyer un signalement d'anomalie concernant bash, dans un format standard. B<bashbug> appelle l'éditeur spécifié dans la variable d'environnement E<.SM> B<EDITOR> sur une copie temporaire d'un signalement d'anomalie préformaté. L'utilisateur doit remplir correctement les champs et quitter l'éditeur. B<bashbug> envoie alors le signalement complété à I<bug-bash@gnu.org> ou à I<adresse>. Si le signalement ne peut être envoyé pour une raison quelconque, il est sauvegardé dans le fichier I<dead.bashbug> dans le répertoire d'accueil de l'utilisateur l'ayant appelé.

source: The bug report format outline consists of several sections. The first section provides information about the machine, operating system, the bash version, and the compilation environment. The second section should be filled in with a description of the bug. The third section should be a description of how to reproduce the bug. The optional fourth section is for a proposed fix. Fixes are encouraged.
fr: Le signalement d'anomalie préformaté est divisé en plusieurs sections. La première section fournit des informations concernant la machine, le système d'exploitation la version de bash et l'environnement de compilation. La seconde section doit être remplie avec la description de l'anomalie. La troisième section doit expliquer comment reproduire l'anomalie. La quatrième section, facultative, est destinée à un éventuel correctif. Les correctifs sont encouragés.

source: B<bashbug> will utilize the following environment variables if they exist:
fr: B<bashbug> utilisera les variables d'environnement suivantes, si elles existent :

source: Specifies the preferred editor. If E<.SM> B<EDITOR> is not set, B<bashbug> defaults to B<emacs>.
fr: Spécifie l'éditeur préféré. Si E<.SM B<EDITOR>> n'existe pas, B<bashbug> utilisera B<emacs> par défaut.

source: Directory in which the failed bug report is saved if the mail fails.
fr: Répertoire dans lequel le signalement d'anomalie inabouti doit être sauvegardé si l'envoi par courriel échoue.

source: B<clear_console> - clear the console
fr: B<clear_console> - efface la console

source: B<clear_console> clears your console if this is possible. It looks in the environment for the terminal type and then in the B<terminfo> database to figure out how to clear the screen. To clear the buffer, it then changes the foreground virtual terminal to another terminal and then back to the original terminal.
fr: B<clear_console> nettoie votre console si c'est possible. Il cherche dans l'environnement le type du terminal puis dans la base de données B<terminfo> pour savoir comment nettoyer l'écran. Pour effacer le tampon, il bascule ensuite le terminal virtuel au premier plan vers un autre terminal puis revient au terminal originel.

source: 2004 Apr 20
fr: 20 avril 2004

source: rbash - restricted bash, see B<bash>(1)
fr: rbash - Bash restreint, voir B<bash>(1)

source: May 24, 2003
fr: 24 mai 2003

source: Debian Free Documentation
fr: Documentation libre Debian

source: bash-minimal - A bash version configured with minimal features
fr: bash-minimal - Une version de bash configurée avec des fonctionnalités minimales

source: B<bash-minimal> is configured using --enable-minimal-config, which produces a shell with minimal features, close to the historical Bourne shell. This means:
fr: B<bash-minimal> est configuré en utilisant --enable-minimal-config, qui crée un interpréteur avec des fonctionnalités minimales, proches de l'interpréteur Bourne historique. Cela signifie :

source: No alias expansion and the `alias' and `unalias' builtins.
fr: Aucun développement des alias ni les commandes internes « alias » et « unalias ».

source: No support for the alternate form of the `for' command that behaves like the C language `for' statement.
fr: Indisponibilité des formes alternatives de la commande « for » qui se comportent comme les « for » du langage C.

source: No support for one-dimensional array shell variables.
fr: Indisponibilité dans l'interpréteur des variables tableau à une dimension.

source: No support for `csh'-like history substitution.
fr: Indisponibilité de la substitution d'historique « à la csh ».

source: No `csh'-like brace expansion ( `b{a,b}c' ==E<gt> `bac bbc' ).
fr: Aucun développement des accolades « à la csh » (« b{a,b}c » ==E<gt> « bac bbc »).

source: No support for recognizing `time' as a reserved word and for displaying timing statistics for the pipeline following `time'. This allows pipelines as well as shell builtins and functions to be timed.
fr: Indisponibilité de « time » comme un mot réservé et pour afficher des statistiques de chronométrage pour la conduite suivant « time ». Cela permet aux conduites aussi bien qu'aux commandes internes et aux fonctions de l'interpréteur d'être chronométrées.

source: No support for the `[[' conditional command.
fr: Indisponibilité de la commande conditionnelle « [[ ».

source: No support for a `csh'-like directory stack and the `pushd', `popd', and `dirs' builtins
fr: Indisponibilité d'une pile de répertoires « à la csh » ni des commandes internes « pushd », « popd » et « dirs »

source: No support for the `((...))' command.
fr: Indisponibilité de la commande « ((...)) ».

source: No support for the extended pattern matching features.
fr: Indisponibilité des fonctionnalités étendues de correspondance de motifs.

source: No `help' builtin, which displays help on shell builtins and variables.
fr: Aucune commande interne « help » qui affiche de l'aide sur les commandes internes et les variables de l'interpréteur.

source: No command history and the `fc' and `history' builtin commands.
fr: Aucun historique des commandes ni les commandes internes « fc » et « history ».

source: No job control features.
fr: Aucune fonctionnalité de contrôle des tâches.

source: No special handling of filenames of the form `/dev/tcp/HOST/PORT' and `/dev/udp/HOST/PORT' when used in redirections.
fr: Aucune gestion particulière des noms de fichiers de la forme « /dev/tcp/HOST/PORT » ni « /dev/udp/HOST/PORT » lorsqu'utilisés dans des redirections.

source: No process substitution.
fr: Aucune substitution de processus.

source: No interpretation of a number of backslash-escaped characters in the `$PS1', `$PS2', `$PS3', and `$PS4' prompt strings.
fr: Aucune interprétation de certaines suites de caractères d'échappement par contre-obliques dans les chaînes d'invite « $PS1 », « $PS2 », « $PS3 » et « $PS4 ».

source: No programmable completion facilities.
fr: Aucun outil de complètement programmable.

source: No support for command-line editing and history with the Bash version of the Readline library.
fr: Indisponibilité pour l'édition de la ligne de commande et de l'historique avec la version Bash de la bibliothèque Readline.

source: No support for a "restricted shell". If this is enabled, Bash, when called as `rbash', enters a restricted mode.
fr: Indisponibilité d'un « interpréteur restreint ». Si ceci est activé, Bash, lorsqu'appelé en tant que « rbash » entre en mode restreint.

source: No `select' builtin, which allows the generation of simple menus.
fr: Aucune commande interne « select » qui permet la génération de menus simples.

source: BASH-BUILTINS
fr: COMMANDES INTERNES BASH

source: 2001 October 29
fr: 29 octobre 2001

source: bash-builtins - bash built-in commands, see B<bash>(1)
fr: bash-builtins - Commandes internes de bash, voir B<bash>(1)

source: bash defines the following built-in commands: :, ., [, alias, bg, bind, break, builtin, case, cd, command, compgen, complete, continue, declare, dirs, disown, echo, enable, eval, exec, exit, export, fc, fg, getopts, hash, help, history, if, jobs, kill, let, local, logout, popd, printf, pushd, pwd, read, readonly, return, set, shift, shopt, source, suspend, test, times, trap, type, typeset, ulimit, umask, unalias, unset, until, wait, while.
fr: bash définit les commandes internes suivantes : :, ., [, alias, bg, bind, break, builtin, case, cd, command, compgen, complete, continue, declare, dirs, disown, echo, enable, eval, exec, exit, export, fc, fg, getopts, hash, help, history, if, jobs, kill, let, local, logout, popd, printf, pushd, pwd, read, readonly, return, set, shift, shopt, source, suspend, test, times, trap, type, typeset, ulimit, umask, unalias, unset, until, wait, while.

source: BASH BUILTIN COMMANDS
fr: COMMANDES INTERNES DE BASH
