Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: I<suffix> is appended to each possible completion after all other options have been applied.
fr: I<suffix> est ajouté à chaque complètement possible après que toutes les autres options ont été appliquées.

source: The return value is true unless an invalid option is supplied, an option other than B<-p> or B<-r> is supplied without a I<name> argument, an attempt is made to remove a completion specification for a I<name> for which no specification exists, or an error occurs adding a completion specification.
fr: La valeur renvoyée est vrai à moins qu'une option incorrecte a été fournie, qu'une option comme B<-p> ou B<-r> a été fournie sans un I<nom> d'argument, qu'une tentative ait été faite pour supprimer une spécification de complètement pour un I<nom> pour lequel il n'existe pas de spécification, ou bien qu'une erreur soit survenue lors de l'ajout d'une spécification de complètement.

source: Resume the next iteration of the enclosing B<for>, B<while>, B<until>, or B<select> loop. If I<n> is specified, resume at the I<n>th enclosing loop. I<n> must be \(E<gt>= 1. If I<n> is greater than the number of enclosing loops, the last enclosing loop (the ``top-level'' loop) is resumed. The return value is 0 unless the shell is not executing a loop when B<continue> is executed.
fr: Reprendre l'exécution à l'itération suivante d'une boucle B<for>, B<while>, B<until> ou encore B<select>. Si I<n> est indiqué, reprendre l'exécution à la I<n>-ième boucle imbriquée. I<n> doit être \(E<gt>= 1. Si I<n> est supérieur au nombre de boucles imbriquées, l'exécution reprend à la boucle la plus externe (la boucle « au sommet »). La valeur renvoyée est 0 sauf si l'interpréteur n'exécutait pas de boucle quand il a rencontré l'instruction B<continue>.

source: B<declare> [B<-afFirtx>] [B<-p>] [I<name>[=I<value>] ...]
fr: B<declare> [B<-afFirtx>] [B<-p>] [I<nom>[=I<valeur>] ...]

source: B<typeset> [B<-afFirtx>] [B<-p>] [I<name>[=I<value>] ...]
fr: B<typeset> [B<-afFirtx>] [B<-p>] [I<nom>[=I<valeur>] ...]

source: Declare variables and/or give them attributes. If no I<name>s are given then display the values of variables. The B<-p> option will display the attributes and values of each I<name>. When B<-p> is used, additional options are ignored. The B<-F> option inhibits the display of function definitions; only the function name and attributes are printed. If the B<extdebug> shell option is enabled using B<shopt>, the source file name and line number where the function is defined are displayed as well. The B<-F> option implies B<-f>. The following options can be used to restrict output to variables with the specified attribute or to give variables attributes:
fr: Déclarer des variables et/ou leur fournir des attributs. Si aucun I<nom> n'est indiqué alors afficher les valeurs des variables. L'option B<-p> affichera les attributs et les valeurs de chaque I<nom>. Quand B<-p> est utilisée, les options supplémentaires sont ignorées. L'option B<-F> empêche l'affichage des définitions de fonctions ; seuls le nom de la fonction et ses attributs sont affichés. Si l'option d'interpréteur B<extdebug> est activée en utilisant B<shopt>, le nom du fichier source et le numéro de ligne où la fonction est définie sont aussi affichés. L'option B<-F> implique B<-f>. Les options suivantes permettent de restreindre l'affichage aux variables dotées de certains attributs ou de fixer les attributs des variables :

source: Each I<name> is an array variable (see B<Arrays> above).
fr: Chaque I<nom> est une variable de type tableau (voir B<Tableaux> plus haut).

source: Use function names only.
fr: Utiliser seulement les noms de fonctions.

source: The variable is treated as an integer; arithmetic evaluation (see E<.SM> B<ARITHMETIC EVALUATION ) > is performed when the variable is assigned a value.
fr: La variable est traitée comme un entier ; l'évaluation arithmétique (voir E<.SM> B<ÉVALUATION ARITHMÉTIQUE>) est effectuée lorsqu'une valeur est affectée à la variable.

source: Make I<name>s readonly. These names cannot then be assigned values by subsequent assignment statements or unset.
fr: Rend les I<nom>s accessibles en lecture seule. Des valeurs ne pourront alors plus être affectées à ces noms par des affectations ultérieures. Ils ne pourront pas non plus être détruits.

source: Give each I<name> the I<trace> attribute. Traced functions inherit the B<DEBUG> and B<RETURN> traps from the calling shell. The trace attribute has no special meaning for variables.
fr: Donne à chaque I<nom> l'attribut I<trace>. Les fonctions tracées héritent des captures de B<DEBUG> et B<RETURN> de l'interpréteur appelant. L'attribut I<trace> n'a pas de signification spéciale pour les variables.

source: Mark I<name>s for export to subsequent commands via the environment.
fr: Marque les I<nom>s pour qu'ils soit exportés dans l'environnement des commandes ultérieures.

source: Using `+' instead of `-' turns off the attribute instead, with the exception that B<+a> may not be used to destroy an array variable. When used in a function, makes each I<name> local, as with the B<local> command. If a variable name is followed by =I<value>, the value of the variable is set to I<value>. The return value is 0 unless an invalid option is encountered, an attempt is made to define a function using
fr: En utilisant « + » à la place de « - », l'attribut correspondant est désactivé, à l'exception que B<+a> ne peut pas être utilisé pour détruire une variable tableau. Quand utilisé dans une fonction, chacun des I<noms> devient local, comme avec la commande B<local>. Si un nom de variable est suivi par =I<valeur>, la valeur de cette variable est mise à I<valeur>. La valeur renvoyée est 0 sauf si une option incorrecte est rencontrée, si on essaye de définir une fonction en utilisant

source: an attempt is made to assign a value to a readonly variable, an attempt is made to assign a value to an array variable without using the compound assignment syntax (see B<Arrays> above), one of the I<names> is not a valid shell variable name, an attempt is made to turn off readonly status for a readonly variable, an attempt is made to turn off array status for an array variable, or an attempt is made to display a non-existent function with B<-f>.
fr: une tentative est faite d'affecter une valeur à une variable en lecture seule, une tentative est faite d'affecter une valeur à une variable tableau sans employer la syntaxe d'affectation composée (voir B<Tableaux> plus haut), un des I<nom>s n'est pas un nom correct pour une variable de l'interpréteur, une tentative est faite de supprimer l'attribut lecture-seule d'une variable en lecture seule, ou une tentative est faite de supprimer l'attribut tableau d'une variable tableau, ou une tentative est faite avec B<-f> d'afficher une fonction inexistante.

source: Without options, displays the list of currently remembered directories. The default display is on a single line with directory names separated by spaces. Directories are added to the list with the B<pushd> command; the B<popd> command removes entries from the list.
fr: Affiche la liste des répertoires actuellement mémorisés. L'affichage par défaut se fait sur une seule ligne, les noms de répertoires étant séparés par des espaces. On ajoute des répertoires dans cette liste avec la commande B<pushd> et on peut en supprimer avec la commande B<popd>.

source: Displays the I<n>th entry counting from the left of the list shown by B<dirs> when invoked without options, starting with zero.
fr: Affiche le I<n>-ième élément de la liste fournie par B<dirs>, lorsqu'appelé sans options, en comptant à partir de la gauche en commençant à zéro.

source: Displays the I<n>th entry counting from the right of the list shown by B<dirs> when invoked without options, starting with zero.
fr: Affiche le I<n>-ième élément de la liste fournie par B<dirs>, lorsqu'appelé sans options, en comptant à partir de la droite en commençant à zéro.

source: Clears the directory stack by deleting all of the entries.
fr: Effacer la liste des répertoires en les supprimant tous.

source: Produces a longer listing; the default listing format uses a tilde to denote the home directory.
fr: Produit une liste plus longue ; le format d'affichage par défaut utilise le tilde pour représenter le répertoire d'accueil.

source: Print the directory stack with one entry per line.
fr: Afficher la pile des répertoires avec un élément par ligne.

source: Print the directory stack with one entry per line, prefixing each entry with its index in the stack.
fr: Afficher la pile des répertoires avec un élément par ligne, en préfixant chaque entrée avec son numéro d'indice dans la pile.

source: The return value is 0 unless an invalid option is supplied or I<n> indexes beyond the end of the directory stack.
fr: La valeur renvoyée est 0 sauf si une option incorrecte a été fournie ou si l'indice I<n> dépasse la longueur de la pile des répertoires.

source: B<disown> [B<-ar>] [B<-h>] [I<jobspec> ...]
fr: B<disown> [B<-ar>] [B<-h>] [I<tâche> ...]

source: Without options, each I<jobspec> is removed from the table of active jobs. If the B<-h> option is given, each I<jobspec> is not removed from the table, but is marked so that E<.SM> B<SIGHUP> is not sent to the job if the shell receives a E<.SM> B<SIGHUP>. If no I<jobspec> is present, and neither the B<-a> nor the B<-r> option is supplied, the I<current job> is used. If no I<jobspec> is supplied, the B<-a> option means to remove or mark all jobs; the B<-r> option without a I<jobspec> argument restricts operation to running jobs. The return value is 0 unless a I<jobspec> does not specify a valid job.
fr: Sans options, chaque I<tâche> est supprimée de la table des tâches actives. Si l'option B<-h> est indiquée, chaque I<tâche> n'est pas supprimée de la table mais marquée pour que le signal E<.SM B<SIGHUP>> ne lui soit pas envoyé si l'interpréteur reçoit un signal E<.SM B<SIGHUP>.> Si aucune I<tâche> n'est indiquée et que ni l'option B<-a> ni l'option B<-r> n'est fournie, la I<tâche courante> est concernée. Si aucune I<tâche> n'est fournie, l'option B<-a> signifie la suppression ou le marquage de toutes les tâches ; l'option B<-r> sans l'argument I<tâche> restreint les opérations aux tâches en cours d'exécution. La valeur renvoyée est zéro sauf si I<tâche> ne spécifie pas une tâche correcte.

source: B<echo> [B<-neE>] [I<arg> ...]
fr: B<echo> [B<-neE>] [I<arguments> ...]

source: Output the I<arg>s, separated by spaces, followed by a newline. The return status is always 0. If B<-n> is specified, the trailing newline is suppressed. If the B<-e> option is given, interpretation of the following backslash-escaped characters is enabled. The B<-E> option disables the interpretation of these escape characters, even on systems where they are interpreted by default. The B<xpg_echo> shell option may be used to dynamically determine whether or not B<echo> expands these escape characters by default. B<echo> does not interpret B<--> to mean the end of options. B<echo> interprets the following escape sequences:
fr: Affiche les I<arguments>, séparés par des espaces, suivis par un saut de ligne. La valeur renvoyée est toujours 0. Si B<-n> est spécifié, le saut de ligne final est supprimé. Si l'option B<-e> est indiquée, l'interprétation des caractères suivants d'échappement par une contre-oblique est activée. L'option B<-E> désactive l'interprétation de ces caractères d'échappement, même sur les systèmes où ils sont interprétés par défaut. L'option d'interpréteur B<xpg_echo> peut être utilisée dynamiquement pour déterminer si B<echo> développe ou non par défaut ces caractères d'échappement. B<echo> n'interprète pas B<--> comme signifiant la fin des options. B<echo> reconnaît les suites de caractères d'échappement suivantes :

source: suppress trailing newline
fr: suppression du saut de ligne final

source: the eight-bit character whose value is the octal value I<nnn> (zero to three octal digits)
fr: le caractère 8 bits dont la valeur en octal vaut I<nnn> (zéro à trois chiffres octaux)

source: the eight-bit character whose value is the octal value I<nnn> (one to three octal digits)
fr: le caractère 8 bits dont la valeur en octal vaut I<nnn> (un à trois chiffres)

source: B<enable> [B<-adnps>] [B<-f> I<filename>] [I<name> ...]
fr: B<enable> [B<-adnps>] [B<-f> I<fichier>] [I<nom> ...]

source: Enable and disable builtin shell commands. Disabling a builtin allows a disk command which has the same name as a shell builtin to be executed without specifying a full pathname, even though the shell normally searches for builtins before disk commands. If B<-n> is used, each I<name> is disabled; otherwise, I<names> are enabled. For example, to use the B<test> binary found via the E<.SM> B<PATH> instead of the shell builtin version, run
fr: Active ou désactive les commandes internes de l'interpréteur. Désactiver une commande interne permet d'exécuter une commande disque ayant le même nom qu'une commande interne de l'interpréteur, sans avoir à spécifier un chemin d'accès complet, même quand l'interpréteur recherche normalement les commandes internes avant les commandes du disque. Si B<-n> est utilisé, chaque I<nom> indiqué est désactivé, sinon ils sont activés. Par exemple, pour utiliser le programme binaire B<test> qui se trouve dans le E<.SM B<PATH>> plutôt que la commande interne, utilisez

source: The B<-f> option means to load the new builtin command I<name> from shared object I<filename>, on systems that support dynamic loading. The B<-d> option will delete a builtin previously loaded with B<-f>. If no I<name> arguments are given, or if the B<-p> option is supplied, a list of shell builtins is printed. With no other option arguments, the list consists of all enabled shell builtins. If B<-n> is supplied, only disabled builtins are printed. If B<-a> is supplied, the list printed includes all builtins, with an indication of whether or not each is enabled. If B<-s> is supplied, the output is restricted to the POSIX I<special> builtins. The return value is 0 unless a I<name> is not a shell builtin or there is an error loading a new builtin from a shared object.
fr: L'option B<-f> demande de charger la nouvelle commande interne avec le I<nom> indiqué depuis le I<fichier> objet partagé sur les systèmes qui le permettent. L'option B<-d> permet de supprimer une commande interne chargée précédemment avec B<-f>. Si aucun argument I<nom> n'est indiqué ou si l'option B<-p> est fournie, une liste des commandes internes de l'interpréteur est affichée. Sans autre option, la liste est celle des commandes internes actives de l'interpréteur. Si B<-n> est fournie, seules les commandes désactivées sont affichées. Si B<-a> est fournie, la liste de toutes les commandes est affichée, avec une indication des activations et inactivations. Si B<-s> est fournie, la sortie est limitée aux commandes internes I<spéciales> POSIX. La valeur renvoyée est 0, sauf si I<nom> n'est pas une commande interne ou s'il y a un problème avec le chargement d'une nouvelle commande interne de l'objet partagé.

source: B<eval> [I<arg> ...]
fr: B<eval> [I<arguments> ...]

source: The I<arg>s are read and concatenated together into a single command. This command is then read and executed by the shell, and its exit status is returned as the value of B<eval>. If there are no I<args>, or only null arguments, B<eval> returns 0.
fr: Les I<arguments> sont lus et regroupés en une seule commande simple. Cette commande est alors lue et exécutée par l'interpréteur et son état final est renvoyé comme valeur de la commande B<eval>. S'il n'y a pas d'I<arguments> ou uniquement des arguments vides, B<eval> renvoie 0.

source: B<exec> [B<-cl>] [B<-a> I<name>] [I<command> [I<arguments>]]
fr: B<exec> [B<-cl>] [B<-a> I<nom>] [I<commande> [I<arguments>]]

source: If I<command> is specified, it replaces the shell. No new process is created. The I<arguments> become the arguments to I<command>. If the B<-l> option is supplied, the shell places a dash at the beginning of the zeroth arg passed to I<command>. This is what I<login>(1) does. The B<-c> option causes I<command> to be executed with an empty environment. If B<-a> is supplied, the shell passes I<name> as the zeroth argument to the executed command. If I<command> cannot be executed for some reason, a non-interactive shell exits, unless the shell option B<execfail> is enabled, in which case it returns failure. An interactive shell returns failure if the file cannot be executed. If I<command> is not specified, any redirections take effect in the current shell, and the return status is 0. If there is a redirection error, the return status is 1.
fr: Si une I<commande> est indiquée, elle remplace l'interpréteur. Aucun nouveau processus n'est créé. Les I<arguments> deviennent ceux de la I<commande>. Si l'option B<-l> est fournie, l'interpréteur place un tiret en guise de zéro-ième argument fourni a la I<commande>. C'est ce que fait I<login>. L'option B<-c> conduit à l'exécution de la I<commande> avec un environnement vide. Si l'option B<-a> est fournie, l'interpréteur transmet le I<nom> comme zéro-ième argument. Si la I<commande> ne peut être exécutée pour une certaine raison, un interpréteur non interactif termine, sauf si l'option de l'interpréteur B<execfail> est activée, auquel cas une erreur est renvoyée. Un interpréteur interactif renvoie l'erreur si le fichier ne peut pas être exécuté. Si aucune I<commande> n'est indiquée, les éventuelles redirections sont mises en place dans l'interpréteur courant et l'état renvoyé est 0. S'il y a une erreur de redirection, l'état renvoyé est 1.

source: Cause the shell to exit with a status of I<n>. If I<n> is omitted, the exit status is that of the last command executed. A trap on E<.SM> B<EXIT> is executed before the shell terminates.
fr: Conduit à la terminaison de l'interpréteur avec un état de I<n>. Si I<n> est omis, l'état final est celui de la dernière commande exécutée. Une capture sur E<.SM B<EXIT>> est exécutée avant que l'interpréteur termine.

source: B<export> [B<-fn>\^] [I<name>[=I<word>]] ...
fr: B<export> [B<-fn>\^] [I<nom>[=I<mot>]] ...

source: The supplied I<names> are marked for automatic export to the environment of subsequently executed commands. If the B<-f> option is given, the I<names> refer to functions. If no I<names> are given, or if the B<-p> option is supplied, a list of all names that are exported in this shell is printed. The B<-n> option causes the export property to be removed from each I<name>. If a variable name is followed by =I<word>, the value of the variable is set to I<word>. B<export> returns an exit status of 0 unless an invalid option is encountered, one of the I<names> is not a valid shell variable name, or B<-f> is supplied with a I<name> that is not a function.
fr: Les I<noms> fournis sont marqués pour être exportés automatiquement dans l'environnement des commandes exécutées par la suite. Si l'option B<-f> est indiquée, les I<noms> se réfèrent à des fonctions. Si aucun I<nom> n'est donné ou si l'option B<-p> est fournie, une liste est affichée indiquant l'ensemble des noms exportés dans cet interpréteur. L'option B<-n> conduit à supprimer l'attribut d'exportation de chacune des variables I<nom>mées. Si un nom de variable est suivi par =I<mot>, la valeur de la variable est mise à I<mot>. B<export> renvoie un état final de 0 à moins qu'une option incorrecte soit rencontrée ou si l'un des I<noms> n'est pas un nom correct de variable de l'interpréteur ou si l'option B<-f> est fournie avec un I<nom> qui n'est pas une fonction.

source: B<fc> [B<-e> I<ename>] [B<-nlr>] [I<first>] [I<last>]
fr: B<fc> [B<-e> I<éditeur>] [B<-nlr>] [I<premier>] [I<dernier>]

source: B<fc> B<-s> [I<pat>=I<rep>] [I<cmd>]
fr: B<fc> B<-s> [I<motif>=I<nouveau>] [I<commande>]

source: Fix Command. In the first form, a range of commands from I<first> to I<last> is selected from the history list. I<First> and I<last> may be specified as a string (to locate the last command beginning with that string) or as a number (an index into the history list, where a negative number is used as an offset from the current command number). If I<last> is not specified it is set to the current command for listing (so that
fr: Commandes épinglées (Fix Command). Dans la première forme, une plage de commandes, entre la I<première> et la I<dernière>, est sélectionné dans la file d'historique. La I<première> et la I<dernière> peuvent être spécifiées sous forme de chaînes (pour trouver la dernière commande commençant par cette chaîne) ou sous forme numérique (un indice dans la file d'historique où un nombre négatif est utilisé comme décalage par rapport au numéro de la commande courante). Si la I<dernière> n'est pas spécifiée, elle est mise à la commande courante si l'on veut afficher la liste (ainsi

source: prints the last 10 commands) and to I<first> otherwise. If I<first> is not specified it is set to the previous command for editing and -16 for listing.
fr: affiche les 10 dernières commandes) et qu'il s'agit de la même que la I<première> sinon. Si la I<première> n'est pas spécifiée, elle est mise à la commande précédente pour une édition et à -16 pour l'affichage de liste.

source: The B<-n> option suppresses the command numbers when listing. The B<-r> option reverses the order of the commands. If the B<-l> option is given, the commands are listed on standard output. Otherwise, the editor given by I<ename> is invoked on a file containing those commands. If I<ename> is not given, the value of the E<.SM> B<FCEDIT> variable is used, and the value of E<.SM> B<EDITOR> if E<.SM> B<FCEDIT> is not set. If neither variable is set, E<.FN vi> is used. When editing is complete, the edited commands are echoed and executed.
fr: L'option B<-n> supprime l'affichage des numéros dans la liste. L'option B<-r> inverse l'ordre des commandes. Si l'option B<-l> est indiquée, les commandes sont affichées sur la sortie standard. Sinon, l'I<éditeur> indiqué est appelé avec un fichier contenant les commandes sélectionnées. Si aucun I<éditeur> n'est indiqué, on utilise la valeur de la variable E<.SM B<FCEDIT>> ou la valeur de E<.SM B<EDITOR>> si E<.SM B<FCEDIT>> n'existe pas. Si aucune variable n'existe, E<.FN vi> est utilisé. Lorsque l'édition se termine, les commandes sont affichées puis exécutées.

source: In the second form, I<command> is re-executed after each instance of I<pat> is replaced by I<rep>. A useful alias to use with this is
fr: Dans la seconde forme, la I<commande> est ré-exécutée après avoir remplacé chaque instance du I<motif> par I<nouveau>. Un alias utile pour ceci est

source: so that typing
fr: ainsi en tapant

source: runs the last command beginning with
fr: on relance la dernière commande commençant par

source: and typing
fr: et en tapant

source: re-executes the last command.
fr: on ré-exécute la commande précédente.
