Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: [I<n>]B<E<lt>E<gt>>I<word>
fr: [I<n>]B<E<lt>E<gt>>I<mot>

source: causes the file whose name is the expansion of I<word> to be opened for both reading and writing on file descriptor I<n>, or on file descriptor 0 if I<n> is not specified. If the file does not exist, it is created.
fr: conduit à l'ouverture du fichier dont le nom résulte du développement du I<mot>, à la fois en lecture et en écriture et lui affecte le descripteur de fichier I<n> ou bien le descripteur 0 si I<n> n'est pas mentionné. Si le fichier n'existe pas, il est créé.

source: ALIASES
fr: ALIAS

source: I<Aliases> allow a string to be substituted for a word when it is used as the first word of a simple command. The shell maintains a list of aliases that may be set and unset with the B<alias> and B<unalias> builtin commands (see E<.SM> B<SHELL BUILTIN COMMANDS> below). The first word of each simple command, if unquoted, is checked to see if it has an alias. If so, that word is replaced by the text of the alias. The characters B</>, B<$>, B<`>, and B<=> and any of the shell I<metacharacters> or quoting characters listed above may not appear in an alias name. The replacement text may contain any valid shell input, including shell metacharacters. The first word of the replacement text is tested for aliases, but a word that is identical to an alias being expanded is not expanded a second time. This means that one may alias B<ls> to B<ls -F>, for instance, and B<bash> does not try to recursively expand the replacement text. If the last character of the alias value is a I<blank>, then the next command word following the alias is also checked for alias expansion.
fr: Les I<alias> permettent de substituer une chaîne à un mot lorsqu'il est utilisé comme premier mot d'une commande simple. L'interpréteur gère une liste d'alias qui peuvent être créés et détruits avec les commandes internes B<alias> et B<unalias> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). L'interpréteur vérifie si le premier mot de chaque commande simple, si non protégé, est un alias. Si c'est le cas, ce mot est remplacé par le texte de l'alias. Les caractères B</>, B<$>, B<`> et B<=> et tout I<métacaractère> ou caractère de protection décrits plus haut ne peuvent pas apparaître dans un nom d'alias. Le texte de remplacement peut contenir n'importe quelle entrée correcte pour l'interpréteur, y compris les métacaractères d'interpréteur. L'interpréteur vérifie si le premier mot du texte de remplacement est à son tour un alias, mais un mot identique à un alias en cours de développement n'est pas développé une seconde fois. Ceci signifie qu'on peut, par exemple, créer un alias B<ls> valant B<ls -F> et B<bash> n'essaiera pas de développer récursivement le texte de substitution. Si le dernier caractère de la valeur de l'alias est un I<blanc>, alors le prochain mot de commande suivant l'alias connaîtra aussi le développement d'alias.

source: Aliases are created and listed with the B<alias> command, and removed with the B<unalias> command.
fr: Les alias sont créés et affichés avec la commande B<alias> et supprimés avec la commande B<unalias>.

source: There is no mechanism for using arguments in the replacement text. If arguments are needed, a shell function should be used (see E<.SM> B<FUNCTIONS> below).
fr: Il n'existe pas de mécanisme permettant d'utiliser des arguments dans le texte de remplacement. S'ils sont nécessaires, une fonction de l'interpréteur devrait être utilisée (voir E<.SM B<FONCTIONS>> plus bas).

source: Aliases are not expanded when the shell is not interactive, unless the B<expand_aliases> shell option is set using B<shopt> (see the description of B<shopt> under E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: Les alias ne sont pas développés quand l'interpréteur n'est pas interactif sauf si l'option B<expand_aliases> de l'interpréteur est créée par la commande B<shopt> (voir plus bas la description de B<shopt> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: The rules concerning the definition and use of aliases are somewhat confusing. B<Bash> always reads at least one complete line of input before executing any of the commands on that line. Aliases are expanded when a command is read, not when it is executed. Therefore, an alias definition appearing on the same line as another command does not take effect until the next line of input is read. The commands following the alias definition on that line are not affected by the new alias. This behavior is also an issue when functions are executed. Aliases are expanded when a function definition is read, not when the function is executed, because a function definition is itself a compound command. As a consequence, aliases defined in a function are not available until after that function is executed. To be safe, always put alias definitions on a separate line, and do not use B<alias> in compound commands.
fr: Les règles concernant la définition et l'utilisation des alias sont un peu confuses. B<Bash> lit toujours au moins une ligne d'entrée complètement avant d'exécuter une commande de cette ligne. Les alias sont traités lorsque la commande est lue et non pas lorsqu'elle est exécutée. Ainsi, une définition d'alias apparaissant sur la même ligne qu'une autre commande ne prend pas effet avant la lecture de la prochaine ligne d'entrée. Autrement dit, une commande placée à la suite d'une définition d'alias, sur la même ligne ne sera pas affectée par cet alias. Ce comportement est également important lors de l'exécution des fonctions. Les alias sont traités lorsque la définition de la fonction est lue et non pas lors de l'exécution de cette fonction. Ainsi des alias définis dans une fonction ne sont pas disponibles avant la fin de l'exécution de la fonction. Pour plus de tranquillité, placez toujours les définitions d'alias sur des lignes isolées et n'utilisez jamais la commande B<alias> dans les commandes composées.

source: For almost every purpose, aliases are superseded by shell functions.
fr: Pour quasiment chaque usage, les alias sont surpassés par les fonctions de l'interpréteur.

source: FUNCTIONS
fr: FONCTIONS

source: A shell function, defined as described above under E<.SM> B<SHELL GRAMMAR>, stores a series of commands for later execution. When the name of a shell function is used as a simple command name, the list of commands associated with that function name is executed. Functions are executed in the context of the current shell; no new process is created to interpret them (contrast this with the execution of a shell script). When a function is executed, the arguments to the function become the positional parameters during its execution. The special parameter B<#> is updated to reflect the change. Special parameter 0 is unchanged. The first element of the E<.SM> B<FUNCNAME> variable is set to the name of the function while the function is executing. All other aspects of the shell execution environment are identical between a function and its caller with the exception that the E<.SM> B<DEBUG> and B<RETURN> traps (see the description of the B<trap> builtin under E<.SM> B<SHELL BUILTIN COMMANDS> below) are not inherited unless the function has been given the B<trace> attribute (see the description of the E<.SM> B<declare> builtin below) or the B<-o functrace> shell option has been enabled with the B<set> builtin (in which case all functions inherit the B<DEBUG> and B<RETURN> traps).
fr: Une fonction de l'interpréteur, définie comme décrit plus haut, dans E<.SM B<GRAMMAIRE DE L'INTERPRÉTEUR>,> conserve une suite de commandes pour exécution ultérieure. Lorsque le nom d'une fonction de l'interpréteur est utilisée comme un simple nom de commande, la liste des commandes associées à ce nom de fonction est exécutée. Les fonctions sont exécutées dans le contexte de l'interpréteur courant ; aucun nouveau processus n'est créé pour les interpréter (à la différence d'un script). Lorsqu'une fonction est exécutée, les arguments de la fonction deviennent les paramètres positionnels pendant son exécution. Le paramètre spécial B<#> est mis à jour en conséquence. Le paramètre spécial 0 reste inchangé. Le premier élément de la variable E<.SM B<FUNCNAME>> est mis au nom de la fonction pendant son exécution. Tous les autres aspects de l'environnement d'exécution de l'interpréteur sont identiques entre la fonction et le contexte d'appel, à l'exception que les captures de E<.SM B<DEBUG> et B<RETURN>> (voir plus bas la description de la commande interne B<trap> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>) ne sont pas héritées à moins que la fonction ait l'attribut B<trace> de positionné (voir plus bas la description de la commande interne B<declare>) ou que l'option d'interpréteur B<-o functrace> ait été activée avec la commande interne B<set> (auquel cas toutes les fonctions hériteront des captures de B<DEBUG> et B<RETURN>).

source: Variables local to the function may be declared with the B<local> builtin command. Ordinarily, variables and their values are shared between the function and its caller.
fr: Les variables locales d'une fonction peuvent être déclarées avec la commande interne B<local>. Autrement, les variables et leurs valeurs sont partagées entre la fonction et son appelant.

source: If the builtin command B<return> is executed in a function, the function completes and execution resumes with the next command after the function call. Any command associated with the B<RETURN> trap is executed before execution resumes. When a function completes, the values of the positional parameters and the special parameter B<#> are restored to the values they had prior to the function's execution.
fr: Si la commande interne B<return> est exécutée dans une fonction, celle-ci se termine et l'exécution reprend avec la commande suivant l'appel de fonction. Toute commande associée à la capture de B<RETURN> est exécutée avant que l'exécution reprenne. Quand une fonction se termine, les paramètres positionnels et le paramètre spécial B<#> reprennent les valeurs qu'ils avaient avant l'appel de fonction.

source: Function names and definitions may be listed with the B<-f> option to the B<declare> or B<typeset> builtin commands. The B<-F> option to B<declare> or B<typeset> will list the function names only (and optionally the source file and line number, if the B<extdebug> shell option is enabled). Functions may be exported so that subshells automatically have them defined with the B<-f> option to the B<export> builtin. Note that shell functions and variables with the same name may result in multiple identically-named entries in the environment passed to the shell's children. Care should be taken in cases where this may cause a problem.
fr: Les noms des fonctions et leurs définitions peuvent être affichés avec l'option B<-f> des commandes internes B<declare> ou B<typeset>. Les options B<-F> de B<declare> ou B<typeset> n'afficheront que les noms des fonctions (et facultativement le fichier source et le numéro de ligne, si l'option d'interpréteur B<extdebug> est activée). Les fonctions peuvent être exportées avec l'option B<-f> de la commande interne B<export>, afin d'être automatiquement définies dans les sous-interpréteurs. Remarquez que les fonctions et variables de l'interpréteur de même nom pourront induire à plusieurs éléments de mêmes noms dans l'environnement passé aux enfants de l'interpréteur. Un soin particulier doit être pris dans les cas où cela peut conduire à un problème.

source: Functions may be recursive. No limit is imposed on the number of recursive calls.
fr: Les fonctions peuvent être récursives. Aucune limite n'est imposée quant au nombre d'appels récursifs.

source: ARITHMETIC EVALUATION
fr: ÉVALUATION ARITHMÉTIQUE

source: The shell allows arithmetic expressions to be evaluated, under certain circumstances (see the B<let> and B<declare> builtin commands and B<Arithmetic Expansion>). Evaluation is done in fixed-width integers with no check for overflow, though division by 0 is trapped and flagged as an error. The operators and their precedence, associativity, and values are the same as in the C language. The following list of operators is grouped into levels of equal-precedence operators. The levels are listed in order of decreasing precedence.
fr: L'interpréteur permet, dans certaines circonstances, l'évaluation d'expressions arithmétiques (voir les commandes internes B<let> et B<declare> ainsi que B<Développement arithmétique>). L'évaluation est effectuée en utilisant des entiers longs, sans vérification du débordement. Néanmoins, la division par 0 est capturée et marquée comme une erreur. Les opérateurs, leur priorité, associativité et leur valeur sont identiques à ceux du langage C. La liste suivante d'opérateurs est entre opérateurs de niveaux de priorité identiques. Les niveaux sont décrits par ordre de priorité décroissante.

source: variable post-increment and post-decrement
fr: post-incrément et post-décrément de variables

source: variable pre-increment and pre-decrement
fr: pré-incrément et pré-décrément de variables

source: unary minus and plus
fr: plus et moins unaires

source: logical and bitwise negation
fr: négations logique et binaire

source: multiplication, division, remainder
fr: multiplication, division, reste

source: addition, subtraction
fr: addition, soustraction

source: left and right bitwise shifts
fr: décalage arithmétique à gauche et à droite

source: comparison
fr: comparaisons

source: equality and inequality
fr: égalité et différence

source: bitwise AND
fr: ET binaire

source: bitwise exclusive OR
fr: OU exclusif binaire

source: bitwise OR
fr: OU binaire

source: logical AND
fr: ET logique

source: logical OR
fr: OU logique

source: conditional operator
fr: opérateur conditionnel

source: assignment
fr: affectations

source: comma
fr: virgule

source: Shell variables are allowed as operands; parameter expansion is performed before the expression is evaluated. Within an expression, shell variables may also be referenced by name without using the parameter expansion syntax. A shell variable that is null or unset evaluates to 0 when referenced by name without using the parameter expansion syntax. The value of a variable is evaluated as an arithmetic expression when it is referenced, or when a variable which has been given the I<integer> attribute using B<declare -i> is assigned a value. A null value evaluates to 0. A shell variable need not have its integer attribute turned on to be used in an expression.
fr: On peut utiliser les variables de l'interpréteur comme opérandes, le développement des paramètres étant effectué avant l'évaluation arithmétique. Dans une expression, les variables de l'interpréteur peuvent également être référencées par leur nom, sans utiliser la syntaxe de développement des paramètres. Une variable d'interpréteur qui est vide ou inexistante est évaluée à 0 lorsqu'on y accède par son nom sans utiliser la syntaxe de développement des paramètres. La valeur d'une variable est évaluée comme une expression arithmétique lorsqu'on y accède ou lorsqu'une variable, qui a vu son attribut I<integer> (entier) positionné en utilisant B<declare -i>, se voit affecter une valeur. Une valeur vide est évaluée à 0. Une variable d'interpréteur n'a donc pas besoin d'avoir son attribut integer de positionné pour être utilisable dans un calcul.

source: Constants with a leading 0 are interpreted as octal numbers. A leading 0x or 0X denotes hexadecimal. Otherwise, numbers take the form [I<base#>]n, where I<base> is a decimal number between 2 and 64 representing the arithmetic base, and I<n> is a number in that base. If I<base#> is omitted, then base 10 is used. The digits greater than 9 are represented by the lowercase letters, the uppercase letters, @, and _, in that order. If I<base> is less than or equal to 36, lowercase and uppercase letters may be used interchangeably to represent numbers between 10 and 35.
fr: Les constantes commençant par un 0 sont interprétées comme des nombres octaux. Un entête 0x ou 0X indique une valeur hexadécimale. Sinon, les nombres ont la forme [I<base#>]n ou la I<base> est un nombre décimal entre 2 et 64 représentant la base arithmétique et I<n> est un nombre exprimé dans cette base. Si la I<base#> est omise, la base 10 est utilisée. Les chiffres supérieurs à 9 sont représentés par les lettres minuscules, les lettres majuscules, le @ et le _, dans cet ordre. Si la I<base> est inférieure ou égale à 36 les minuscules et les majuscules peuvent être utilisées de façon interchangeable pour représenter les nombres entre 10 et 35.

source: Operators are evaluated in order of precedence. Sub-expressions in parentheses are evaluated first and may override the precedence rules above.
fr: Les opérateurs sont évalués par ordre de priorité. Les sous-expressions entre parenthèses sont évaluées en premier, ce qui permet de surpasser les règles de priorité ci-dessus.

source: CONDITIONAL EXPRESSIONS
fr: CONDITIONS

source: Conditional expressions are used by the B<[[> compound command and the B<test> and B<[> builtin commands to test file attributes and perform string and arithmetic comparisons. Expressions are formed from the following unary or binary primaries. If any I<file> argument to one of the primaries is of the form I</dev/fd/n>, then file descriptor I<n> is checked. If the I<file> argument to one of the primaries is one of I</dev/stdin>, I</dev/stdout>, or I</dev/stderr>, file descriptor 0, 1, or 2, respectively, is checked.
fr: Les conditions sont utilisées par la commande composée B<[[> et les commandes internes B<test> et B<[> pour vérifier l'état d'un fichier et effectuer des comparaisons arithmétiques ou sur des chaînes. Les conditions se forment à partir des primitives unaires ou binaires suivantes. Si un argument I<fichier> de l'une des primitives est de la forme I</dev/fd/n>, alors le descripteur de fichier I<n> est examiné. Si l'argument I<fichier> de l'une des primitives est parmi I</dev/stdin>, I</dev/stdout> ou I</dev/stderr>, le descripteur de fichier 0, 1 ou 2, respectivement, est examiné.

source: Unless otherwise specified, primaries that operate on files follow symbolic links and operate on the target of the link, rather than the link itself.
fr: À moins qu'il en soit spécifié autrement, les primitives relatives aux fichiers suivent les liens symboliques et opèrent sur la cible du lien plutôt que sur le lien lui-même.

source: See the description of the I<test> builtin command (section SHELL BUILTIN COMMANDS below) for the handling of parameters (i.e. missing parameters).
fr: Voir la description de la commande interne I<test> (paragraphe COMMANDES INTERNES DE L'INTERPRÉTEUR plus bas) pour la gestion des paramètres (c'est-à-dire des paramètres manquants).

source: B<-a >I<file>
fr: B<-a >I<fichier>

source: True if I<file> exists.
fr: Vrai si le I<fichier> existe.

source: B<-b >I<file>
fr: B<-b >I<fichier>

source: True if I<file> exists and is a block special file.
fr: Vrai si le I<fichier> existe et est un fichier spécial bloc.

source: B<-c >I<file>
fr: B<-c >I<fichier>

source: True if I<file> exists and is a character special file.
fr: Vrai si le I<fichier> existe et est un fichier spécial caractère.

source: B<-d >I<file>
fr: B<-d >I<fichier>

source: True if I<file> exists and is a directory.
fr: Vrai si le I<fichier> existe et est un répertoire.

source: B<-e >I<file>
fr: B<-e >I<fichier>

source: B<-f >I<file>
fr: B<-f >I<fichier>

source: True if I<file> exists and is a regular file.
fr: Vrai si le I<fichier> existe et est un fichier normal.

source: B<-g >I<file>
fr: B<-g >I<fichier>

source: True if I<file> exists and is set-group-id.
fr: Vrai si le I<fichier> existe et a son bit Set-GID de mis.

source: B<-h >I<file>
fr: B<-h >I<fichier>

source: True if I<file> exists and is a symbolic link.
fr: Vrai si le I<fichier> existe et est un lien symbolique.

source: B<-k >I<file>
fr: B<-k >I<fichier>

source: True if I<file> exists and its ``sticky'' bit is set.
fr: Vrai si le I<fichier> existe et a son bit « sticky » de mis.

source: B<-p >I<file>
fr: B<-p >I<fichier>

source: True if I<file> exists and is a named pipe (FIFO).
fr: Vrai si le I<fichier> existe et est un tube nommé (FIFO).

source: B<-r >I<file>
fr: B<-r >I<fichier>

source: True if I<file> exists and is readable.
fr: Vrai si le I<fichier> existe et est accessible en lecture.

source: B<-s >I<file>
fr: B<-s >I<fichier>

source: True if I<file> exists and has a size greater than zero.
fr: Vrai si le I<fichier> existe et a une taille strictement positive.

source: True if file descriptor I<fd> is open and refers to a terminal.
fr: Vrai si I<fd> est ouvert sur un terminal.

source: B<-u >I<file>
fr: B<-u >I<fichier>

source: True if I<file> exists and its set-user-id bit is set.
fr: Vrai si le I<fichier> existe et a son bit Set-UID de mis.

source: B<-w >I<file>
fr: B<-w >I<fichier>

source: True if I<file> exists and is writable.
fr: Vrai si le I<fichier> existe et est accessible en écriture.

source: B<-x >I<file>
fr: B<-x >I<fichier>

source: True if I<file> exists and is executable.
fr: Vrai si le I<fichier> existe et est exécutable.

source: B<-O >I<file>
fr: B<-O >I<fichier>

source: True if I<file> exists and is owned by the effective user id.
fr: Vrai si le I<fichier> existe et appartient à l'UID effectif de l'utilisateur.

source: B<-G >I<file>
fr: B<-G >I<fichier>

source: True if I<file> exists and is owned by the effective group id.
fr: Vrai si le I<fichier> existe et appartient au GID effectif du groupe.

source: B<-L >I<file>
fr: B<-L >I<fichier>

source: B<-S >I<file>
fr: B<-S >I<fichier>

source: True if I<file> exists and is a socket.
fr: Vrai si le I<fichier> existe et est une « socket ».

source: B<-N >I<file>
fr: B<-N >I<fichier>

source: True if I<file> exists and has been modified since it was last read.
fr: Vrai si le I<fichier> existe et a été modifié depuis sa dernière lecture.

source: I<file1> -B<nt> I<file2>
fr: I<fichier_1> -B<nt> I<fichier_2>

source: True if I<file1> is newer (according to modification date) than I<file2>, or if I<file1> exists and I<file2> does not.
fr: Vrai si le I<fichier_1> est plus récent que le I<fichier_2> (selon les dates de dernière modification) ou si I<fichier_1> existe et non I<fichier_2>.

source: I<file1> -B<ot> I<file2>
fr: I<fichier_1> -B<ot> I<fichier_2>

source: True if I<file1> is older than I<file2>, or if I<file2> exists and I<file1> does not.
fr: Vrai si le I<fichier_1> est plus vieux que le I<fichier_2> ou si I<fichier_2> existe et non pas I<fichier_1>.

source: I<file1> B<-ef> I<file2>
fr: I<fichier_1> B<-ef> I<fichier_2>

source: True if I<file1> and I<file2> refer to the same device and inode numbers.
fr: Vrai si le I<fichier_1> et le I<fichier_2> se réfèrent au même périphérique et ont les mêmes numéros d'i-nœuds.

source: B<-o >I<optname>
fr: B<-o >I<nom_opt>

source: True if shell option I<optname> is enabled. See the list of options under the description of the B<-o> option to the B<set> builtin below.
fr: Vrai si l'option d'interpréteur I<nom_opt> est activée. Consulter la liste des options plus bas dans la description de l'option B<-o> de la commande interne B<set>.

source: B<-z >I<string>
fr: B<-z >I<chaîne>

source: True if the length of I<string> is zero.
fr: Vrai si la longueur de la I<chaîne> est nulle.

source: I<string>
fr: I<chaîne>

source: B<-n >I<string>
fr: B<-n >I<chaîne>

source: True if the length of I<string> is non-zero.
fr: Vrai si la longueur de la I<chaîne> est non nulle.

source: I<string1> B<==> I<string2>
fr: I<chaîne_1> B<==> I<chaîne_2>

source: True if the strings are equal. B<=> may be used in place of B<==> for strict POSIX compliance.
fr: Vrai si les deux chaînes sont égales. Le symbole B<=> peut servir à remplacer B<==> pour une stricte conformité POSIX.
