Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: The maximum number of lines contained in the history file. When this variable is assigned a value, the history file is truncated, if necessary, to contain no more than that number of lines. The default value is 500. The history file is also truncated to this size after writing it when an interactive shell exits.
fr: Le nombre maximum de lignes contenues dans le fichier d'historique. Quand cette variable contient une valeur, le fichier historique est tronqué, si besoin, pour ne contenir que ce nombre de lignes. La valeur par défaut est 500. Ce fichier est aussi tronqué à cette taille après son écriture quand un interpréteur interactif termine.

source: A colon-separated list of patterns used to decide which command lines should be saved on the history list. Each pattern is anchored at the beginning of the line and must match the complete line (no implicit `B<*>' is appended). Each pattern is tested against the line after the checks specified by B<HISTCONTROL> are applied. In addition to the normal shell pattern matching characters, `B<&>' matches the previous history line. `B<&>' may be escaped using a backslash; the backslash is removed before attempting a match. The second and subsequent lines of a multi-line compound command are not tested, and are added to the history regardless of the value of B<HISTIGNORE>.
fr: Une liste de motifs, séparés par des deux-points, déterminant quelles lignes de commande devraient être sauvegardées dans la file d'historique. Chaque motif est accroché au début de la ligne et doit lui correspondre en complètement (aucun ajout de « B<*> » implicite). Chaque motif est comparé à chaque ligne après que les vérifications de B<HISTCONTROL> ont été appliquées. En plus des motifs génériques usuels de l'interpréteur, « B<&> » correspond à la ligne précédente de l'historique. « B<&> » peut être protégé par une contre-oblique ; elle est supprimée avant de tenter une comparaison. La seconde ligne et les suivantes d'une commande multiligne ne sont pas testées et sont ajoutées dans l'historique quelque soit la valeur de B<HISTIGNORE>.

source: The number of commands to remember in the command history (see E<.SM> B<HISTORY> below). The default value is 500.
fr: Le nombre de commandes à mémoriser dans l'historique (voir E<.SM B<HISTORIQUE>> plus bas). La valeur par défaut est 500.

source: If this variable is set and not null, its value is used as a format string for I<strftime>(3) to print the time stamp associated with each history entry displayed by the B<history> builtin. If this variable is set, time stamps are written to the history file so they may be preserved across shell sessions.
fr: Si cette variable existe et n'est pas vide, sa valeur est utilisée comme une chaîne de caractères par B<strftime>(3) afin d'imprimer l'horodatage associé à chaque élément de l'historique affichée par la commande interne B<history>. Si cette variable existe, les horodatages sont écrits dans le fichier historique afin d'être conservés au fur et à mesure des sessions de l'interpréteur.

source: The home directory of the current user; the default argument for the B<cd> builtin command. The value of this variable is also used when performing tilde expansion.
fr: Le répertoire d'accueil de l'utilisateur courant ; l'argument par défaut de la commande interne B<cd>. La valeur de cette variable est aussi utilisée lors du développement du tilde.

source: Contains the name of a file in the same format as E<.FN /etc/hosts> that should be read when the shell needs to complete a hostname. The list of possible hostname completions may be changed while the shell is running; the next time hostname completion is attempted after the value is changed, B<bash> adds the contents of the new file to the existing list. If E<.SM> B<HOSTFILE> is set, but has no value, B<bash> attempts to read E<.FN /etc/hosts> to obtain the list of possible hostname completions. When E<.SM> B<HOSTFILE> is unset, the hostname list is cleared.
fr: Contient le nom d'un fichier ayant le même format que E<.FN /etc/hosts> qui devra être lu lorsque l'interpréteur aura besoin de compléter un nom de machine. La liste des complètements possibles de noms de machines peut être changée pendant l'exécution de l'interpréteur ; à la tentative de complètement de nom de machine suivant le changement de valeur, B<bash> ajoute le contenu du nouveau fichier à la liste existante. Si E<.SM B<HOSTFILE>> existe mais est vide, B<bash> essaie de lire E<.FN /etc/hosts> pour obtenir la liste des complètements de noms de machines possibles. Lorsque E<.SM B<HOSTFILE>> est détruite, la liste des noms de machines est effacée.

source: The I<Internal Field Separator> that is used for word splitting after expansion and to split lines into words with the B<read> builtin command. The default value is ``E<lt>spaceE<gt>E<lt>tabE<gt>E<lt>newlineE<gt>''.
fr: Le I<séparateur de champs interne> (« I<Internal Field Separator> ») qui est utilisé pour le découpage en mots après les développements et pour découper les lignes en mots avec la commande interne B<read>. La valeur par défaut est « E<lt>espaceE<gt>E<lt>tabulationE<gt>E<lt>saut de ligneE<gt> ».

source: Controls the action of an interactive shell on receipt of an E<.SM> B<EOF> character as the sole input. If set, the value is the number of consecutive E<.SM> B<EOF> characters which must be typed as the first characters on an input line before B<bash> exits. If the variable exists but does not have a numeric value, or has no value, the default value is 10. If it does not exist, E<.SM> B<EOF> signifies the end of input to the shell.
fr: Commande le comportement d'un interpréteur interactif à réception d'un caractère E<.SM B<EOF>> (fin de fichier) comme unique saisie. Si existante la valeur est le nombre de caractères E<.SM B<EOF>> consécutifs qui doivent être tapés comme premiers caractères sur une ligne de saisie avant que B<bash> termine. Si la variable existe mais que sa valeur n'est pas numérique ou si elle n'a pas de valeur, la valeur par défaut est 10. Si elle n'existe pas, E<.SM B<EOF>> signifie la fin de la saisie pour l'interpréteur.

source: The filename for the B<readline> startup file, overriding the default of E<.FN ~/.inputrc> (see E<.SM> B<READLINE> below).
fr: Le nom du fichier de configuration de B<readline> prioritaire sur le fichier par défaut E<.FN ~/.inputrc> (voir E<.SM B<READLINE>> plus bas).

source: Used to determine the locale category for any category not specifically selected with a variable starting with B<LC_>.
fr: Détermine le paramètre linguistique régional pour toutes les catégories non spécifiquement précisées par une variable commençant par B<LC_>.

source: This variable overrides the value of B<LANG> and any other B<LC_> variable specifying a locale category.
fr: Cette variable surpasse B<LANG> et toute autre variable B<LC_> spécifiant une catégorie de paramètres linguistiques régionaux.

source: This variable determines the collation order used when sorting the results of pathname expansion, and determines the behavior of range expressions, equivalence classes, and collating sequences within pathname expansion and pattern matching.
fr: Cette variable détermine l'ordre de collation utilisé pour trier les résultats du développement des chemins et détermine le comportement des expressions de plage, des classes d'équivalences et des suites de collations dans le développement des chemins et la correspondance de motifs.

source: This variable determines the interpretation of characters and the behavior of character classes within pathname expansion and pattern matching.
fr: Cette variable détermine l'interprétation des caractères et le comportement des classes de caractères lors du développement des chemins et de la recherche de correspondances de motifs.

source: This variable determines the locale used to translate double-quoted strings preceded by a B<$>.
fr: Cette variable détermine le paramètre linguistique régional utilisé pour traduire les chaînes entre guillemets doubles précédées d'un B<$>.

source: This variable determines the locale category used for number formatting.
fr: Cette variable détermine le paramètre linguistique régional utilisé pour formater les nombres.

source: Used by the B<select> builtin command to determine the column length for printing selection lists. Automatically set upon receipt of a SIGWINCH.
fr: Utilisée par la commande interne B<select> pour déterminer la longueur de colonne lors de l'affichage des listes de sélection. Automatiquement mise à la réception d'un signal SIGWINCH.

source: If this parameter is set to a file name and the E<.SM> B<MAILPATH> variable is not set, B<bash> informs the user of the arrival of mail in the specified file.
fr: Si ce paramètre correspond à un nom de fichier et si la variable E<.SM B<MAILPATH>> est inexistante, B<bash> informe l'utilisateur de l'arrivée de messages dans le fichier spécifié.

source: Specifies how often (in seconds) B<bash> checks for mail. The default is 60 seconds. When it is time to check for mail, the shell does so before displaying the primary prompt. If this variable is unset, or set to a value that is not a number greater than or equal to zero, the shell disables mail checking.
fr: Indique l'intervalle (en secondes) avec lequel B<bash> vérifie si un nouveau message est arrivé. La valeur par défaut est 60 secondes. Lorsque le délai est écoulé, l'interpréteur vérifiera la présence d'un courriel avant d'afficher son invite de base. Si cette variable est inexistante, ou mise à une valeur qui n'est pas un nombre positif, l'interpréteur désactive la vérification des courriels.

source: A colon-separated list of file names to be checked for mail. The message to be printed when mail arrives in a particular file may be specified by separating the file name from the message with a `?'. When used in the text of the message, B<$_> expands to the name of the current mailfile. Example:
fr: Une liste de noms de fichiers séparés par des deux-points « : », dans lesquels on vérifiera l'arrivée de courriel. Le nom d'un fichier peut être suivi d'un point d'interrogation « ? », puis d'une chaîne de caractères spécifiant le message à afficher en cas de courriel. Dans cette chaîne, le paramètre B<$_> correspond au nom du fichier de courriel courant. Exemple :

source: B<MAILPATH>='/var/mail/bfox?"You have mail":~/shell-mail?"$_ has mail!"'
fr: B<MAILPATH>='/usr/spool/mail/bfox?"Vous avez du courriel":~/shell-mail?"$_ a du courriel !"'

source: B<Bash> supplies a default value for this variable, but the location of the user mail files that it uses is system dependent (e.g., /var/mail/B<$USER>).
fr: B<Bash> fournit une valeur par défaut pour cette variable, mais l'emplacement du fichier boîte à lettres dépend du système (par exemple /usr/spool/mail/B<$USER>).

source: If set to the value 1, B<bash> displays error messages generated by the B<getopts> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below). E<.SM> B<OPTERR> is initialized to 1 each time the shell is invoked or a shell script is executed.
fr: Si mis à la valeur 1, B<bash> affiche les messages d'erreurs engendrés par la commande interne B<getopts> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). E<.SM B<OPTERR>> est initialisée avec la valeur 1 à chaque appel de l'interpréteur ou au lancement d'un script.

source: The search path for commands. It is a colon-separated list of directories in which the shell looks for commands (see E<.SM> B<COMMAND EXECUTION> below). A zero-length (null) directory name in the value of B<PATH> indicates the current directory. A null directory name may appear as two adjacent colons, or as an initial or trailing colon. The default path is system-dependent, and is set by the administrator who installs B<bash>. A common value is
fr: Le chemin de recherche des commandes à exécuter. Il s'agit d'une liste de répertoires, séparés par des deux-points « : » dans lesquels l'interpréteur recherche les commandes (voir plus bas E<.SM B<EXÉCUTION DES COMMANDES>>). Un nom de répertoire de taille nulle (vide) dans la valeur de B<PATH> désigne le répertoire courant. Un répertoire vide peut apparaître comme deux deux-points consécutifs ou comme des deux-points en début ou en fin. Le chemin par défaut dépend du système et est choisi par l'administrateur installant B<bash>. Une valeur commune est

source: If this variable is in the environment when B<bash> starts, the shell enters I<posix mode> before reading the startup files, as if the B<--posix> invocation option had been supplied. If it is set while the shell is running, B<bash> enables I<posix mode>, as if the command
fr: Si cette variable existe dans l'environnement lorsque B<bash> démarre, l'interpréteur passe en I<mode posix> avant de lire les fichiers de configuration comme si l'option B<--posix> avait été fournie. Si elle est créée pendant que l'interpréteur est en cours d'exécution, B<bash> active le I<mode posix> comme si la commande

source: had been executed.
fr: avait été exécutée.

source: If set, the value is executed as a command prior to issuing each primary prompt.
fr: Si existante, sa valeur est exécutée comme commande préalablement à l'affichage de chaque invite de base.

source: The value of this parameter is expanded (see E<.SM> B<PROMPTING> below) and used as the primary prompt string. The default value is ``B<\es-\ev\e$ >''.
fr: La valeur de ce paramètre est développée puis utilisée comme la chaîne d'invite de base (voir E<.SM B<INVITE>> plus bas). La valeur par défaut est « B<\es-\ev\e$ > ».

source: The value of this parameter is expanded as with B<PS1> and used as the secondary prompt string. The default is ``B<E<gt> >''.
fr: La valeur de ce paramètre est développée comme B<PS1> puis utilisée comme chaîne d'invite secondaire. La valeur par défaut est « B<E<gt> > ».

source: The value of this parameter is used as the prompt for the B<select> command (see E<.SM> B<SHELL GRAMMAR> above).
fr: La valeur de ce paramètre est utilisée comme l'invite pour la commande I<select> (voir E<.SM B<GRAMMAIRE DE L'INTERPRÉTEUR>> plus haut).

source: The value of this parameter is expanded as with B<PS1> and the value is printed before each command B<bash> displays during an execution trace. The first character of E<.SM> B<PS4> is replicated multiple times, as necessary, to indicate multiple levels of indirection. The default is ``B<+ >''.
fr: La valeur de ce paramètre est développée comme B<PS1> puis affichée entre chaque commande lors d'un suivi d'exécution. Le premier caractère de E<.SM B<PS4>> est répété autant de fois que nécessaire pour indiquer le niveau d'imbrication. La valeur par défaut est « B<+ > ».

source: The full pathname to the shell is kept in this environment variable. If it is not set when the shell starts, B<bash> assigns to it the full pathname of the current user's login shell.
fr: Le chemin d'accès complet à l'interpréteur de commandes est conservé dans cette variable d'environnement. Si inexistante au démarrage de l'interpréteur, B<bash> lui affecte le chemin d'accès complet à l'interpréteur de commandes de connexion de l'utilisateur courant.

source: The value of this parameter is used as a format string specifying how the timing information for pipelines prefixed with the B<time> reserved word should be displayed. The B<%> character introduces an escape sequence that is expanded to a time value or other information. The escape sequences and their meanings are as follows; the braces denote optional portions.
fr: La valeur de ce paramètre est utilisée en tant que chaîne de format spécifiant comment les informations de paramétrage doivent être affichées pour les conduites précédées du mot réservé B<time>. Le caractère B<%> introduit une suite de caractères d'échappement qui est développée en une valeur de temps ou une autre information. Les suites de caractères d'échappement et leurs significations sont les suivantes ; les accolades marquent les parties facultatives.

source: A literal B<%>.
fr: Un B<%> seul (non interprété).

source: The elapsed time in seconds.
fr: Le temps écoulé en secondes.

source: The number of CPU seconds spent in user mode.
fr: Le temps processeur écoulé en mode utilisateur en secondes.

source: The number of CPU seconds spent in system mode.
fr: Le temps processeur écoulé en mode système en secondes.

source: The CPU percentage, computed as (%U + %S) / %R.
fr: Le pourcentage de temps processeur utilisé calculé avec (%U + %S) / %R.

source: The optional I<p> is a digit specifying the I<precision>, the number of fractional digits after a decimal point. A value of 0 causes no decimal point or fraction to be output. At most three places after the decimal point may be specified; values of I<p> greater than 3 are changed to 3. If I<p> is not specified, the value 3 is used.
fr: Le I<p> facultatif est un chiffre indiquant la I<précision>, le nombre de chiffres après la virgule. Une valeur de 0 conduit à affichage de nombre entiers. Trois chiffres au plus peuvent être affichés après la virgule ; tout chiffre supérieur à 3 sera changé en 3. Si I<p> n'est pas spécifié, la valeur 3 est utilisée.

source: The optional B<l> specifies a longer format, including minutes, of the form I<MM>mI<SS>.I<FF>s. The value of I<p> determines whether or not the fraction is included.
fr: Le B<l> facultatif spécifie un format plus long, incluant les minutes, de la forme I<MM>mI<SS>.I<DD>s. La valeur de I<p> détermine si la partie décimale est affichée ou non.

source: If this variable is not set, B<bash> acts as if it had the value B<$'\enreal\et%3lR\enuser\et%3lU\ensys\t%3lS'>. If the value is null, no timing information is displayed. A trailing newline is added when the format string is displayed.
fr: Si cette variable n'existe pas, B<bash> réagit comme si elle avait la valeur B<$'\enreal\et%3lR\enuser\et%3lU\ensys\t%3lS'>. Si la valeur est vide, aucune information de chronométrage n'est affichée. Un caractère final de saut de ligne est ajouté quand la chaîne de format est affichée.

source: If set to a value greater than zero, B<TMOUT> is treated as the default timeout for the B<read> builtin. The B<select> command terminates if input does not arrive after B<TMOUT> seconds when input is coming from a terminal. In an interactive shell, the value is interpreted as the number of seconds to wait for input after issuing the primary prompt. B<Bash> terminates after waiting for that number of seconds if input does not arrive.
fr: Si mise à une valeur strictement positive, B<TMOUT> est traitée comme le délai par défaut pour la commande interne B<read>. La commande B<select> termine s'il n'y a pas de saisie au bout de B<TMOUT> secondes lorsque l'entrée vient d'un terminal. Dans un interpréteur interactif, la valeur est interprétée comme le nombre de secondes à attendre pour une saisie après avoir émis l'interpréteur de base. B<bash> termine après avoir attendu pendant ce nombre de secondes si aucune saisie n'est arrivée.

source: If set, B<Bash> uses its value as the name of a directory in which B<Bash> creates temporary files for the shell's use.
fr: Si existante, B<Bash> utilise sa valeur comme le nom d'un répertoire dans lequel B<Bash> crée des fichiers temporaires nécessaires au fonctionnement de l'interpréteur.

source: This variable controls how the shell interacts with the user and job control. If this variable is set, single word simple commands without redirections are treated as candidates for resumption of an existing stopped job. There is no ambiguity allowed; if there is more than one job beginning with the string typed, the job most recently accessed is selected. The I<name> of a stopped job, in this context, is the command line used to start it. If set to the value I<exact>, the string supplied must match the name of a stopped job exactly; if set to I<substring>, the string supplied needs to match a substring of the name of a stopped job. The I<substring> value provides functionality analogous to the B<%?> job identifier (see E<.SM> B<JOB CONTROL> below). If set to any other value, the supplied string must be a prefix of a stopped job's name; this provides functionality analogous to the B<%>I<string> job identifier.
fr: Cette variable commande le comportement de l'interpréteur vis-à-vis de l'utilisateur et du contrôle des tâches. Si cette variable existe, les commandes simples constituées d'un seul mot, sans redirection, sont considérées comme de possibles relances de tâches suspendues. Aucune ambiguïté n'est possible, si plusieurs tâches commencent par la chaîne saisie, la tâche à laquelle il a été accédé le plus récemment est sélectionnée. Le I<nom> d'une tâche suspendue, dans ce contexte, est la ligne de commande utilisée pour la lancer. Si mise à la valeur I<exact>, la chaîne fournie doit correspondre exactement au nom d'une tâche suspendue ; si mise à I<substring>, la chaîne fournie doit correspondre à une sous-chaîne du nom de la tâche suspendue. La valeur I<substring> donne une fonctionnalité analogue à l'identificateur de tâche B<%?> (voir plus bas E<.SM B<CONTRÔLE DES TÂCHES>>). Si mise à toute autre valeur, la chaîne fournie doit être le préfixe du nom d'une tâche suspendue ; cela donne une fonctionnalité analogue à l'identificateur de tâche B<%>I<string>.

source: The name of a shell function to be called if a command cannot be found. The return value of this function should be 0, if the command is available after execution of the function, otherwise 127 (EX_NOTFOUND). Enabled only in interactive, non POSIX mode shells. This is a Debian extension.
fr: Le nom d'une fonction de l'interpréteur à appeler si une commande ne peut être trouvée. La valeur renvoyée par cette fonction devrait être 0, si la commande est disponible après exécution de la fonction, sinon 127 (EX_NOTFOUND). Activé seulement dans les interpréteurs interactif, en mode non POSIX. C'est une extension Debian.

source: The two or three characters which control history expansion and tokenization (see E<.SM> B<HISTORY EXPANSION> below). The first character is the I<history expansion> character, the character which signals the start of a history expansion, normally `B<!>'. The second character is the I<quick substitution> character, which is used as shorthand for re-running the previous command entered, substituting one string for another in the command. The default is `B<^>'. The optional third character is the character which indicates that the remainder of the line is a comment when found as the first character of a word, normally `B<#>'. The history comment character causes history substitution to be skipped for the remaining words on the line. It does not necessarily cause the shell parser to treat the rest of the line as a comment.
fr: Les deux ou trois caractères commandant le développement de l'historique et le découpage en lexèmes (voir plus bas E<.SM B<DÉVELOPPEMENT DE L'HISTORIQUE>>). Le premier caractère est le I<caractère de développement de l'historique>, c'est-à-dire celui qui indique le début d'un développement d'historique (normalement « B<!> »). Le second caractère est celui de I<substitution rapide>, utilisé comme raccourci pour relancer la commande précédente, en modifiant une partie de la chaîne. Par défaut il s'agit de « B<^> ». Le troisième caractère facultatif est celui qui indique, lorsqu'on le trouve en début de mot que le reste de la ligne est un commentaire. Normalement on utilise le caractère « B<#> ». Ce caractère de commentaire empêche le développement de l'historique pour tous les mots restants sur la ligne. Il ne conduit pas nécessairement l'analyseur de l'interpréteur à considérer le reste de la ligne comme un commentaire.

source: Arrays
fr: Tableaux
