Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: B<bind> [B<-m> I<keymap>] [B<-q> I<function>] [B<-u> I<function>] [B<-r> I<keyseq>]
fr: B<bind> [B<-m> I<jeu_de_raccourcis>] [B<-q> I<fonction>] [B<-u> I<fonction>] [B<-r> I<suite_de_touches>]

source: B<bind> [B<-m> I<keymap>] B<-f> I<filename>
fr: B<bind> [B<-m> I<jeu_de_raccourcis>] B<-f> I<fichier>

source: B<bind> [B<-m> I<keymap>] B<-x> I<keyseq>:I<shell-command>
fr: B<bind> [B<-m> I<jeu_de_raccourcis>] B<-x> I<suite_de_touches>:I<commande_de_l'interpréteur>

source: B<bind> [B<-m> I<keymap>] I<keyseq>:I<function-name>
fr: B<bind> [B<-m> I<jeu_de_raccourcis>] I<suite_de_touches>:I<nom_de_fonction>

source: B<bind> I<readline-command>
fr: B<bind> I<commande_readline>

source: Display current B<readline> key and function bindings, bind a key sequence to a B<readline> function or macro, or set a B<readline> variable. Each non-option argument is a command as it would appear in I<.inputrc>, but each binding or command must be passed as a separate argument; e.g., '"\eC-x\eC-r": re-read-init-file'. Options, if supplied, have the following meanings:
fr: Affiche les associations de touches B<readline> courantes et les raccourcis de fonctions, associe une suite de touches à une fonction ou une macro B<readline> ou crée une variable B<readline>. Chaque argument qui n'est pas une option est une commande comme elle devrait apparaître dans I<.inputrc>, mais chaque raccourci ou commande doit être fourni comme un argument indépendant ; par exemple « "\eC-x\eC-r": re-read-init-file ». Les options, si fournies, ont les significations suivantes :

source: B<-m >I<keymap>
fr: B<-m >I<jeu_de_raccourcis>

source: Use I<keymap> as the keymap to be affected by the subsequent bindings. Acceptable I<keymap> names are I<emacs, emacs-standard, emacs-meta, emacs-ctlx, vi, vi-move, vi-command>, and I<vi-insert>. I<vi> is equivalent to I<vi-command>; I<emacs> is equivalent to I<emacs-standard>.
fr: Utiliser le I<jeu_de_raccourcis> comme jeu de raccourcis devant être concerné par les raccourcis ultérieurs. Les noms de I<jeux_de_raccourcis> possibles sont I<emacs, emacs-standard, emacs-meta, emacs-ctlx, vi, vi-move, vi-command> et I<vi-insert>. I<vi> est équivalent à I<vi-command> ; I<emacs> est équivalent à I<emacs-standard>.

source: List the names of all B<readline> functions.
fr: Afficher la liste des noms de toutes les fonctions B<readline>.

source: Display B<readline> function names and bindings in such a way that they can be re-read.
fr: Affiche les noms des fonctions B<readline> et leurs raccourcis de façon à pouvoir les relire.

source: List current B<readline> function names and bindings.
fr: Affiche les noms des fonctions B<readline> et leurs raccourcis.

source: Display B<readline> variable names and values in such a way that they can be re-read.
fr: Affiche les noms des variables B<readline> et leurs valeurs de façon à pouvoir les relire.

source: List current B<readline> variable names and values.
fr: Affiche les noms des variables B<readline> et leurs valeurs.

source: Display B<readline> key sequences bound to macros and the strings they output in such a way that they can be re-read.
fr: Afficher les suites de touches B<readline> associées aux macros et les chaînes correspondantes, de façon à pouvoir les relire.

source: Display B<readline> key sequences bound to macros and the strings they output.
fr: Afficher les suites de touches B<readline> associées aux macros et les chaînes correspondantes.

source: B<-f >I<filename>
fr: B<-f >I<fichier>

source: Read key bindings from I<filename>.
fr: Lire les raccourcis clavier dans le I<fichier>.

source: B<-q >I<function>
fr: B<-q >I<fonction>

source: Query about which keys invoke the named I<function>.
fr: Rechercher les touches permettant d'appeler la I<fonction> indiquée.

source: B<-u >I<function>
fr: B<-u >I<fonction>

source: Unbind all keys bound to the named I<function>.
fr: Dissocier toutes les touches associées à I<fonction>.

source: B<-r >I<keyseq>
fr: B<-r >I<suite_de_touches>

source: Remove any current binding for I<keyseq>.
fr: Supprimer tout raccourci courant pour la I<suite_de_touches>.

source: B<-x >I<keyseq>B<:>I<shell-command>
fr: B<-x >I<suite_de_touches>B<:>I<commande_de_l'interpréteur>

source: Cause I<shell-command> to be executed whenever I<keyseq> is entered.
fr: Conduit à l'exécution de I<commande_de_l'interpréteur> dès que la I<suite de touches> est saisie.

source: The return value is 0 unless an unrecognized option is given or an error occurred.
fr: La valeur renvoyée est 0 sauf si une option non reconnue est indiquée ou si une erreur s'est produite.

source: Exit from within a B<for>, B<while>, B<until>, or B<select> loop. If I<n> is specified, break I<n> levels. I<n> must be \(E<gt>= 1. If I<n> is greater than the number of enclosing loops, all enclosing loops are exited. The return value is 0 unless the shell is not executing a loop when B<break> is executed.
fr: Sortir d'une boucle B<for>, B<while>, B<until> ou B<select>. Si I<n> est spécifié, sortir de I<n> niveaux de boucles. I<n> doit être \(E<gt>= 1. Si I<n> est supérieur au nombre de boucles imbriquées, on sort de l'ensemble d'entre elles. La valeur renvoyée est 0 à moins que l'interpréteur n'est pas en train d'exécuter une boucle lorsque le B<break> est exécuté.

source: B<builtin> I<shell-builtin> [I<arguments>]
fr: B<builtin> I<commande_interne> [I<arguments>]

source: Execute the specified shell builtin, passing it I<arguments>, and return its exit status. This is useful when defining a function whose name is the same as a shell builtin, retaining the functionality of the builtin within the function. The B<cd> builtin is commonly redefined this way. The return status is false if I<shell-builtin> is not a shell builtin command.
fr: Exécuter la I<commande interne> de l'interpréteur indiquée, en lui passant les I<arguments>, puis renvoyer son état final. Ceci est utile lorsqu'on définit une fonction ayant le même nom qu'une commande interne, mais qu'on a besoin d'appeler cette commande depuis l'intérieur de la fonction. On redéfinit souvent la commande interne B<cd> de cette façon. L'état renvoyé est faux si la I<commande_interne> n'est pas une commande interne de l'interpréteur.

source: B<cd> [B<-L|-P>] [I<dir>]
fr: B<cd> [B<-L|-P>] [I<rép>]

source: Change the current directory to I<dir>. The variable E<.SM> B<HOME> is the default I<dir>. The variable E<.SM> B<CDPATH> defines the search path for the directory containing I<dir>. Alternative directory names in E<.SM> B<CDPATH> are separated by a colon (:). A null directory name in E<.SM> B<CDPATH> is the same as the current directory, i.e., ``B<.>''. If I<dir> begins with a slash (/), then E<.SM> B<CDPATH> is not used. The B<-P> option says to use the physical directory structure instead of following symbolic links (see also the B<-P> option to the B<set> builtin command); the B<-L> option forces symbolic links to be followed. An argument of B<-> is equivalent to E<.SM> B<$OLDPWD>. If a non-empty directory name from B<CDPATH> is used, or if B<-> is the first argument, and the directory change is successful, the absolute pathname of the new working directory is written to the standard output. The return value is true if the directory was successfully changed; false otherwise.
fr: Remplacer le répertoire de travail courant par I<rép>. La variable E<.SM B<HOME>> est la valeur par défaut de I<rép>. La variable E<.SM B<CDPATH>> définit des chemins de recherche pour trouver le répertoire contenant I<rép>. Les répertoires possibles y sont fournis dans une liste séparées par des deux-points « : ». Un nom de répertoire vide dans E<.SM B<CDPATH>> est équivalent au répertoire courant, c'est-à-dire « B<.> ». Si I<rép> commence par une barre oblique (/), alors E<.SM B<CDPATH>> n'est pas utilisé. L'option B<-P> dit de n'employer que la structure de répertoires physiques au lieu de suivre les liens symboliques (voir aussi l'option B<-P> de la commande interne B<set>) l'option B<-L> force à suivre les liens symboliques. Un argument B<-> est équivalent à E<.SM B<$OLDPWD>.> Si un nom de répertoire non vide de B<CDPATH> est utilisé ou si B<-> est le premier argument et si le changement de répertoire réussit, le chemin absolu du nouveau répertoire de travail est écrit sur la sortie standard. La valeur renvoyée est vrai si le changement de répertoire a réussi ; faux sinon.

source: Returns the context of any active subroutine call (a shell function or a script executed with the B<.> or B<source> builtins. Without I<expr>, B<caller> displays the line number and source filename of the current subroutine call. If a non-negative integer is supplied as I<expr>, B<caller> displays the line number, subroutine name, and source file corresponding to that position in the current execution call stack. This extra information may be used, for example, to print a stack trace. The current frame is frame 0. The return value is 0 unless the shell is not executing a subroutine call or I<expr> does not correspond to a valid position in the call stack.
fr: Renvoie le contexte de tout appel de sous-programme actif (une fonction de l'interpréteur ou un script lancé avec les commandes internes B<.> ou B<source>). Sans I<expr>, B<caller> affiche le numéro de ligne et le nom de fichier du sous-programme courant. Si un entier positif est fourni comme I<expr>, B<caller> affiche le numéro de ligne, le nom du sous-programme et le nom de fichier source correspondant à la position dans la pile d'appels d'exécution courante. Cette information supplémentaire peut être utilisée, par exemple, pour afficher une trace de la pile. La trame courante est la trame 0. La valeur renvoyée est 0 à moins que l'interpréteur n'exécute pas de sous-programme ou que I<expr> ne corresponde pas à une position correcte dans la pile d'appels.

source: B<command> [B<-pVv>] I<command> [I<arg> ...]
fr: B<command> [B<-pVv>] I<commande> [I<arguments> ...]

source: Run I<command> with I<args> suppressing the normal shell function lookup. Only builtin commands or commands found in the E<.SM> B<PATH> are executed. If the B<-p> option is given, the search for I<command> is performed using a default value for B<PATH> that is guaranteed to find all of the standard utilities. If either the B<-V> or B<-v> option is supplied, a description of I<command> is printed. The B<-v> option causes a single word indicating the command or file name used to invoke I<command> to be displayed; the B<-V> option produces a more verbose description. If the B<-V> or B<-v> option is supplied, the exit status is 0 if I<command> was found, and 1 if not. If neither option is supplied and an error occurred or I<command> cannot be found, the exit status is 127. Otherwise, the exit status of the B<command> builtin is the exit status of I<command>.
fr: Lancer la I<commande> avec les I<arguments> indiqués, mais en simplifiant le processus habituel de recherche des commandes. Seules les commandes internes et les commandes trouvées dans le E<.SM B<PATH>> seront exécutées. Si l'option B<-p> est indiquée, la recherche de la I<commande> est effectuée en utilisant une valeur par défaut pour B<PATH> garantissant de trouver tous les utilitaires standards. Si soit l'option B<-V> soit l'option B<-v> est fournie, une description de la I<commande> est affichée. L'option B<-v> conduit à n'afficher qu'un seul mot indiquant la commande ou le nom de fichier utilisé pour appeler la I<commande>. L'option B<-V> fournit une description plus prolixe. Si l'option B<-V> ou B<-v> est fournie, l'état final est 0 si la I<commande> a été trouvée et 1 sinon. Si aucune option n'est fournie et si une erreur s'est produite ou si la I<commande> ne peut être trouvée, l'état final est 127. Sinon, l'état final de la commande interne est l'état final de I<commande>.

source: B<compgen> [I<option>] [I<word>]
fr: B<compgen> [I<option>] [I<mot>]

source: Generate possible completion matches for I<word> according to the I<option>s, which may be any option accepted by the B<complete> builtin with the exception of B<-p> and B<-r>, and write the matches to the standard output. When using the B<-F> or B<-C> options, the various shell variables set by the programmable completion facilities, while available, will not have useful values.
fr: Produit les correspondances des complètements possibles pour I<mot> selon les I<option>s, qui peuvent être toute option acceptée par la commande interne B<complete> à l'exception de B<-p> et B<-r> et écrit le résultat sur la sortie standard. Lorsqu'on utilise les options B<-F> ou B<-C>, les diverses variables de l'interpréteur créées par les outils de complètement programmables, lorsque disponibles, n'auront pas de valeurs utilisables.

source: The matches will be generated in the same way as if the programmable completion code had generated them directly from a completion specification with the same flags. If I<word> is specified, only those completions matching I<word> will be displayed.
fr: Les correspondances seront produites de la même façon que si le programme de complètement programmable les avait produites directement à partir d'une spécification de complètement avec les mêmes attributs. Si I<mot> est spécifié, seules les complètements qui correspondent à I<mot> sont affichés.

source: The return value is true unless an invalid option is supplied, or no matches were generated.
fr: La valeur renvoyée est vrai, à moins qu'une option incorrecte a été fournie ou qu'aucune correspondance n'a été produite.

source: B<complete> [B<-abcdefgjksuv>] [B<-o> I<comp-option>] [B<-A> I<action>] [B<-G> I<globpat>] [B<-W> I<wordlist>] [B<-P> I<prefix>] [B<-S> I<suffix>]
fr: B<complete> [B<-abcdefgjksuv>] [B<-o> I<option-complètement>] [B<-A> I<action>] [B<-G> I<globpat>] [B<-W> I<liste_de_mots>] [B<-P> I<prefix>] [B<-S> I<suffix>]

source: [B<-X> I<filterpat>] [B<-F> I<function>] [B<-C> I<command>] I<name> [I<name ...>]
fr: [B<-X> I<motif_filtre>] [B<-F> I<fonction>] [B<-C> I<commande>] I<nom> [I<nom ...>]

source: B<complete> B<-pr> [I<name> ...]
fr: B<complete> B<-pr> [I<nom> ...]

source: Specify how arguments to each I<name> should be completed. If the B<-p> option is supplied, or if no options are supplied, existing completion specifications are printed in a way that allows them to be reused as input. The B<-r> option removes a completion specification for each I<name>, or, if no I<name>s are supplied, all completion specifications.
fr: Spécifie comment les arguments de chaque I<nom> doivent être complétés. Si l'option B<-p> est fournie ou si aucune option n'est fournie, les spécifications de complètement existantes sont affichées de telle façon qu'elles puissent être réutilisées comme entrée. L'option B<-r> retire une spécification de complètement à chaque I<nom> fourni ou, si aucun I<nom> n'est fourni, toutes les spécifications de complètement.

source: The process of applying these completion specifications when word completion is attempted is described above under B<Programmable Completion>.
fr: Le processus d'application de ces spécifications de complètement lorsqu'un complètement de mot est tenté est décrit plus haut dans B<Complètement programmable>.

source: Other options, if specified, have the following meanings. The arguments to the B<-G>, B<-W>, and B<-X> options (and, if necessary, the B<-P> and B<-S> options) should be quoted to protect them from expansion before the B<complete> builtin is invoked.
fr: Les autres options, si spécifiées, ont les significations suivantes. Les arguments des options B<-G>, B<-W> et B<-X> (et, si nécessaire, les options B<-P> et B<-S>) devraient être protégées pour leur éviter le développement avant que la commande interne B<complete> soit appelée.

source: B<-o> I<comp-option>
fr: B<-o> I<option-complètement>

source: The I<comp-option> controls several aspects of the compspec's behavior beyond the simple generation of completions. I<comp-option> may be one of:
fr: L'I<option-complètement> commande plusieurs aspects du comportement des spécifications de complètement au-delà de la simple production de complètement. I<option-complètement> peut être l'une des suivantes :

source: Perform the rest of the default B<bash> completions if the compspec generates no matches.
fr: Effectuer le reste des complètements par défaut de B<bash> si la spécification de complètement ne produit aucune correspondance.

source: Use readline's default filename completion if the compspec generates no matches.
fr: Utiliser le complètement de nom de fichier par défaut de readline si la spécification de complètement ne produit aucune correspondance.

source: Perform directory name completion if the compspec generates no matches.
fr: Effectuer le complètement de nom de répertoire si la spécification de complètement ne produit aucune correspondance.

source: Tell readline that the compspec generates filenames, so it can perform any filename-specific processing (like adding a slash to directory names or suppressing trailing spaces). Intended to be used with shell functions.
fr: Indiquer à readline que la spécification de complètement produit des noms de fichiers, ainsi il peut effectuer tout traitement spécifique aux noms de fichiers (comme ajouter une barre oblique aux noms de répertoires, supprimer les espaces de fin de ligne). Destinée à être utilisée avec les fonctions de l'interpréteur.

source: Tell readline not to append a space (the default) to words completed at the end of the line.
fr: Indiquer à readline de ne pas ajouter une espace (comportement par défaut) aux mots complétés en fin de ligne.

source: After any matches defined by the compspec are generated, directory name completion is attempted and any matches are added to the results of the other actions.
fr: Après que toutes les correspondances définies par la spécification de complètement ont été produites, une tentative de complètement de nom de répertoire est effectuée et toutes les correspondances sont ajoutées aux résultats des autres actions.

source: The I<action> may be one of the following to generate a list of possible completions:
fr: L'I<action> peut être l'une des suivantes pour produire une liste des complètements possibles :

source: Alias names. May also be specified as B<-a>.
fr: Noms d'alias. Peut également être spécifiée avec B<-a>.

source: Array variable names.
fr: Noms des variables de type tableau.

source: B<Readline> key binding names.
fr: Noms des raccourcis clavier B<readline>.

source: Names of shell builtin commands. May also be specified as B<-b>.
fr: Noms des commandes internes de l'interpréteur. Peut également être spécifiée avec B<-b>.

source: Command names. May also be specified as B<-c>.
fr: Nom des commandes. Peut également être spécifiée avec B<-c>.

source: Directory names. May also be specified as B<-d>.
fr: Noms des répertoires. Peut également être spécifiée avec B<-d>.

source: Names of disabled shell builtins.
fr: Noms des commandes internes de l'interpréteur désactivées.

source: Names of enabled shell builtins.
fr: Noms des commandes internes de l'interpréteur activées.

source: Names of exported shell variables. May also be specified as B<-e>.
fr: Noms des variables de l'interpréteur exportées. Peut également être spécifiée avec B<-e>.

source: File names. May also be specified as B<-f>.
fr: Noms des fichiers. Peut également être spécifiée avec B<-f>.

source: Names of shell functions.
fr: Noms des fonctions de l'interpréteur.

source: Group names. May also be specified as B<-g>.
fr: Noms des groupes. Peut également être spécifiée avec B<-g>.

source: Help topics as accepted by the B<help> builtin.
fr: Sujets de l'aide acceptés par la commande interne B<help>.

source: Hostnames, as taken from the file specified by the E<.SM> B<HOSTFILE> shell variable.
fr: Noms de machines tels qu'ils sont extraits du fichier spécifié par la variable de l'interpréteur E<.SM B<HOSTFILE>.>

source: Job names, if job control is active. May also be specified as B<-j>.
fr: Noms des tâches si le contrôle des tâches est actif. Peut également être spécifiée avec B<-j>.

source: Shell reserved words. May also be specified as B<-k>.
fr: Mots réservés de l'interpréteur. Peut également être spécifiée avec B<-k>.

source: Names of running jobs, if job control is active.
fr: Noms des tâches en cours d'exécution si le contrôle des tâches est actif.

source: Service names. May also be specified as B<-s>.
fr: Noms des services. Peut également être spécifiée avec B<-s>.

source: Valid arguments for the B<-o> option to the B<set> builtin.
fr: Arguments corrects de l'option B<-o> de la commande interne B<set>.

source: Shell option names as accepted by the B<shopt> builtin.
fr: Noms des options d'interpréteur acceptées par la commande interne B<shopt>.

source: Signal names.
fr: Noms des signaux.

source: Names of stopped jobs, if job control is active.
fr: Noms des tâches suspendues si le contrôle des tâches est actif.

source: User names. May also be specified as B<-u>.
fr: Noms des utilisateurs. Peut également être spécifiée avec B<-u>.

source: Names of all shell variables. May also be specified as B<-v>.
fr: Noms de toutes les variables de l'interpréteur. Peut également être spécifiée avec B<-v>.

source: The filename expansion pattern I<globpat> is expanded to generate the possible completions.
fr: Le motif de développement des noms de fichiers I<globpat> est développé pour produire les complètements possibles.

source: B<-W> I<wordlist>
fr: B<-W> I<liste_de_mots>

source: The I<wordlist> is split using the characters in the E<.SM> B<IFS> special variable as delimiters, and each resultant word is expanded. The possible completions are the members of the resultant list which match the word being completed.
fr: La I<liste_de_mots> est découpée en utilisant les caractères de la variable spéciale E<.SM B<IFS>> comme délimiteurs et chaque mot résultant est développé. Les complètements possibles sont les éléments de la liste résultante qui correspondent au mot en cours de complètement.

source: B<-C> I<command>
fr: B<-C> I<commande>

source: I<command> is executed in a subshell environment, and its output is used as the possible completions.
fr: La I<commande> est exécutée dans un environnement de sous-interpréteur et sa sortie est utilisée comme complètements possibles.

source: B<-F> I<function>
fr: B<-F> I<fonction>

source: The shell function I<function> is executed in the current shell environment. When it finishes, the possible completions are retrieved from the value of the E<.SM> B<COMPREPLY> array variable.
fr: La I<fonction> de l'interpréteur est exécutée dans l'interpréteur courant. Lorsqu'elle finit, les complètements possibles sont récupérés à partir de la valeur de la variable de type tableau E<.SM B<COMPREPLY>.>

source: B<-X> I<filterpat>
fr: B<-X> I<motif_filtre>

source: I<filterpat> is a pattern as used for filename expansion. It is applied to the list of possible completions generated by the preceding options and arguments, and each completion matching I<filterpat> is removed from the list. A leading B<!> in I<filterpat> negates the pattern; in this case, any completion not matching I<filterpat> is removed.
fr: I<motif_filtre> est un motif utilisé pour le développement des noms de fichiers. Il est appliqué à la liste des complètements possibles produite par les options et arguments précédents et chaque complètement correspondant à I<motif_filtre> est supprimé de la liste. Un B<!> au début du I<motif_filtre> inverse le motif ; dans ce cas, tout complètement qui ne correspond pas à I<motif_filtre> est supprimé.

source: I<prefix> is added at the beginning of each possible completion after all other options have been applied.
fr: I<prefix> est ajouté au début de chaque complètement possible après que toutes les autres options ont été appliquées.
