Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: If the first form is used, the return value is 0 unless an invalid option is encountered or I<first> or I<last> specify history lines out of range. If the B<-e> option is supplied, the return value is the value of the last command executed or failure if an error occurs with the temporary file of commands. If the second form is used, the return status is that of the command re-executed, unless I<cmd> does not specify a valid history line, in which case B<fc> returns failure.
fr: Lorsque la première forme est utilisée, la valeur renvoyée est 0, sauf si une option incorrecte est trouvée ou si I<première> ou I<dernière> indiquent des lignes d'historique hors d'atteinte. Si l'option B<-e> est fournie, la valeur renvoyée est celle de la dernière commande exécutée ou un échec si une erreur s'est produite avec le fichier temporaire des commandes. Avec la seconde forme, l'état renvoyé est celui de la commande ré-exécutée, à moins que I<commande> ne spécifie pas une ligne correcte de l'historique, auquel cas B<fc> renvoie un échec.

source: B<fg> [I<jobspec>]
fr: B<fg> [I<tâche>]

source: Resume I<jobspec> in the foreground, and make it the current job. If I<jobspec> is not present, the shell's notion of the I<current job> is used. The return value is that of the command placed into the foreground, or failure if run when job control is disabled or, when run with job control enabled, if I<jobspec> does not specify a valid job or I<jobspec> specifies a job that was started without job control.
fr: Reprendre la I<tâche> au premier plan et en faire la tâche courante. Si aucune I<tâche> n'est précisée, l'interpréteur utilise la notion de I<tâche courante>. La valeur renvoyée est celle de la commande placée au premier plan ou un échec si le contrôle des tâches est désactivé ou lorsque le contrôle des tâches est activé, si I<tâche> ne spécifie pas une tâche correcte ou si I<tâche> spécifie une tâche qui a été lancée sans contrôle des tâches.

source: B<getopts> I<optstring> I<name> [I<args>]
fr: B<getopts> I<chaîne_d_options> I<nom> [I<arguments>]

source: B<getopts> is used by shell procedures to parse positional parameters. I<optstring> contains the option characters to be recognized; if a character is followed by a colon, the option is expected to have an argument, which should be separated from it by white space. The colon and question mark characters may not be used as option characters. Each time it is invoked, B<getopts> places the next option in the shell variable I<name>, initializing I<name> if it does not exist, and the index of the next argument to be processed into the variable E<.SM> B<OPTIND>. E<.SM> B<OPTIND> is initialized to 1 each time the shell or a shell script is invoked. When an option requires an argument, B<getopts> places that argument into the variable E<.SM> B<OPTARG>. The shell does not reset E<.SM> B<OPTIND> automatically; it must be manually reset between multiple calls to B<getopts> within the same shell invocation if a new set of parameters is to be used.
fr: B<getopts> est utilisé par les scripts d'interpréteur pour analyser les paramètres positionnels. La I<chaîne_d_options> contient l'ensemble des caractères d'options à reconnaître ; si un caractère est suivi par deux-points (:), l'option est censée comprendre un argument, qui devrait en être séparé par une espace. Les caractères deux-points et le point d'interrogation ne peuvent pas être utilisés comme caractères d'option. À chaque appel, B<getopts> place l'option suivante dans la variable de l'interpréteur dont le I<nom> est fourni, en la créant si elle n'existe pas et l'indice de l'argument suivant à traiter dans la variable E<.SM B<OPTIND>.> E<.SM B<OPTIND>> est initialisée à 1 à chaque appel d'un interpréteur ou d'un script. Quand une option nécessite un argument, B<getopts> place cet argument dans la variable E<.SM B<OPTARG>.> L'interpréteur ne réinitialise pas E<.SM B<OPTIND>> automatiquement ; il faut le faire manuellement entre des appels multiples à B<getopts> au sein du même appel d'interpréteur si un nouveau jeu de paramètres doit être utilisé.

source: When the end of options is encountered, B<getopts> exits with a return value greater than zero. B<OPTIND> is set to the index of the first non-option argument, and B<name> is set to ?.
fr: Lorsque la fin des options est atteinte, B<getopts> termine avec une valeur renvoyée strictement supérieure à zéro. B<OPTIND> est mis à l'indice du premier argument non-option et B<nom> est mis à ?.

source: B<getopts> normally parses the positional parameters, but if more arguments are given in I<args>, B<getopts> parses those instead.
fr: B<getopts> analyse en principe les paramètres positionnels, mais si plus d'I<arguments> sont indiqués, B<getopts> analysera ces derniers à la place.

source: B<getopts> can report errors in two ways. If the first character of I<optstring> is a colon, I<silent> error reporting is used. In normal operation diagnostic messages are printed when invalid options or missing option arguments are encountered. If the variable E<.SM> B<OPTERR> is set to 0, no error messages will be displayed, even if the first character of I<optstring> is not a colon.
fr: B<getopts> peut signaler des erreurs de deux façons. Si le premier caractère de la I<chaîne_d_options> est un deux-points, les erreurs sont signalées de façon I<silencieuse>. Lors d'un fonctionnement normal, des messages de diagnostic sont affichés si une option est incorrecte ou s'il manque un argument d'option. Si la variable E<.SM B<OPTERR>> est mise à 0, aucun message d'erreur ne sera affiché, même si le premier caractère de la I<chaîne_d_options> n'est pas un deux-points.

source: If an invalid option is seen, B<getopts> places ? into I<name> and, if not silent, prints an error message and unsets E<.SM> B<OPTARG>. If B<getopts> is silent, the option character found is placed in E<.SM> B<OPTARG> and no diagnostic message is printed.
fr: Si une option incorrecte est rencontrée, B<getopts> met un point d'interrogation ? dans la variable I<nom>, affiche un message d'erreur (s'il n'est pas en mode silencieux) et détruit la variable E<.SM B<OPTARG>.> Si B<getopts> fonctionne en mode silencieux, le caractère d'option est placé dans E<.SM B<OPTARG>> et aucun message de diagnostic n'est affiché.

source: If a required argument is not found, and B<getopts> is not silent, a question mark (\^B<?>\^) is placed in I<name>, E<.SM> B<OPTARG> is unset, and a diagnostic message is printed. If B<getopts> is silent, then a colon (\^B<:>\^) is placed in I<name> and E<.SM> B<OPTARG> is set to the option character found.
fr: Lorsqu'un argument d'option nécessaire est absent et si B<getopts> n'est pas silencieux, un point d'interrogation (\^B<?>\^) est placé dans la variable I<nom>, E<.SM B<OPTARG>> est détruite et un message de diagnostic est affiché. Si B<getopts> est silencieux, un deux-points (\^B<:>\^) est placé dans la variable I<nom> et E<.SM B<OPTARG>> est mis à l'option monocaractère trouvée.

source: B<getopts> returns true if an option, specified or unspecified, is found. It returns false if the end of options is encountered or an error occurs.
fr: B<getopts> renvoie vrai si une option, spécifiée ou non, est trouvée. Il renvoie faux si la fin des options est atteinte ou si une erreur se produit.

source: B<hash> [B<-lr>] [B<-p> I<filename>] [B<-dt>] [I<name>]
fr: B<hash> [B<-lr>] [B<-p> I<fichier>] [B<-dt>] [I<nom>]

source: For each I<name>, the full file name of the command is determined by searching the directories in B<$PATH> and remembered. If the B<-p> option is supplied, no path search is performed, and I<filename> is used as the full file name of the command. The B<-r> option causes the shell to forget all remembered locations. The B<-d> option causes the shell to forget the remembered location of each I<name>. If the B<-t> option is supplied, the full pathname to which each I<name> corresponds is printed. If multiple I<name> arguments are supplied with B<-t>, the I<name> is printed before the hashed full pathname. The B<-l> option causes output to be displayed in a format that may be reused as input. If no arguments are given, or if only B<-l> is supplied, information about remembered commands is printed. The return status is true unless a I<name> is not found or an invalid option is supplied.
fr: Pour chaque I<nom> fourni, le chemin d'accès complet de la commande est déterminé, en examinant les répertoires de B<$PATH> et mémorisé. Si l'option B<-p> est fournie, aucune recherche de chemin d'accès n'est effectuée et le I<fichier> est utilisé comme chemin d'accès complet pour la commande. L'option B<-r> conduit l'interpréteur à oublier tous les emplacements mémorisés. L'option B<-d> conduit l'interpréteur à oublier tous les emplacements mémorisés de chaque I<nom>. Si l'option B<-t> est fournie, le chemin d'accès complet de chaque I<nom> correspondant est affiché. Si plusieurs arguments I<nom> sont fournis avec B<-t>, le I<nom> est affiché avant chaque chemin d'accès complet haché. L'option B<-l> conduit à afficher la sortie dans un format réutilisable en entrée. Si aucun argument n'est indiqué ou si seulement B<-l> est fournie, des informations sur les commandes mémorisées sont affichées. La valeur renvoyée est vrai, sauf si I<nom> n'est pas trouvé ou si une option incorrecte est fournie.

source: B<help> [B<-s>] [I<pattern>]
fr: B<help> [B<-s>] [I<motif>]

source: Display helpful information about builtin commands. If I<pattern> is specified, B<help> gives detailed help on all commands matching I<pattern>; otherwise help for all the builtins and shell control structures is printed. The B<-s> option restricts the information displayed to a short usage synopsis. The return status is 0 unless no command matches I<pattern>.
fr: Affiche des informations d'aide au sujet des commandes internes. Si un I<motif> est indiqué, B<help> fournit de l'aide sur toutes les commandes internescorrespondant à ce I<motif>, sinon, une liste des commandes internes et des structures de contrôle de l'interpréteur est affichée. L'option B<-s> restreint l'affichage de l'information à un court synopsis d'utilisation. L'état renvoyé est 0, sauf si aucune commande ne peut correspondre au I<motif>.

source: B<history -d> I<offset>
fr: B<history -d> I<nombre>

source: B<history> B<-anrw> [I<filename>]
fr: B<history> B<-anrw> [I<fichier>]

source: B<history> B<-p> I<arg> [I<arg ...>]
fr: B<history> B<-p> I<argument> [I<argument ...>]

source: B<history> B<-s> I<arg> [I<arg ...>]
fr: B<history> B<-s> I<argument> [I<argument ...>]

source: With no options, display the command history list with line numbers. Lines listed with a B<*> have been modified. An argument of I<n> lists only the last I<n> lines. If the shell variable B<HISTTIMEFORMAT> is set and not null, it is used as a format string for I<strftime>(3) to display the time stamp associated with each displayed history entry. No intervening blank is printed between the formatted time stamp and the history line. If I<filename> is supplied, it is used as the name of the history file; if not, the value of E<.SM> B<HISTFILE> is used. Options, if supplied, have the following meanings:
fr: Sans options, affiche la liste des commandes de la file d'historique, avec les numéros de ligne. Les lignes marquées avec un B<*> ont été modifiées. Un argument I<n> permet de n'afficher que les I<n> dernières lignes. Si la variable de l'interpréteur B<HISTTIMEFORMAT> existe et n'est pas vide, elle est utilisée comme une chaîne de format pour I<strftime>(3) afin d'afficher l'horodatage associé à chaque élément de l'historique affiché. Aucun blanc intercalaire n'est affiché entre l'horodatage ainsi mis en forme et la ligne de l'historique. Si un argument I<fichier> est fourni, il est utilisé comme nom de fichier d'historique ; sinon la valeur de E<.SM B<HISTFILE>> est utilisée. Les options, si fournies, ont les significations suivantes :

source: Clear the history list by deleting all the entries.
fr: Effacer la file de l'historique en supprimant tous les éléments.

source: B<-d> I<offset>
fr: B<-d> I<nombre>

source: Delete the history entry at position I<offset>.
fr: Détruire l'élément de l'historique à la position I<nombre>.

source: Append the ``new'' history lines (history lines entered since the beginning of the current B<bash> session) to the history file.
fr: Ajouter les « nouvelles » lignes d'historiques (celles créées depuis le début de la session courante de B<bash>) dans le fichier d'historique.

source: Read the history lines not already read from the history file into the current history list. These are lines appended to the history file since the beginning of the current B<bash> session.
fr: Lire dans le fichier d'historique les lignes non encore lues et les ajouter à la file d'historique courante. Il s'agit des lignes qui ont été ajoutées dans le fichier d'historique depuis le début de la session B<bash>.

source: Read the contents of the history file and use them as the current history.
fr: Lire le contenu du fichier et l'utiliser comme historique courant.

source: Write the current history to the history file, overwriting the history file's contents.
fr: Écrire dans le fichier l'historique actuel, en écrasant le contenu précédent.

source: Perform history substitution on the following I<args> and display the result on the standard output. Does not store the results in the history list. Each I<arg> must be quoted to disable normal history expansion.
fr: Effectuer la substitution sur les I<argument>s suivants et afficher le résultat sur la sortie standard. Ne pas mémoriser les résultats dans la file d'historique. Chaque I<argument> doit être protégé pour désactiver le développement normal de l'historique.

source: Store the I<args> in the history list as a single entry. The last command in the history list is removed before the I<args> are added.
fr: Conserver les I<argument>s dans la file d'historique comme un unique élément. La dernière commande de la file d'historique est supprimée avant que les I<argument>s soient ajoutés.

source: If the B<HISTTIMEFORMAT> is set, the time stamp information associated with each history entry is written to the history file. The return value is 0 unless an invalid option is encountered, an error occurs while reading or writing the history file, an invalid I<offset> is supplied as an argument to B<-d>, or the history expansion supplied as an argument to B<-p> fails.
fr: Si la variable B<HISTTIMEFORMAT> existe, l'information d'horodatage associée à chaque élément de l'historique est écrite dans le fichier d'historique. La valeur renvoyée est 0, sauf si une option incorrecte est fournie ou si une erreur se produit durant la lecture ou l'écriture du fichier, si un I<nombre> incorrect est fourni comme argument à B<-d> ou si le développement de l'historique fourni en argument à B<-p> échoue.

source: B<jobs> [B<-lnprs>] [ I<jobspec> ... ]
fr: B<jobs> [B<-lnprs>] [ I<tâche> ... ]

source: B<jobs> B<-x> I<command> [ I<args> ... ]
fr: B<jobs> B<-x> I<commande> [ I<arguments> ... ]

source: The first form lists the active jobs. The options have the following meanings:
fr: La première forme affiche la liste des tâches actives. Les options ont les significations suivantes :

source: List process IDs in addition to the normal information.
fr: Affiche les PID, en plus des informations normales.

source: List only the process ID of the job's process group leader.
fr: N'affiche que le PID du meneur du groupe de processus de la tâche.

source: Display information only about jobs that have changed status since the user was last notified of their status.
fr: N'affiche de l'information que sur les tâches dont l'état a changé depuis la dernière notification de leur état à l'utilisateur.

source: Restrict output to running jobs.
fr: Restreint l'affichage aux tâches en cours d'exécution.

source: Restrict output to stopped jobs.
fr: Restreint l'affichage aux tâches suspendues.

source: If I<jobspec> is given, output is restricted to information about that job. The return status is 0 unless an invalid option is encountered or an invalid I<jobspec> is supplied.
fr: Si une I<tâche> est indiquée, l'affichage est restreint aux informations sur cette tâche. L'état renvoyé est 0, à moins qu'une option incorrecte soit rencontrée ou qu'une I<tâche> incorrecte soit fournie.

source: If the B<-x> option is supplied, B<jobs> replaces any I<jobspec> found in I<command> or I<args> with the corresponding process group ID, and executes I<command> passing it I<args>, returning its exit status.
fr: Si l'option B<-x> est fournie, B<jobs> va remplacer toute I<tâche> trouvée dans la I<commande> ou dans ses I<arguments> avec les Process Group ID correspondant, puis il exécutera la I<commande> en lui transmettant les I<arguments> et en renvoyant son état final.

source: B<kill> [B<-s> I<sigspec> | B<-n> I<signum> | B<->I<sigspec>] [I<pid> | I<jobspec>] ...
fr: B<kill> [B<-s> I<signal> | B<-n> I<num-signal> | B<->I<signal>] [I<pid> | I<tâche>] ...

source: B<kill> B<-l> [I<sigspec> | I<exit_status>]
fr: B<kill> B<-l> [I<signal> | I<état_final>]

source: Send the signal named by I<sigspec> or I<signum> to the processes named by I<pid> or I<jobspec>. I<sigspec> is either a case-insensitive signal name such as E<.SM> B<SIGKILL> (with or without the E<.SM> B<SIG> prefix) or a signal number; I<signum> is a signal number. If I<sigspec> is not present, then E<.SM> B<SIGTERM> is assumed. An argument of B<-l> lists the signal names. If any arguments are supplied when B<-l> is given, the names of the signals corresponding to the arguments are listed, and the return status is 0. The I<exit_status> argument to B<-l> is a number specifying either a signal number or the exit status of a process terminated by a signal. B<kill> returns true if at least one signal was successfully sent, or false if an error occurs or an invalid option is encountered.
fr: Envoyer le signal indiqué par I<signal> ou I<num-signal> aux processus spécifiés par I<pid> ou par I<tâche>. I<signal> est soit sous la forme de nom de signal (indifférent à la casse), comme E<.SM B<SIGKILL>> (avec ou sans le préfixe E<.SM B<SIG>>), soit sous forme numérique ; I<num-signal> est un numéro de signal. Si I<signal> est absent, E<.SM B<SIGTERM>> est supposé par défaut. Un argument B<-l> affiche la liste des noms de signaux. S'il y a des arguments de fournis quand B<-l> est indiqué, les noms des signaux correspondant aux arguments sont affichés et l'état renvoyé est 0. L'argument I<état_final> de l'option B<-l> est un nombre spécifiant soit un numéro de signal, soit l'état final d'un processus terminé par un signal. B<kill> renvoie vrai si au moins un signal a été envoyé avec succès ou faux si une erreur s'est produite ou si une option incorrecte a été rencontrée.

source: B<let> I<arg> [I<arg> ...]
fr: B<let> I<argument> [I<argument> ...]

source: Each I<arg> is an arithmetic expression to be evaluated (see E<.SM> B<ARITHMETIC EVALUATION>). If the last I<arg> evaluates to 0, B<let> returns 1; 0 is returned otherwise.
fr: Chaque I<argument> est une expression arithmétique à évaluer (voir E<.SM B<ÉVALUATION ARITHMÉTIQUE>>). Si l'évaluation du dernier I<argument> donne 0, B<let> renvoie 1 ; sinon 0 est renvoyé.

source: B<local> [I<option>] [I<name>[=I<value>] ...]
fr: B<local> [I<option>] [I<nom>[=I<valeur>] ...]

source: For each argument, a local variable named I<name> is created, and assigned I<value>. The I<option> can be any of the options accepted by B<declare>. When B<local> is used within a function, it causes the variable I<name> to have a visible scope restricted to that function and its children. With no operands, B<local> writes a list of local variables to the standard output. It is an error to use B<local> when not within a function. The return status is 0 unless B<local> is used outside a function, an invalid I<name> is supplied, or I<name> is a readonly variable.
fr: Pour chaque argument, une variable locale nommée I<nom> est créée et la I<valeur> lui est affectée. L'I<option> peut être toute option acceptée par B<declare>. Quand B<local> est utilisé dans une fonction, il conduit la variable I<nom> à n'avoir une portée visible que restreinte à cette fonction et ses enfants. Sans opérandes, B<local> affiche la liste des variables locales sur la sortie standard. Une utilisation de B<local> en dehors des fonctions est erronée. La valeur renvoyée est 0, sauf si B<local> est appelé en dehors d'une fonction, si un I<nom> incorrect est fourni ou si I<nom> est une variable en lecture seule.

source: Exit a login shell.
fr: Termine un interpréteur de connexion.

source: Removes entries from the directory stack. With no arguments, removes the top directory from the stack, and performs a B<cd> to the new top directory. Arguments, if supplied, have the following meanings:
fr: Enlève des éléments de la pile des répertoires. Sans arguments, seul le répertoire du sommet de la pile est éliminé et un B<cd> est effectué en direction du nouveau répertoire au sommet. Les argument, si fournis, ont les significations suivantes :

source: Removes the I<n>th entry counting from the left of the list shown by B<dirs>, starting with zero. For example:
fr: Supprime le I<n>-ième élément de la liste affichée par B<dirs>, en comptant depuis la gauche à partir de zéro. Par exemple :

source: removes the first directory,
fr: enlève le premier répertoire,

source: the second.
fr: le second.

source: Removes the I<n>th entry counting from the right of the list shown by B<dirs>, starting with zero. For example:
fr: Supprime le I<n>-ième élément de la liste affichée par B<dirs>, en comptant depuis la droite à partir de zéro. Par exemple :

source: removes the last directory,
fr: supprimer le dernier répertoire et

source: the next to last.
fr: l'avant-dernier.

source: Suppresses the normal change of directory when removing directories from the stack, so that only the stack is manipulated.
fr: Empêche le changement normal de répertoire lors de la suppression d'un répertoire de la pile. On ne fait que manipuler la pile.

source: If the B<popd> command is successful, a B<dirs> is performed as well, and the return status is 0. B<popd> returns false if an invalid option is encountered, the directory stack is empty, a non-existent directory stack entry is specified, or the directory change fails.
fr: Si la commande B<popd> réussit, un B<dirs> est effectué et l'état renvoyé est 0. B<popd> renvoie faux si une option incorrecte est trouvée, si la pile de répertoires est vide, si on a indiqué un répertoire absent de la pile ou si le changement de répertoire a échoué.
