Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: B<Display Error if Null or Unset>. If I<parameter> is null or unset, the expansion of I<word> (or a message to that effect if I<word> is not present) is written to the standard error and the shell, if it is not interactive, exits. Otherwise, the value of I<parameter> is substituted.
fr: B<Affichage d'erreur si vide ou inexistant>. Si le I<paramètre> est inexistant ou vide, le développement du I<mot> (ou un message approprié si aucun I<mot> n'est fourni) est affiché sur la sortie d'erreur standard et l'interpréteur termine, s'il n'est pas interactif. Sinon, la valeur du I<paramètre> est substituée.

source: ${I<parameter>B<:+>I<word>}
fr: ${I<paramètre>B<:+>I<mot>}

source: B<Use Alternate Value>. If I<parameter> is null or unset, nothing is substituted, otherwise the expansion of I<word> is substituted.
fr: B<Utilisation d'une valeur différente>. Si le I<paramètre> est vide ou inexistant, rien n'est substitué. Sinon le développement du I<mot> est substitué.

source: ${I<parameter>B<:>I<offset>}
fr: ${I<paramètre>B<:>I<début>}

source: ${I<parameter>B<:>I<offset>B<:>I<length>}
fr: ${I<paramètre>B<:>I<début>B<:>I<longueur>}

source: B<Substring Expansion.> Expands to up to I<length> characters of I<parameter> starting at the character specified by I<offset>. If I<length> is omitted, expands to the substring of I<parameter> starting at the character specified by I<offset>. I<length> and I<offset> are arithmetic expressions (see E<.SM> B<ARITHMETIC EVALUATION> below). I<length> must evaluate to a number greater than or equal to zero. If I<offset> evaluates to a number less than zero, the value is used as an offset from the end of the value of I<parameter>. Arithmetic expressions starting with a - must be separated by whitespace from the preceding : to be distinguished from the B<Use Default Values> expansion. If I<parameter> is B<@>, the result is I<length> positional parameters beginning at I<offset>. If I<parameter> is an array name indexed by @ or *, the result is the I<length> members of the array beginning with ${I<parameter>[I<offset>]}. A negative I<offset> is taken relative to one greater than the maximum index of the specified array. Note that a negative offset must be separated from the colon by at least one space to avoid being confused with the :- expansion. Substring indexing is zero-based unless the positional parameters are used, in which case the indexing starts at 1.
fr: B<Extraction de sous-chaînes.> Se développe pour fournir la sous-chaîne de la I<longueur> indiquée (comptée en caractères) commençant au I<début>. Si la I<longueur> est omise, fournit la sous-chaîne commençant au caractère de I<début> et s'étendant jusqu'à la fin du I<paramètre>. La I<longueur> et le I<début> sont des expressions arithmétiques (voir E<.SM B<ÉVALUATION ARITHMÉTIQUE>> plus bas). La I<longueur> doit être positive. Si le I<début> est négatif, sa valeur est considérée à partir de la fin du contenu du I<paramètre>. Les expressions arithmétiques commençant par un - doivent être séparées par une espace des : (deux-points) les précédant pour être distinguées du développement B<Utilisation de valeurs par défaut>. Si le I<paramètre> est B<@>, le résultat correspond aux I<longueur> paramètres positionnels commençant au I<début>. Si le I<paramètre> est un nom de tableau indicé par @ ou *, le résultat est les I<longueur> éléments du tableau commençant à ${I<paramètre>[I<début>]}. Une valeur négative de I<début> est prise relativement à la valeur maximum de l'indice du tableau considéré, augmentée de un. Remarquez qu'une valeur négative de I<début> doit être séparée du deux-points par au moins une espace pour éviter toute confusion avec le développement de « :- ». L'indexation des sous-chaînes débute à zéro, sauf pour les paramètres positionnels pour lesquels l'indexation commence à 1.

source: ${B<!>I<prefix>B<*>}
fr: ${B<!>I<préfixe>B<*>}

source: ${B<!>I<prefix>B<@>}
fr: ${B<!>I<préfixe>B<@>}

source: Expands to the names of variables whose names begin with I<prefix>, separated by the first character of the E<.SM> B<IFS> special variable.
fr: Se développe en les noms des variables dont les noms commencent par I<préfixe>, séparés par le premier caractère de la variable spéciale E<.SM B<IFS>.>

source: ${B<!>I<name>[I<@>]}
fr: ${B<!>I<nom>[I<@>]}

source: ${B<!>I<name>[I<*>]}
fr: ${B<!>I<nom>[I<*>]}

source: If I<name> is an array variable, expands to the list of array indices (keys) assigned in I<name>. If I<name> is not an array, expands to 0 if I<name> is set and null otherwise. When I<@> is used and the expansion appears within double quotes, each key expands to a separate word.
fr: Si I<nom> est une variable de type tableau, elle se développe en la liste des indices (clefs) du tableau affecté à I<nom>. Si I<nom> n'est pas un tableau, se développe en 0 si I<nom> existe et en vide sinon. Quand I<@> est utilisé et que le développement apparaît entre guillemets doubles, chaque clef se développe en un mot séparé.

source: ${B<#>I<parameter>}
fr: ${B<#>I<paramètre>}

source: The length in characters of the value of I<parameter> is substituted. If I<parameter> is B<*> or B<@>, the value substituted is the number of positional parameters. If I<parameter> is an array name subscripted by B<*> or B<@>, the value substituted is the number of elements in the array.
fr: Est remplacé par la longueur, en caractères, de la valeur du I<paramètre>. Si le I<paramètre> est B<*> ou B<@>, la valeur est le nombre de paramètres positionnels. Si le I<paramètre> est un nom de tableau indicé par B<*> ou B<@>, la valeur donnée est le nombre d'éléments dans le tableau.

source: ${I<parameter>B<#>I<word>}
fr: ${I<paramètre>B<#>I<mot>}

source: ${I<parameter>B<##>I<word>}
fr: ${I<paramètre>B<##>I<mot>}

source: The I<word> is expanded to produce a pattern just as in pathname expansion. If the pattern matches the beginning of the value of I<parameter>, then the result of the expansion is the expanded value of I<parameter> with the shortest matching pattern (the ``B<#>'' case) or the longest matching pattern (the ``B<##>'' case) deleted. If I<parameter> is B<@> or B<*>, the pattern removal operation is applied to each positional parameter in turn, and the expansion is the resultant list. If I<parameter> is an array variable subscripted with B<@> or B<*>, the pattern removal operation is applied to each member of the array in turn, and the expansion is the resultant list.
fr: Le I<mot> est développé pour fournir un motif, comme dans le développement des chemins. Si le motif correspond au début de la valeur du I<paramètre>, alors le développement prend la valeur du I<paramètre> après suppression du plus petit motif commun (cas « B<#> ») ou du plus long motif (cas « B<##> »). Si le I<paramètre> est B<@> ou B<*>, l'opération de suppression de motif est appliquée à chaque paramètre positionnel tour à tour et le développement est la liste résultante. Si le I<paramètre> est une variable tableau indicée par B<@> ou B<*>, l'opération de suppression de motif est appliquée à chaque élément du tableau tour à tour et le développement est la liste résultante.

source: ${I<parameter>B<%>I<word>}
fr: ${I<paramètre>B<%>I<mot>}

source: ${I<parameter>B<%%>I<word>}
fr: ${I<paramètre>B<%%>I<mot>}

source: The I<word> is expanded to produce a pattern just as in pathname expansion. If the pattern matches a trailing portion of the expanded value of I<parameter>, then the result of the expansion is the expanded value of I<parameter> with the shortest matching pattern (the ``B<%>'' case) or the longest matching pattern (the ``B<%%>'' case) deleted. If I<parameter> is B<@> or B<*>, the pattern removal operation is applied to each positional parameter in turn, and the expansion is the resultant list. If I<parameter> is an array variable subscripted with B<@> or B<*>, the pattern removal operation is applied to each member of the array in turn, and the expansion is the resultant list.
fr: Le I<mot> est développé pour fournir un motif, comme dans le développement des chemins. Si le motif correspond à une portion finale de la valeur développée du I<paramètre>, alors le développement prend la valeur du I<paramètre> après suppression du plus petit motif commun (cas « B<%> ») ou du plus long motif (cas « B<%%> »). Si le I<paramètre> est B<@> ou B<*>, l'opération de suppression de motif est appliquée à chaque paramètre positionnel tour à tour et le développement est la liste résultante. Si le I<paramètre> est une variable tableau indicée par B<@> ou B<*>, l'opération de suppression de motif est appliquée à chaque élément du tableau tour à tour et le développement est la liste résultante.

source: ${I<parameter>B</>I<pattern>B</>I<string>}
fr: ${I<paramètre>B</>I<motif>B</>I<chaîne>}

source: ${I<parameter>B<//>I<pattern>B</>I<string>}
fr: ${I<paramètre>B<//>I<motif>B</>I<chaîne>}

source: The I<pattern> is expanded to produce a pattern just as in pathname expansion. I<Parameter> is expanded and the longest match of I<pattern> against its value is replaced with I<string>. In the first form, only the first match is replaced. The second form causes all matches of I<pattern> to be replaced with I<string>. If I<pattern> begins with B<#>, it must match at the beginning of the expanded value of I<parameter>. If I<pattern> begins with B<%>, it must match at the end of the expanded value of I<parameter>. If I<string> is null, matches of I<pattern> are deleted and the B</> following I<pattern> may be omitted. If I<parameter> is B<@> or B<*>, the substitution operation is applied to each positional parameter in turn, and the expansion is the resultant list. If I<parameter> is an array variable subscripted with B<@> or B<*>, the substitution operation is applied to each member of the array in turn, and the expansion is the resultant list.
fr: Le I<motif> est développé comme dans le traitement des chemins. Le I<paramètre> est développé et la plus longue portion correspondant au I<motif> est remplacée par la I<chaîne>. Dans la première forme, seule la première correspondance est remplacée. La seconde forme conduit au remplacement par I<chaîne> de toutes les correspondances au I<motif>. Si le I<motif> commence par B<#>, il doit correspondre au début de la valeur développée du I<paramètre>. Si le I<motif> commence par B<%>, il doit correspondre à la fin du développement du I<paramètre>. Si la I<chaîne> est vide, les portions correspondant au I<motif> sont supprimées et le B</> après le I<motif> peut être omis. Si le I<paramètre> est B<@> ou B<*>, l'opération de substitution est appliquée à chacun des paramètres positionnels tour à tour et le développement est la liste résultante. Si le I<paramètre> est une variable tableau indicée par B<@> ou B<*>, l'opération de substitution s'applique à chaque élément du tableau tour à tour et le développement est la liste resultante.

source: Command Substitution
fr: Substitution de commande

source: I<Command substitution> allows the output of a command to replace the command name. There are two forms:
fr: La I<substitution de commande> permet de remplacer le nom d'une commande par son résultat. Il en existe deux formes :

source: B<$(>I<command>\|B<)>
fr: B<$(>I<commande>\|B<)>

source: B<`>I<command>B<`>
fr: B<`>I<commande>B<`>

source: B<Bash> performs the expansion by executing I<command> and replacing the command substitution with the standard output of the command, with any trailing newlines deleted. Embedded newlines are not deleted, but they may be removed during word splitting. The command substitution B<$(cat >I<file>B<)> can be replaced by the equivalent but faster B<$(E<lt> >I<file>B<)>.
fr: B<Bash> effectue la substitution en exécutant la I<commande> et en la remplaçant par sa sortie standard, dont les derniers sauts de lignes sont supprimés. Les sauts de lignes internes ne sont pas supprimés mais peuvent disparaître lors du découpage en mots. La substitution de commande B<$(cat >I<fichier>B<)> peut être remplacée par l'équivalent plus rapide B<$(E<lt> >I<fichier>B<)>.

source: When the old-style backquote form of substitution is used, backslash retains its literal meaning except when followed by B<$>, B<`>, or B<\e>. The first backquote not preceded by a backslash terminates the command substitution. When using the $(\^I<command>\|) form, all characters between the parentheses make up the command; none are treated specially.
fr: Quand l'ancienne forme de substitution avec les accents graves « ` » est utilisée, le caractère contre-oblique garde sa signification propre sauf lorsqu'il est suivi de B<$>, B<`> ou B<\e>. Le premier accent grave non protégé par une contre-oblique termine la substitution de commande. Quand on utilise la forme $(\^I<commande>\|), tous les caractères entre parenthèses constituent la commande ; aucun n'est traité spécifiquement.

source: Command substitutions may be nested. To nest when using the backquoted form, escape the inner backquotes with backslashes.
fr: Les substitutions de commande peuvent être imbriquées. Pour imbriquer en utilisant la forme à accents graves, il faut protéger les accents graves internes avec des contre-obliques.

source: If the substitution appears within double quotes, word splitting and pathname expansion are not performed on the results.
fr: Si la substitution apparaît entre guillemets doubles, le découpage en mots et le développement des chemins ne sont pas effectués sur ses résultats.

source: Arithmetic Expansion
fr: Développement arithmétique

source: Arithmetic expansion allows the evaluation of an arithmetic expression and the substitution of the result. The format for arithmetic expansion is:
fr: Le développement arithmétique permet de remplacer une expression arithmétique par le résultat de son évaluation. Le format du développement arithmétique est :

source: The old format B<$[>I<expression>B<]> is deprecated and will be removed in upcoming versions of bash.
fr: L'ancien format B<$[>I<expression>B<]> est obsolète et sera supprimé dans les prochaines versions de bash.

source: The I<expression> is treated as if it were within double quotes, but a double quote inside the parentheses is not treated specially. All tokens in the expression undergo parameter expansion, string expansion, command substitution, and quote removal. Arithmetic expansions may be nested.
fr: L'I<expression> est traitée comme si elle était entre guillemets doubles, mais un guillemet double à l'intérieur de parenthèses n'est pas traité spécifiquement. Tous les lexèmes dans l'expression sont sujet au développement des paramètres, à la substitution de commande et à la suppression des protections. Les développements arithmétiques peuvent être imbriqués.

source: The evaluation is performed according to the rules listed below under E<.SM> B<ARITHMETIC EVALUATION>. If I<expression> is invalid, B<bash> prints a message indicating failure and no substitution occurs.
fr: L'évaluation est effectuée en suivant les règles décrites plus bas dans E<.SM B<ÉVALUATION ARITHMÉTIQUE>.> Si l'I<expression> est incorrecte, B<bash> affiche un message indiquant l'échec et aucune substitution n'a lieu.

source: Process Substitution
fr: Substitution de processus

source: I<Process substitution> is supported on systems that support named pipes (I<FIFOs>) or the B</dev/fd> method of naming open files. It takes the form of B<E<lt>(>I<list\^>B<)> or B<E<gt>(>I<list\^>B<)>. The process I<list> is run with its input or output connected to a I<FIFO> or some file in B</dev/fd>. The name of this file is passed as an argument to the current command as the result of the expansion. If the B<E<gt>(>I<list\^>B<)> form is used, writing to the file will provide input for I<list>. If the B<E<lt>(>I<list\^>B<)> form is used, the file passed as an argument should be read to obtain the output of I<list>.
fr: La I<substitution de processus> n'est disponible que sur les systèmes acceptant le mécanisme des tubes nommés (I<FIFO>) ou la méthode B</dev/fd> de noms de fichiers. Elle prend la forme B<E<lt>(>I<liste\^>B<)> ou B<E<gt>(>I<liste\^>B<)>. La I<liste> de processus est exécutée avec son entrée ou sa sortie connectée à une I<FIFO> ou à un fichier dans B</dev/fd>. Le nom de ce fichier est passé en argument à la commande qui sera exécutée comme résultat de cette substitution. Si on utilise la forme B<E<gt>(>I<liste\^>B<)>, l'écriture dans le fichier fournira des entrées pour la I<liste>. Si la forme B<E<lt>(>I<liste\^>B<)> est utilisée, le fichier passe en argument devra être lu pour obtenir la sortie de la I<liste>.

source: When available, process substitution is performed simultaneously with parameter and variable expansion, command substitution, and arithmetic expansion.
fr: Sur les systèmes qui le permettent, la substitution de processus est effectuée simultanément au développement des paramètres et variables, à la substitution de commande et au développement arithmétique.

source: Word Splitting
fr: Découpage en mots

source: The shell scans the results of parameter expansion, command substitution, and arithmetic expansion that did not occur within double quotes for I<word splitting>.
fr: Les résultats du développement des paramètres, de la substitution de commande et du développement arithmétique qui ne se trouvent pas entre guillemets doubles sont analysés par l'interpréteur afin d'appliquer le I<découpage en mots>.

source: The shell treats each character of E<.SM> B<IFS> as a delimiter, and splits the results of the other expansions into words on these characters. If E<.SM> B<IFS> is unset, or its value is exactly B<E<lt>spaceE<gt>E<lt>tabE<gt>E<lt>newlineE<gt>>, the default, then any sequence of E<.SM> B<IFS> characters serves to delimit words. If E<.SM> B<IFS> has a value other than the default, then sequences of the whitespace characters B<space> and B<tab> are ignored at the beginning and end of the word, as long as the whitespace character is in the value of E<.SM> B<IFS> (an E<.SM> B<IFS> whitespace character). Any character in E<.SM> B<IFS> that is not E<.SM> B<IFS> whitespace, along with any adjacent E<.SM> B<IFS> whitespace characters, delimits a field. A sequence of E<.SM> B<IFS> whitespace characters is also treated as a delimiter. If the value of E<.SM> B<IFS> is null, no word splitting occurs.
fr: L'interpréteur considère chaque caractère du paramètre E<.SM B<IFS>> comme un délimiteur et découpe le résultat des transformations précédentes en fonction de ceux-ci. Si E<.SM B<IFS>> est inexistante ou si sa valeur est exactement B<E<lt>espaceE<gt>E<lt>tabulationE<gt>E<lt>saut de ligneE<gt>>, la valeur par défaut, alors toute suite de caractères de E<.SM B<IFS>> sert à délimiter les mots. Si E<.SM B<IFS>> a une valeur autre que celle par défaut, alors les suites de caractères blancs B<espace> et B<tabulation> sont ignorées en début et fin de mot, à condition que ces caractères blancs se trouvent dans la valeur de E<.SM B<IFS>> (un caractère blanc de E<.SM B<IFS>>). Tout autre caractère de E<.SM B<IFS>> qui n'est pas un caractère blanc, se trouvant à côté d'un caractère blanc de E<.SM B<IFS>,> délimite un champ. Une suite de caractères blancs de E<.SM B<IFS>> est également traitée comme un délimiteur. Si la valeur de E<.SM B<IFS>> est vide, aucun découpage en mots n'a lieu.

source: Explicit null arguments (\^B<"\^"> or \^B<'\^'>\^) are retained. Unquoted implicit null arguments, resulting from the expansion of parameters that have no values, are removed. If a parameter with no value is expanded within double quotes, a null argument results and is retained.
fr: Les arguments vides explicites (\^B<"\^"> ou \^B<'\^'>\^) sont conservés. Les arguments vides implicites non protégés, résultant du développement des paramètres qui n'ont pas de valeurs, sont supprimés. Si un paramètre sans valeur est développé entre guillemets doubles, le résultat est un argument vide qui est conservé.

source: Note that if no expansion occurs, no splitting is performed.
fr: Remarquez que si aucun développement n'a lieu, le découpage en mots n'est pas effectué.

source: Pathname Expansion
fr: Développement des chemins

source: After word splitting, unless the B<-f> option has been set, B<bash> scans each word for the characters B<*>, B<?>, and B<[>. If one of these characters appears, then the word is regarded as a I<pattern>, and replaced with an alphabetically sorted list of file names matching the pattern. If no matching file names are found, and the shell option B<nullglob> is disabled, the word is left unchanged. If the B<nullglob> option is set, and no matches are found, the word is removed. If the B<failglob> shell option is set, and no matches are found, an error message is printed and the command is not executed. If the shell option B<nocaseglob> is enabled, the match is performed without regard to the case of alphabetic characters. Note that when using range expressions like [a-z] (see below), letters of the other case may be included, depending on the setting of B<LC_COLLATE.> When a pattern is used for pathname expansion, the character B<``.''> at the start of a name or immediately following a slash must be matched explicitly, unless the shell option B<dotglob> is set. When matching a pathname, the slash character must always be matched explicitly. In other cases, the B<``.''> character is not treated specially. See the description of B<shopt> below under E<.SM> B<SHELL BUILTIN COMMANDS> for a description of the B<nocaseglob>, B<nullglob>, B<failglob>, and B<dotglob> shell options.
fr: Après le découpage en mots, à moins que l'option B<-f> soit présente, B<bash> recherche dans chaque mot les caractères B<*>, B<?> et B<[>. Si l'un d'eux apparaît, le mot est considéré comme un I<motif> et remplacé par une liste, classée par ordre alphabétique, des noms de fichiers correspondant à ce motif. Si aucun nom de fichier ne correspond et si l'option d'interpréteur B<nullglob> est désactivée, le mot reste inchangé. Si l'option B<nullglob> existe et si aucune correspondance n'est trouvée, le mot est supprimé. Si l'option d'interpréteur B<failglob> existe et si aucune correspondance n'est trouvée, un message d'erreur est affiché et la commande n'est pas exécutée Si l'option d'interpréteur B<nocaseglob> est activée, la correspondance est effectuée sans tenir compte de la casse des caractères alphabétiques. Remarquez que lorsque des expressions de plage comme [a-z] (voir plus bas) sont utilisées les lettres de l'autre casse peuvent être incluses, selon le paramétrage de B<LC_COLLATE.> Quand un motif est utilisé pour le développement des chemins, le caractère B<« . »> au début d'un nom ou immédiatement à la suite d'une barre oblique doit être explicitement mis en correspondance, à moins que l'option d'interpréteur B<dotglob> n'existe. Lors de la correspondance avec un chemin, le caractère barre oblique doit toujours être mis en correspondance explicitement. Dans les autres cas, le caractère B<« . »> n'est pas traité spécifiquement. Voyez la description de la commande B<shopt> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>> pour une description des options d'interpréteur B<nocaseglob>, B<nullglob>, B<failglob> et B<dotglob>.
