Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: This defines a function named I<name>. The reserved word B<function> is optional. If the B<function> reserved word is supplied, the parentheses are optional. The I<body> of the function is the compound command I<compound-command> (see B<Compound Commands> above). That command is usually a I<list> of commands between { and }, but may be any command listed under B<Compound Commands> above. I<compound-command> is executed whenever I<name> is specified as the name of a simple command. Any redirections (see E<.SM> B<REDIRECTION> below) specified when a function is defined are performed when the function is executed. The exit status of a function definition is zero unless a syntax error occurs or a readonly function with the same name already exists. When executed, the exit status of a function is the exit status of the last command executed in the body. (See E<.SM> B<FUNCTIONS> below.)
fr: Ceci définit une fonction possédant le I<nom> mentionné. Le mot réservé B<function> est facultatif. S'il est fourni, les parenthèses sont facultatives. Le I<corps> de la fonction est la commande composée I<commande-composée> (voir B<Commandes composées> plus haut). Cette commande est généralement une I<liste> de commandes entre { et }, mais peut être toute commande décrite dans B<Commandes composées> plus haut. La I<commande-composée> est exécutée chaque fois que I<nom> est spécifié comme le nom d'une commande normale. Toutes les redirections (voir E<.SM B<REDIRECTION>> plus bas) spécifiées lorsqu'une fonction est définie sont effectuées lorsque la fonction est exécutée. L'état final d'une définition de fonction est zéro à moins qu'une erreur de syntaxe se produise ou qu'une fonction en lecture seule existe déjà avec le même nom. Lorsque la fonction est exécutée, l'état final est celui de la dernière commande exécutée dans le corps de la fonction. (Voir E<.SM B<FONCTIONS>> plus bas.)

source: COMMENTS
fr: COMMENTAIRES

source: In a non-interactive shell, or an interactive shell in which the B<interactive_comments> option to the B<shopt> builtin is enabled (see E<.SM> B<SHELL BUILTIN COMMANDS> below), a word beginning with B<#> causes that word and all remaining characters on that line to be ignored. An interactive shell without the B<interactive_comments> option enabled does not allow comments. The B<interactive_comments> option is on by default in interactive shells.
fr: Dans un interpréteur non interactif ou dans un interpréteur interactif avec l'option B<interactive_comments> activée par la commande interne B<shopt> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>), un mot commençant par B<#> conduira à ignorer ce mot et tous les caractères restants sur la ligne. Un interpréteur interactif sans l'option B<interactive_comments> n'autorise pas les commentaires. L'option B<interactive_comments> est activée par défaut dans les interpréteurs interactifs.

source: QUOTING
fr: PROTECTION

source: I<Quoting> is used to remove the special meaning of certain characters or words to the shell. Quoting can be used to disable special treatment for special characters, to prevent reserved words from being recognized as such, and to prevent parameter expansion.
fr: Les I<protections> (quoting) permettent de forcer l'interpréteur à ignorer la signification spéciale de certains caractères ou mots. Les protections peuvent être utilisées pour désactiver le traitement des caractères spéciaux, éviter la reconnaissance des mots réservés ou empêcher le développement des paramètres.

source: Each of the I<metacharacters> listed above under E<.SM> B<DEFINITIONS> has special meaning to the shell and must be quoted if it is to represent itself.
fr: Tous les I<métacaractères> décrits plus haut dans E<.SM B<DÉFINITIONS>> ont des significations spéciales pour l'interpréteur et doivent être protégés pour ne représenter que leur propre caractère.

source: When the command history expansion facilities are being used (see E<.SM> B<HISTORY EXPANSION> below), the I<history expansion> character, usually B<!>, must be quoted to prevent history expansion.
fr: Lorsque les outils de développement de l'historique des commandes sont utilisés (voir plus bas E<.SM B<DÉVELOPPEMENT DE L'HISTORIQUE>>), le caractère de I<développement de l'historique>, généralement B<!>, doit être protégé pour éviter le développement de l'historique.

source: There are three quoting mechanisms: the I<escape character>, single quotes, and double quotes.
fr: Il y a trois mécanismes de protection : le caractère d'échappement, les guillemets simples (« single quote ») et les guillemets doubles (« double quote »).

source: A non-quoted backslash (B<\e>) is the I<escape character>. It preserves the literal value of the next character that follows, with the exception of E<lt>newlineE<gt>. If a B<\e>E<lt>newlineE<gt> pair appears, and the backslash is not itself quoted, the B<\e>E<lt>newlineE<gt> is treated as a line continuation (that is, it is removed from the input stream and effectively ignored).
fr: Un caractère contre-oblique (B<\e>) non protégé, est le I<caractère d'échappement>. Il préserve la valeur littérale du caractère qui le suit, à l'exception du E<lt>saut de ligneE<gt>. Si un couple B<\e>E<lt>saut de ligneE<gt> apparaît et si la contre-oblique n'est pas elle-même protégée, l'ensemble B<\e>E<lt>saut de ligneE<gt> est considéré comme une continuation de ligne (c'est-à-dire qu'il est supprimé du flot d'entrée et ignoré en pratique).

source: Enclosing characters in single quotes preserves the literal value of each character within the quotes. A single quote may not occur between single quotes, even when preceded by a backslash.
fr: Encadrer des caractères entre des apostrophes préserve la valeur littérale de chacun des caractères entre apostrophes. Une apostrophe ne peut pas être placée entre deux apostrophes, même si elle est précédée d'une contre-oblique.

source: Enclosing characters in double quotes preserves the literal value of all characters within the quotes, with the exception of B<$>, B<`>, B<\e>, and, when history expansion is enabled, B<!>. The characters B<$> and B<`> retain their special meaning within double quotes. The backslash retains its special meaning only when followed by one of the following characters: B<$>, B<`>, \^B<">\^, B<\e>, or B<E<lt>newlineE<gt>>. A double quote may be quoted within double quotes by preceding it with a backslash. If enabled, history expansion will be performed unless an B<!> appearing in double quotes is escaped using a backslash. The backslash preceding the B<!> is not removed.
fr: Encadrer des caractères entre des guillemets doubles préserve la valeur littérale de chacun des caractères sauf B<$>, B<`>, B<\e> et, lorsque le développement de l'historique est activé, B<!>. Les caractères B<$> et B<`> conservent leurs significations spéciales entre guillemets doubles. La contre-oblique ne conserve sa signification spéciale que lorsqu'elle est suivie par l'un des caractères suivants : B<$>, B<`>, \^B<">\^, B<\e> ou B<E<lt>saut de ligneE<gt>>. Un guillemet doubles peut être protégé entre deux guillemets doubles en le faisant précéder d'une contre-oblique. S'il est activé, le développement de l'historique sera effectué à moins qu'un B<!> apparaissant entre guillemets doubles ne soit protégé par une contre-oblique. La contre-oblique précédant le B<!> n'est pas supprimée.

source: The special parameters B<*> and B<@> have special meaning when in double quotes (see E<.SM> B<PARAMETERS> below).
fr: Les caractères spéciaux B<*> et B<@> ont des significations spéciales lorsqu'ils se trouvent entre des guillemets doubles (voir E<.SM B<PARAMÈTRES>> plus bas).

source: Words of the form B<$>'I<string>' are treated specially. The word expands to I<string>, with backslash-escaped characters replaced as specified by the ANSI C standard. Backslash escape sequences, if present, are decoded as follows:
fr: Les mots de la forme B<$>'I<chaîne>' sont traités spécialement. Le mot est développé en I<chaîne> avec les caractères protégés par contre-oblique remplacés comme spécifié par le standard ANSI C. Les suites d'échappement par contre-oblique, si présentes, sont décodées comme suit :

source: alert (bell)
fr: alerte (alarme)

source: backspace
fr: effacement arrière (backspace)

source: an escape character
fr: caractère d'échappement

source: form feed
fr: saut de page (form feed)

source: new line
fr: saut de ligne (new line)

source: carriage return
fr: retour chariot (carriage return)

source: horizontal tab
fr: tabulation horizontale

source: vertical tab
fr: tabulation verticale

source: backslash
fr: contre-oblique

source: single quote
fr: apostrophe

source: the eight-bit character whose value is the octal value I<nnn> (one to three digits)
fr: le caractère 8 bits dont la valeur octale est I<nnn> (de un à trois chiffres)

source: the eight-bit character whose value is the hexadecimal value I<HH> (one or two hex digits)
fr: le caractère 8 bits dont la valeur hexadécimale est I<HH> (un à deux symboles hexadécimaux)

source: a control-I<x> character
fr: un caractère contrôle-I<x>

source: The expanded result is single-quoted, as if the dollar sign had not been present.
fr: Le résultat développé est protégé par des apostrophes comme si le symbole dollar n'avait pas été présent.

source: A double-quoted string preceded by a dollar sign (B<$>) will cause the string to be translated according to the current locale. If the current locale is B<C> or B<POSIX>, the dollar sign is ignored. If the string is translated and replaced, the replacement is double-quoted.
fr: Une chaîne entre guillemets doubles précédée d'un symbole dollar (B<$>) conduira à la traduction de la chaîne selon le paramètre linguistique régional en vigueur. Si le paramètre linguistique régional courant est B<C> ou B<POSIX>, le symbole dollar est ignoré. Si la chaîne est traduite et remplacée, le résultat est protégé par des guillemets doubles.

source: PARAMETERS
fr: PARAMÈTRES

source: A I<parameter> is an entity that stores values. It can be a I<name>, a number, or one of the special characters listed below under B<Special Parameters>. A I<variable> is a parameter denoted by a I<name>. A variable has a I<value> and zero or more I<attributes>. Attributes are assigned using the B<declare> builtin command (see B<declare> below in E<.SM> B<SHELL BUILTIN COMMANDS>).
fr: Un I<paramètre> est une entité permettant de stocker des valeurs. Il peut être un I<nom>, un nombre ou un des caractères spéciaux décrits plus bas, dans B<Paramètres spéciaux>. Une I<variable> est un paramètre noté par un I<nom>. Une variable possède une I<valeur> et zéro ou plusieurs I<attributs>. Les attributs sont affectés en utilisant la commande interne B<declare> (voir B<declare> plus bas dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: A parameter is set if it has been assigned a value. The null string is a valid value. Once a variable is set, it may be unset only by using the B<unset> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: Un paramètre est créé si une valeur lui a été affectée. La chaîne vide est une valeur correcte. Une fois qu'une variable est créée, elle ne peut être détruite qu'en utilisant la commande interne B<unset> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: A I<variable> may be assigned to by a statement of the form
fr: Une I<variable> peut recevoir une valeur par une affectation de la forme

source: I<name>=[I<value>]
fr: I<nom>=[I<valeur>]

source: If I<value> is not given, the variable is assigned the null string. All I<values> undergo tilde expansion, parameter and variable expansion, command substitution, arithmetic expansion, and quote removal (see E<.SM> B<EXPANSION> below). If the variable has its B<integer> attribute set, then I<value> is evaluated as an arithmetic expression even if the $((...)) expansion is not used (see B<Arithmetic Expansion> below). Word splitting is not performed, with the exception of B<"$@"> as explained below under B<Special Parameters>. Pathname expansion is not performed. Assignment statements may also appear as arguments to the B<alias>, B<declare>, B<typeset>, B<export>, B<readonly>, and B<local> builtin commands.
fr: Si aucune I<valeur> n'est indiquée, une chaîne vide est affectée à la variable. Toutes les I<valeurs> sont sujettes au développement du tilde, des paramètres et des variables, à la substitution de commande, au développement arithmétique et à la suppression des protections (voir E<.SM B<DÉVELOPPEMENTS>> plus bas). Si une variable a son attribut B<integer> de mis, alors la I<valeur> est soumise à l'évaluation arithmétique, même si la syntaxe $((...)) n'est pas utilisée (voir B<Développement arithmétique> plus bas). Le découpage en mots n'est pas effectué, à l'exception de B<"$@"> comme expliqué plus bas dans B<Paramètres spéciaux>. Le développement des chemins n'est pas effectué. Les affectations peuvent également apparaître comme argument des commandes internes suivantes : B<alias>, B<declare>, B<typeset>, B<export>, B<readonly> et B<local>.

source: In the context where an assignment statement is assigning a value to a shell variable or array index, the += operator can be used to append to or add to the variable's previous value. When += is applied to a variable for which the integer attribute has been set, I<value> is evaluated as an arithmetic expression and added to the variable's current value, which is also evaluated. When += is applied to an array variable using compound assignment (see B<Arrays> below), the variable's value is not unset (as it is when using =), and new values are appended to the array beginning at one greater than the array's maximum index. When applied to a string-valued variable, I<value> is expanded and appended to the variable's value.
fr: Dans le contexte où une affectation affecte une valeur à une variable de l'interpréteur ou à un indice de tableau, l'opérateur += peut être utilisé pour ajouter ou additionner à la précédente valeur de la variable. Lorsque l'opérateur += est appliqué à une variable dont l'attribut integer (entier) a été mis, la I<valeur> est évaluée comme une expression arithmétique et additionnée à la valeur actuelle de la variable qui est également évaluée. Lorsque += est appliqué à une variable tableau en utilisant l'affectation composée (voir B<Tableaux> plus bas), la valeur de la variable n'est pas détruite (comme elle l'est lorsqu'on utilise =) et les nouvelles valeurs sont ajoutées au tableau, en commençant à l'indice maximum du tableau plus un. Lorsque l'opérateur est appliqué à une variable de type chaîne, la I<valeur> est développée et concaténée à la valeur de la variable.

source: Positional Parameters
fr: Paramètres positionnels

source: A I<positional parameter> is a parameter denoted by one or more digits, other than the single digit 0. Positional parameters are assigned from the shell's arguments when it is invoked, and may be reassigned using the B<set> builtin command. Positional parameters may not be assigned to with assignment statements. The positional parameters are temporarily replaced when a shell function is executed (see E<.SM> B<FUNCTIONS> below).
fr: Un I<paramètre positionnel> est un paramètre noté par un ou plusieurs chiffres (à l'exception du chiffre 0 seul). Les paramètres positionnels sont affectés avec les arguments de l'interpréteur lors de son appel. Ils peuvent être réaffectés avec la commande interne B<set>. On ne peut pas utiliser les affectations pour les paramètres positionnels. Ils sont temporairement remplacés lors de l'exécution d'une fonction de l'interpréteur (voir E<.SM B<FONCTIONS>> plus bas).

source: When a positional parameter consisting of more than a single digit is expanded, it must be enclosed in braces (see E<.SM> B<EXPANSION> below).
fr: Un paramètre positionnel constitué de plusieurs chiffres doit être encadré par des accolades lors de son développement (voir E<.SM B<DÉVELOPPEMENTS>> plus bas).

source: Special Parameters
fr: Paramètres spéciaux

source: The shell treats several parameters specially. These parameters may only be referenced; assignment to them is not allowed.
fr: L'interpréteur traite plusieurs paramètres spécifiquement. Ces paramètres peuvent uniquement être consultés, il n'est pas permis de leur affecter une valeur.

source: Expands to the positional parameters, starting from one. When the expansion occurs within double quotes, it expands to a single word with the value of each parameter separated by the first character of the E<.SM> B<IFS> special variable. That is, "B<$*>" is equivalent to "B<$1>I<c>B<$2>I<c>B<...>", where I<c> is the first character of the value of the E<.SM> B<IFS> variable. If E<.SM> B<IFS> is unset, the parameters are separated by spaces. If E<.SM> B<IFS> is null, the parameters are joined without intervening separators.
fr: Se développe en l'ensemble des paramètres positionnels, commençant par le premier. Quand le développement se produit entre des guillemets doubles, B<*> se transforme en un seul mot constitué de la valeur de tous les paramètres positionnels séparés par le premier caractère de la variable spéciale E<.SM B<IFS>.> C'est-à-dire que "B<$*>" est équivalent à "B<$1>I<c>B<$2>I<c>B<...>", où I<c> est le premier caractère de la valeur de la variable E<.SM B<IFS>.> Si E<.SM B<IFS>> est inexistante, les paramètres sont séparés par des espaces. Si E<.SM B<IFS>> est vide, les paramètres sont accolés sans séparateurs.

source: Expands to the positional parameters, starting from one. When the expansion occurs within double quotes, each parameter expands to a separate word. That is, "B<$@>" is equivalent to "B<$1>" "B<$2>" ... If the double-quoted expansion occurs within a word, the expansion of the first parameter is joined with the beginning part of the original word, and the expansion of the last parameter is joined with the last part of the original word. When there are no positional parameters, "B<$@>" and B<$@> expand to nothing (i.e., they are removed).
fr: Se développe en l'ensemble des paramètres positionnels, commençant par le premier. Quand le développement a lieu entre guillemets doubles, chaque paramètre se développe en un mot distinct. C'est-à-dire que "B<$@>" est équivalent à "B<$1>" "B<$2>" .... Si le développement des guillemets doubles survient dans un mot, le développement du premier paramètre est accolé à la première partie du mot d'origine et le développement du dernier paramètre est accolé à la dernière partie du mot d'origine. Quand il n'y a pas de paramètres positionnels, "B<$@>" et B<$@> ne se développent en rien (c'est-à-dire qu'ils sont simplement éliminés).

source: Expands to the number of positional parameters in decimal.
fr: Correspond au nombre de paramètres positionnels, en base décimale.

source: Expands to the status of the most recently executed foreground pipeline.
fr: Se développe en l'état de la dernière conduite exécutée au premier plan.

source: Expands to the current option flags as specified upon invocation, by the B<set> builtin command, or those set by the shell itself (such as the B<-i> option).
fr: Est remplacé par la liste des options de l'interpréteur indiquées durant l'appel, configurées avec la commande interne B<set> ou celles créées par l'interpréteur lui-même (comme avec l'option B<-i>).

source: Expands to the process ID of the shell. In a () subshell, it expands to the process ID of the current shell, not the subshell.
fr: Se transforme en PID de l'interpréteur. Dans un sous-interpréteur (), il se transforme en PID de l'interpréteur et non pas du sous-interpréteur.

source: Expands to the process ID of the most recently executed background (asynchronous) command.
fr: Se transforme en PID de la commande (asynchrone) exécutée en arrière-plan le plus récemment.

source: Expands to the name of the shell or shell script. This is set at shell initialization. If B<bash> is invoked with a file of commands, B<$0> is set to the name of that file. If B<bash> is started with the B<-c> option, then B<$0> is set to the first argument after the string to be executed, if one is present. Otherwise, it is set to the file name used to invoke B<bash>, as given by argument zero.
fr: Se développe en le nom de l'interpréteur ou du script. Ce paramètre est créé lors de l'initialisation de l'interpréteur. Si B<bash> est appelé avec un fichier de commandes, B<$0> correspond au nom de ce fichier. Si B<bash> est lancé avec l'option B<-c>, alors B<$0> contient le premier argument, s'il y en a un, après la chaîne de commandes à exécuter. Sinon, ce paramètre contient le nom de fichier utilisé pour appeler B<bash>, comme indiqué par l'argument zéro.

source: At shell startup, set to the absolute pathname used to invoke the shell or shell script being executed as passed in the environment or argument list. Subsequently, expands to the last argument to the previous command, after expansion. Also set to the full pathname used to invoke each command executed and placed in the environment exported to that command. When checking mail, this parameter holds the name of the mail file currently being checked.
fr: Au lancement de l'interpréteur, contient le chemin d'accès absolu utilisé pour appeler l'interpréteur ou le script en cours d'exécution tel qu'il est passé dans l'environnement ou dans la liste des arguments. Devient le dernier argument de la commande précédente, après développement. Mis aussi au chemin d'accès complet de chaque commande exécutée et se retrouve dans l'environnement exporté à cette commande. Lors de la vérification de l'arrivée de courriel, contient le nom du fichier de courriel en cours de consultation.

source: Shell Variables
fr: Variables de l'interpréteur

source: The following variables are set by the shell:
fr: Les variables suivantes sont créées par l'interpréteur :

source: Expands to the full file name used to invoke this instance of B<bash>.
fr: Se développe en chemin d'accès complet à l'instance courante de B<bash>.

source: An array variable whose values are the number of parameters in each frame of the current bash execution call stack. The number of parameters to the current subroutine (shell function or script executed with B<.> or B<source>) is at the top of the stack. When a subroutine is executed, the number of parameters passed is pushed onto B<BASH_ARGC>. The shell sets B<BASH_ARGC> only when in extended debugging mode (see the description of the B<extdebug> option to the B<shopt> builtin below)
fr: Une variable de type tableau dont les valeurs sont le nombre de paramètres de chaque trame de la pile d'appel d'exécution de l'interpréteur courant. Le nombre de paramètres du sous-programme courant (fonction de l'interpréteur ou script exécuté par B<.> ou B<source>) est au sommet de la pile. Lorsqu'un sous-programme est exécuté, le nombre de paramètres passés est placé dans B<BASH_ARGC>. L'interpréteur crée B<BASH_ARGC> seulement dans le mode de traçage étendu (voir plus bas la description de l'option B<extdebug> de la commande interne B<shopt>).
