Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: On startup, the history is initialized from the file named by the variable E<.SM> B<HISTFILE> (default I<~/.bash_history>). The file named by the value of E<.SM> B<HISTFILE> is truncated, if necessary, to contain no more than the number of lines specified by the value of E<.SM> B<HISTFILESIZE>. When an interactive shell exits, the last E<.SM> B<$HISTSIZE> lines are copied from the history list to E<.SM> B<$HISTFILE>. If the B<histappend> shell option is enabled (see the description of B<shopt> under E<.SM> B<SHELL BUILTIN COMMANDS> below), the lines are appended to the history file, otherwise the history file is overwritten. If E<.SM> B<HISTFILE> is unset, or if the history file is unwritable, the history is not saved. After saving the history, the history file is truncated to contain no more than E<.SM> B<HISTFILESIZE> lines. If E<.SM> B<HISTFILESIZE> is not set, no truncation is performed.
fr: Au démarrage, l'historique est initialisé avec le fichier dont le nom est contenu dans la variable E<.SM B<HISTFILE>> (par défaut I<~/.bash_history>). Le fichier désigné par la valeur de E<.SM B<HISTFILE>> est tronqué si nécessaire, pour ne pas contenir plus de lignes que le nombre spécifié par E<.SM B<HISTFILESIZE>.> Lorsqu'un interpréteur interactif termine, les E<.SM B<HISTSIZE>> dernières lignes de la file d'historique sont copiées dans le fichier E<.SM B<HISTFILE>.> Si l'option d'interpréteur B<histappend> est activée (voir plus bas la description de B<shopt> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>), les lignes sont ajoutées au fichier d'historique, sinon le fichier est écrasé. Si E<.SM B<HISTFILE>> est inexistante ou si le fichier d'historique n'est pas accessible en écriture, l'historique n'est pas sauvegardé. Après la sauvegarde de l'historique, le fichier d'historique est tronqué pour ne pas contenir plus de E<.SM B<HISTFILESIZE>> lignes. Si E<.SM B<HISTFILESIZE>> n'existe pas, aucune troncature n'est effectuée.

source: The builtin command B<fc> (see E<.SM> B<SHELL BUILTIN COMMANDS> below) may be used to list or edit and re-execute a portion of the history list. The B<history> builtin may be used to display or modify the history list and manipulate the history file. When using command-line editing, search commands are available in each editing mode that provide access to the history list.
fr: La commande interne B<fc> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>) permet d'afficher, d'éditer ou de ré-exécuter une partie de la file d'historique. La commande interne B<history> permet d'afficher la file d'historique et de manipuler le fichier d'historique. Quelque soit le mode d'édition en ligne de commande, des commandes de recherche donnent accès à la file d'historique.

source: The shell allows control over which commands are saved on the history list. The E<.SM> B<HISTCONTROL> and E<.SM> B<HISTIGNORE> variables may be set to cause the shell to save only a subset of the commands entered. The B<cmdhist> shell option, if enabled, causes the shell to attempt to save each line of a multi-line command in the same history entry, adding semicolons where necessary to preserve syntactic correctness. The B<lithist> shell option causes the shell to save the command with embedded newlines instead of semicolons. See the description of the B<shopt> builtin below under E<.SM> B<SHELL BUILTIN COMMANDS> for information on setting and unsetting shell options.
fr: L'interpréteur permet de configurer quelles commandes seront sauvegardées dans la file d'historique. Les variables E<.SM B<HISTCONTROL>> et E<.SM B<HISTIGNORE>> peuvent être configurées pour conduire l'interpréteur à ne sauvegarder qu'un sous-ensemble des commandes saisies. L'option d'interpréteur B<cmdhist>, si activée, conduit l'interpréteur à essayer de sauvegarder chaque ligne d'une commande multiligne dans le même élément de l'historique, en ajoutant des points-virgules si nécessaire pour préserver l'exactitude de la syntaxe. L'option d'interpréteur B<lithist> conduit l'interpréteur à sauvegarder les commandes avec des sauts de lignes incorporés plutôt que des points-virgules. Voir plus bas la description de la commande interne B<shopt> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>> pour des détails sur la création et la destruction des options d'interpréteur.

source: HISTORY EXPANSION
fr: DÉVELOPPEMENT DE L'HISTORIQUE

source: The shell supports a history expansion feature that is similar to the history expansion in B<csh.> This section describes what syntax features are available. This feature is enabled by default for interactive shells, and can be disabled using the B<\+H> option to the B<set> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below). Non-interactive shells do not perform history expansion by default.
fr: L'interpréteur propose des possibilités de développement de l'historique qui sont semblables à celles de B<csh>. Ce paragraphe décrit quelles syntaxes sont disponibles. Cette fonctionnalité est activée par défaut dans les interpréteurs interactifs et peut être désactivée en utilisant l'option B<\+H> de la commande interne B<set> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). Les interpréteurs non interactifs n'effectuent pas de développement d'historique par défaut.

source: History expansions introduce words from the history list into the input stream, making it easy to repeat commands, insert the arguments to a previous command into the current input line, or fix errors in previous commands quickly.
fr: Le développement de l'historique permet d'insérer des mots de la file d'historique dans le flot de saisie, facilitant la répétition de commandes, l'insertion des arguments d'une ligne antérieure dans la saisie en cours ou la correction rapide d'erreurs dans les commandes précédentes.

source: History expansion is performed immediately after a complete line is read, before the shell breaks it into words. It takes place in two parts. The first is to determine which line from the history list to use during substitution. The second is to select portions of that line for inclusion into the current one. The line selected from the history is the I<event>, and the portions of that line that are acted upon are I<words>. Various I<modifiers> are available to manipulate the selected words. The line is broken into words in the same fashion as when reading input, so that several I<metacharacter>-separated words surrounded by quotes are considered one word. History expansions are introduced by the appearance of the history expansion character, which is \^B<!>\^ by default. Only backslash (\^B<\e>\^) and single quotes can quote the history expansion character.
fr: Le développement de l'historique est effectué immédiatement après la lecture d'une ligne complète, avant que l'interpréteur ne la décompose en mots. Il se déroule en deux parties. La première consiste à déterminer la ligne de la file d'historique à utiliser pour les substitutions, la seconde permet de sélectionner les parties de la ligne à inclure dans la nouvelle ligne. La ligne sélectionnée dans l'historique est l'I<événement> et les parties de cette ligne à réutiliser sont des I<mots>. Plusieurs I<modificateurs> permettent de manipuler les mots sélectionnés. La ligne est découpée en mots de la même façon que lors de la lecture d'une saisie, ainsi plusieurs mots séparés par des I<métacaractères> et encadrés par des apostrophes sont considérés comme un unique mot. Le développement de l'historique est introduit par l'apparition du caractère de développement, qui est \^B<!>\^ par défaut. Seule la contre-oblique (\^B<\e>\^) et les apostrophes permettent de protéger le caractère de développement de l'historique.

source: Several characters inhibit history expansion if found immediately following the history expansion character, even if it is unquoted: space, tab, newline, carriage return, and B<=>. If the B<extglob> shell option is enabled, B<(> will also inhibit expansion.
fr: Plusieurs caractères empêchent le développement de l'historique s'ils se trouvent immédiatement après le caractère de développement de l'historique, même s'il n'est pas protégé : espace, tabulation, saut de ligne, retour-chariot et B<=>. Si l'option d'interpréteur B<extglob> est activée, B<(> empêchera aussi le développement.

source: Several shell options settable with the B<shopt> builtin may be used to tailor the behavior of history expansion. If the B<histverify> shell option is enabled (see the description of the B<shopt> builtin), and B<readline> is being used, history substitutions are not immediately passed to the shell parser. Instead, the expanded line is reloaded into the B<readline> editing buffer for further modification. If B<readline> is being used, and the B<histreedit> shell option is enabled, a failed history substitution will be reloaded into the B<readline> editing buffer for correction. The B<-p> option to the B<history> builtin command may be used to see what a history expansion will do before using it. The B<-s> option to the B<history> builtin may be used to add commands to the end of the history list without actually executing them, so that they are available for subsequent recall.
fr: Plusieurs options d'interpréteur, configurables avec la commande interne B<shopt> permettent d'ajuster le comportement de le développement de l'historique. Si l'option d'interpréteur B<histverify> est activée (voir la description de la commande interne B<shopt>) et si B<readline> est utilisée, les substitutions d'historiques ne sont pas transmises tout de suite à l'analyseur de l'interpréteur. À la place, la ligne développée est rechargée dans la mémoire tampon de B<readline> pour permettre des modifications ultérieures. Si B<readline> est utilisée et si l'option B<histreedit> est activée, une substitution d'historique qui échoue est rechargée dans la mémoire tampon de B<readline> pour correction. L'option B<-p> de la commande interne B<history> peut servir à examiner ce qu'une substitution donnera avant de l'employer réellement. L'option B<-s> de la commande interne B<history> permet d'ajouter des commandes à la fin de la file d'historique sans les avoir effectivement exécutées, afin qu'elles soient disponibles pour des rappels ultérieurs.

source: The shell allows control of the various characters used by the history expansion mechanism (see the description of B<histchars> above under B<Shell Variables>).
fr: L'interpréteur offre le contrôle des divers caractères utilisés par le mécanisme de développement de l'historique (voir la description de B<histchars> plus haut dans B<Variables de l'interpréteur>).

source: Event Designators
fr: Indicateur d'événement

source: An event designator is a reference to a command line entry in the history list.
fr: Un indicateur d'événement est une référence à un élément ligne de commande dans la file d'historique.

source: Start a history substitution, except when followed by a B<blank>, newline, carriage return, = or ( (when the B<extglob> shell option is enabled using the B<shopt> builtin).
fr: Débute une substitution d'historique, sauf s'il est suivi par un B<blanc>, saut de ligne, retour-chariot, = ou ( (lorsque l'option d'interpréteur B<extglob> est activée en utilisant la commande interne B<shopt>).

source: Refer to command line I<n>.
fr: Se réfère à la ligne de commande I<n>.

source: Refer to the current command line minus I<n>.
fr: Se réfère à la ligne de commande actuelle moins I<n>.

source: Refer to the previous command. This is a synonym for `!-1'.
fr: Est une référence à la commande précédente. C'est un synonyme de « !-1 ».

source: B<!>I<string>
fr: B<!>I<chaîne>

source: Refer to the most recent command starting with I<string>.
fr: Référence la plus récente commande commençant par la I<chaîne>.

source: B<!?>I<string>B<[?]>
fr: B<!?>I<chaîne>B<[?]>

source: Refer to the most recent command containing I<string>. The trailing B<?> may be omitted if I<string> is followed immediately by a newline.
fr: Se réfère à la plus récente commande contenant la I<chaîne>. Le B<?> final peut être omis si la I<chaîne> est suivie immédiatement d'un saut de ligne.

source: B<\d\s+2^\s-2\u>I<string1>B<\d\s+2^\s-2\u>I<string2>B<\d\s+2^\s-2\u>
fr: B<\d\s+2^\s-2\u>I<chaîne_1>B<\d\s+2^\s-2\u>I<chaîne_2>B<\d\s+2^\s-2\u>

source: Quick substitution. Repeat the last command, replacing I<string1> with I<string2>. Equivalent to ``!!:s/I<string1>/I<string2>/'' (see B<Modifiers> below).
fr: Substitution rapide. Répéter la dernière commande en remplaçant la I<chaîne_1> par la I<chaîne_2>. Équivalent à « !!:s/I<chaîne_1>/I<chaîne_2>/ » (voir B<Modificateurs> plus bas).

source: The entire command line typed so far.
fr: La ligne entière tapée jusqu'à présent.

source: Word Designators
fr: Indicateurs de mots

source: Word designators are used to select desired words from the event. A B<:> separates the event specification from the word designator. It may be omitted if the word designator begins with a B<^>, B<$>, B<*>, B<->, or B<%>. Words are numbered from the beginning of the line, with the first word being denoted by 0 (zero). Words are inserted into the current line separated by single spaces.
fr: Ces indicateurs servent à sélectionner les mots désirés dans un événement. Un B<:> sépare l'indicateur d'événements de l'indicateur de mot. On peut l'omettre si l'indicateur de mot commence par B<^>, B<$>, B<*>, B<-> ou B<%>. Les mots sont numérotés depuis le début de la ligne, le premier étant noté 0 (zéro). Les mots sont insérés dans la ligne courante, séparés par des espaces.

source: B<0 (zero)>
fr: B<0 (zéro)>

source: The zeroth word. For the shell, this is the command word.
fr: Le zéro-ième mot. Pour l'interpréteur, c'est le nom de la commande.

source: The I<n>th word.
fr: Le I<n>-ième mot.

source: The first argument. That is, word 1.
fr: Le premier argument, c'est-à-dire le mot 1.

source: The last argument.
fr: Le dernier argument.

source: The word matched by the most recent `?I<string>?' search.
fr: Le mot correspondant à la recherche « ?I<chaîne>? » la plus récente.

source: A range of words; `-I<y>' abbreviates `0-I<y>'.
fr: Une plage de mots, « -I<y> » permet d'abréger « 0-I<y> ».

source: All of the words but the zeroth. This is a synonym for `I<1-$>'. It is not an error to use B<*> if there is just one word in the event; the empty string is returned in that case.
fr: Tous les mots sauf le zéro-ième. C'est un synonyme pour « I<1-$> ». Il n'est pas erroné d'utiliser B<*> s'il n'y a qu'un mot dans l'événement ; la chaîne vide est renvoyée dans ce cas.

source: Abbreviates I<x-$>.
fr: Abréviation de I<x-$>.

source: Abbreviates I<x-$> like B<x*>, but omits the last word.
fr: Abréviation de I<x-$> comme B<x*>, mais sans le dernier mot.

source: If a word designator is supplied without an event specification, the previous command is used as the event.
fr: Si un indicateur de mot est fourni sans indication d'événement, la dernière commande est utilisée.

source: Modifiers
fr: Modificateurs

source: After the optional word designator, there may appear a sequence of one or more of the following modifiers, each preceded by a `:'.
fr: Après un indicateur de mot facultatif, une suite d'un ou plusieurs des modificateurs suivants peut apparaître, chacun précédé par un « : ».

source: Remove a trailing file name component, leaving only the head.
fr: Élimine la fin du chemin d'accès, ne laissant que son début.

source: Remove all leading file name components, leaving the tail.
fr: Supprimer tout le début d'un chemin d'accès, en ne laissant que la fin.

source: Remove a trailing suffix of the form I<.xxx>, leaving the basename.
fr: Supprime un suffixe final de la forme I<.xxx>, en ne laissant que le nom de base.

source: Remove all but the trailing suffix.
fr: Tout supprimer sauf le suffixe final.

source: Print the new command but do not execute it.
fr: Afficher la nouvelle commande sans l'exécuter.

source: Quote the substituted words, escaping further substitutions.
fr: Protéger les mots substitués, pour éviter des substitutions futures.

source: Quote the substituted words as with B<q>, but break into words at B<blanks> and newlines.
fr: Protéger les mots substitués comme avec B<q>, mais en séparant des mots aux B<blancs> et aux sauts de ligne.

source: B<s/>I<old>B</>I<new>B</>
fr: B<s/>I<ancien>B</>I<nouveau>B</>

source: Substitute I<new> for the first occurrence of I<old> in the event line. Any delimiter can be used in place of /. The final delimiter is optional if it is the last character of the event line. The delimiter may be quoted in I<old> and I<new> with a single backslash. If & appears in I<new>, it is replaced by I<old>. A single backslash will quote the &. If I<old> is null, it is set to the last I<old> substituted, or, if no previous history substitutions took place, the last I<string> in a B<!?>I<string>B<[?]> search.
fr: Remplacer par I<nouveau> la première occurrence de I<ancien> sur la ligne d'événement. N'importe quel délimiteur peut être utilisé à la place de /. Le dernier délimiteur est facultatif si c'est le dernier caractère de la ligne d'événement. Le délimiteur peut être protégé dans I<ancien> et I<nouveau> avec une seule contre-oblique. Si & apparaît dans I<nouveau>, il est remplacé par I<ancien>. Une seule contre-oblique protégera le &. Si I<ancien> est vide, il est mis au dernier I<ancien> substitué ou si aucune substitution n'a eu lieu précédemment, la dernière I<chaîne> dans une recherche B<!?>I<chaîne>B<[?]>.

source: Repeat the previous substitution.
fr: Répéter la substitution précédente.

source: Cause changes to be applied over the entire event line. This is used in conjunction with `B<:s>' (e.g., `B<:gs/>I<old>B</>I<new>B</>') or `B<:&>'. If used with `B<:s>', any delimiter can be used in place of /, and the final delimiter is optional if it is the last character of the event line. An B<a> may be used as a synonym for B<g>.
fr: Conduit à l'application des changements sur la ligne d'événement entière. Ceci est utilisé conjointement à « B<:s> » (par exemple « B<:gs/>I<ancien>B</>I<nouveau>B</> ») ou « B<:&> ». Si utilisé avec « B<:s> », n'importe quel délimiteur peut être utilisé à la place de / et le dernier délimiteur est facultatif si c'est le dernier caractère de la ligne d'événement. Un B<a> peut être utilisé en tant que synonyme de B<g>.

source: Apply the following `B<s>' modifier once to each word in the event line.
fr: Appliquer le modificateur « B<s> » suivant une fois à chacun des mots dans la ligne d'événements.

source: SHELL BUILTIN COMMANDS
fr: COMMANDES INTERNES DE L'INTERPRÉTEUR

source: Unless otherwise noted, each builtin command documented in this section as accepting options preceded by B<-> accepts B<--> to signify the end of the options. For example, the B<:>, B<true>, B<false>, and B<test> builtins do not accept options.
fr: Sauf indication contraire, chaque commande interne décrite dans ce paragraphe comme acceptant des options précédées de B<-> accepte également la notation B<--> pour signifier la fin des options. Par exemple, les commandes internes B<:>, B<true>, B<false> et B<test> n'acceptent aucune option.

source: No effect; the command does nothing beyond expanding I<arguments> and performing any specified redirections. A zero exit code is returned.
fr: Sans effet ; cette commande ne fait rien d'autre que développer les I<arguments> et effectuer les redirections. Un code final de zéro est renvoyé.

source: B<.\| > I<filename> [I<arguments>]
fr: B<.\| > I<fichier> [I<arguments>]

source: B<source> I<filename> [I<arguments>]
fr: B<source> I<fichier> [I<arguments>]

source: Read and execute commands from I<filename> in the current shell environment and return the exit status of the last command executed from I<filename>. If I<filename> does not contain a slash, file names in E<.SM> B<PATH> are used to find the directory containing I<filename>. The file searched for in E<.SM> B<PATH> need not be executable. When B<bash> is not in I<posix mode>, the current directory is searched if no file is found in E<.SM> B<PATH>. If the B<sourcepath> option to the B<shopt> builtin command is turned off, the E<.SM> B<PATH> is not searched. If any I<arguments> are supplied, they become the positional parameters when I<filename> is executed. Otherwise the positional parameters are unchanged. The return status is the status of the last command exited within the script (0 if no commands are executed), and false if I<filename> is not found or cannot be read.
fr: Lire et exécuter les commandes contenues dans le I<fichier> avec l'environnement de l'interpréteur courant, puis renvoyer l'état final de la dernière commande exécutée dans le I<fichier>. Si le nom du I<fichier> ne contient pas de barre oblique, les chemins d'accès contenus dans E<.SM B<PATH>> sont parcourus pour rechercher le répertoire contenant le I<fichier>. Lorsqu'il est recherché dans le E<.SM B<PATH>> le fichier n'a pas besoin d'être exécutable. Lorsque B<bash> n'est pas en I<mode posix>, le répertoire de travail courant est finalement examiné si aucun fichier n'est trouvé dans le E<.SM B<PATH>.> Si l'option B<sourcepath> de la commande interne B<shopt> est désactivée, le E<.SM B<PATH>> n'est pas parcouru. Si des I<arguments> sont fournis, ils sont transmis dans les paramètres positionnels lorsque le I<fichier> est exécuté. Sinon les paramètres positionnels ne sont pas modifiés. L'état renvoyé est l'état de la dernière commande terminée au sein du script (0 si aucune commande n'a été exécutée) et faux si le I<fichier> n'est pas trouvé ou ne peut être lu.

source: B<alias> [B<-p>] [I<name>[=I<value>] ...]
fr: B<alias> [B<-p>] [I<nom>[=I<valeur>] ...]

source: B<Alias> with no arguments or with the B<-p> option prints the list of aliases in the form B<alias> I<name>=I<value> on standard output. When arguments are supplied, an alias is defined for each I<name> whose I<value> is given. A trailing space in I<value> causes the next word to be checked for alias substitution when the alias is expanded. For each I<name> in the argument list for which no I<value> is supplied, the name and value of the alias is printed. B<Alias> returns true unless a I<name> is given for which no alias has been defined.
fr: La commande B<alias> sans argument ou avec l'option B<-p> affiche sur la sortie standard la liste des alias actuellement définis, sous la forme I<nom>=I<valeur>. Lorsque des arguments sont fournis, un alias est créé pour chaque I<nom> auquel on a donné une I<valeur>. Une espace finale dans une I<valeur> conduira à la recherche d'alias dans le mot suivant lors du développement de l'alias. Pour chacun des I<noms> pour lesquels aucune I<valeur> n'est fournie dans la liste d'arguments, le nom et la valeur de l'alias sont affichés. La commande B<alias> renvoie vrai, sauf si l'on indique un I<nom> pour lequel aucun alias n'a été défini.

source: B<bg> [I<jobspec> ...]
fr: B<bg> [I<tâche> ...]

source: Resume each suspended job I<jobspec> in the background, as if it had been started with B<&>. If I<jobspec> is not present, the shell's notion of the I<current job> is used. B<bg> I<jobspec> returns 0 unless run when job control is disabled or, when run with job control enabled, any specified I<jobspec> was not found or was started without job control.
fr: Reprend en arrière-plan chaque I<tâche> suspendue, comme si elle avait été lancée avec B<&>. Si aucune I<tâche> n'est précisée, la notion d'interpréteur de I<tâche courante> est utilisée. B<bg> I<tâche> renvoie 0 à moins que le contrôle des tâches soit désactivé, ou, quand le contrôle des tâches est activé, lorsque la I<tâche> spécifiée n'a pas été trouvé ou a été lancée sans contrôle de tâches.

source: B<bind> [B<-m> I<keymap>] [B<-lpsvPSV>]
fr: B<bind> [B<-m> I<jeu_de_raccourcis>] [B<-lpsvPSV>]
