Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: Write the formatted I<arguments> to the standard output under the control of the I<format>. The I<format> is a character string which contains three types of objects: plain characters, which are simply copied to standard output, character escape sequences, which are converted and copied to the standard output, and format specifications, each of which causes printing of the next successive I<argument>. In addition to the standard I<printf>(1) formats, B<%b> causes B<printf> to expand backslash escape sequences in the corresponding I<argument> (except that B<\ec> terminates output, backslashes in B<\e'>, B<\e">, and B<\e?> are not removed, and octal escapes beginning with B<\e0> may contain up to four digits), and B<%q> causes B<printf> to output the corresponding I<argument> in a format that can be reused as shell input.
fr: Écrit les I<arguments> mis en forme sur la sortie standard sous le contrôle du I<format>. Ce I<format> est une chaîne contenant trois types de caractères : normaux, qui sont simplement copiés sur la sortie standard, les caractères d'échappement qui sont convertis puis copiés sur la sortie standard et les spécifications de format qui conduisent chacune à l'affichage des I<arguments> successifs. En plus des formats standards de I<printf>(1), B<%b> conduit B<printf> à développer les suites de caractères d'échappement par contre-oblique se trouvant dans l'I<argument> correspondant (excepté que B<\ec> termine la sortie, que les contre-obliques dans B<\e'>, B<\e"> et B<\e?> ne sont pas supprimées et que les suites de caractères d'échappement pour les nombres en octal commençant par B<\e0> peuvent contenir jusqu'à quatre chiffres) et B<%q> conduit B<printf> à afficher l'I<argument> correspondant dans un format réutilisable en entrée de l'interpréteur.

source: The B<-v> option causes the output to be assigned to the variable I<var> rather than being printed to the standard output.
fr: L'option B<-v> conduit à affecter la sortie à la variable I<var> plutôt que de l'afficher sur la sortie standard.

source: The I<format> is reused as necessary to consume all of the I<arguments>. If the I<format> requires more I<arguments> than are supplied, the extra format specifications behave as if a zero value or null string, as appropriate, had been supplied. The return value is zero on success, non-zero on failure.
fr: Le I<format> est réutilisé jusqu'à consommer tous les I<arguments>. Si le I<format> demande plus d'I<arguments> que fournis, les spécifications supplémentaires se comportent comme si des valeurs zéro ou des chaînes vides, comme nécessaire, avaient été fournies. La valeur renvoyée est zéro en cas de succès, différente de zéro en cas d'échec.

source: B<pushd> [B<-n>] [I<dir>]
fr: B<pushd> [B<-n>] [I<rép>]

source: Adds a directory to the top of the directory stack, or rotates the stack, making the new top of the stack the current working directory. With no arguments, exchanges the top two directories and returns 0, unless the directory stack is empty. Arguments, if supplied, have the following meanings:
fr: Ajoute un répertoire au sommet de la pile des répertoires ou effectue une rotation dans la pile, en ramenant le répertoire courant au sommet. Sans argument, cette commande échange les deux répertoires au sommet et renvoie 0, sauf si la pile est vide. Les arguments, si fournis, ont les significations suivantes :

source: Rotates the stack so that the I<n>th directory (counting from the left of the list shown by B<dirs>, starting with zero) is at the top.
fr: Effectue une rotation dans la pile, de façon à amener au sommet le I<n>-ième répertoire (de la liste affichée par B<dirs> en comptant à partir de la gauche et en commençant à zéro).

source: Rotates the stack so that the I<n>th directory (counting from the right of the list shown by B<dirs>, starting with zero) is at the top.
fr: Effectue une rotation dans la pile, de façon à amener au sommet le I<n>-ième répertoire (en comptant à partir de la droite dans la liste affichée par B<dirs>, en commençant à zéro).

source: Suppresses the normal change of directory when adding directories to the stack, so that only the stack is manipulated.
fr: Empêche le changement normal de répertoire lors d'un ajout dans la pile. Seule la pile est manipulée.

source: I<dir>
fr: B<rép>

source: Adds I<dir> to the directory stack at the top, making it the new current working directory.
fr: Ajoute le répertoire I<rép> au sommet de la pile de répertoires en en faisant le nouveau répertoire de travail courant.

source: If the B<pushd> command is successful, a B<dirs> is performed as well. If the first form is used, B<pushd> returns 0 unless the cd to I<dir> fails. With the second form, B<pushd> returns 0 unless the directory stack is empty, a non-existent directory stack element is specified, or the directory change to the specified new current directory fails.
fr: Si la commande B<pushd> réussit, un B<dirs> est aussi effectué. Si on utilise la première forme, B<pushd> renvoie 0 sauf si le déplacement vers I<rép> échoue. Avec la seconde forme, B<pushd> renvoie 0 sauf si la pile est vide, si on a réclamé un élément inexistant de la pile ou si le changement de répertoire vers le nouveau répertoire spécifié échoue.

source: Print the absolute pathname of the current working directory. The pathname printed contains no symbolic links if the B<-P> option is supplied or the B<-o physical> option to the B<set> builtin command is enabled. If the B<-L> option is used, the pathname printed may contain symbolic links. The return status is 0 unless an error occurs while reading the name of the current directory or an invalid option is supplied.
fr: Affiche le chemin d'accès absolu au répertoire de travail actuel. Le chemin ne contiendra pas de liens symboliques si l'option B<-P> est fournie, ou si l'option B<-o physical> de la commande interne B<set> est activée. Si l'option B<-L> est utilisée, le chemin affiché peut contenir des liens symboliques. L'état renvoyé est 0, sauf si une erreur s'est produite durant la lecture du nom du répertoire courant ou si une option incorrecte est fournie.

source: B<read> [B<-ers>] [B<-u> I<fd>] [B<-t> I<timeout>] [B<-a> I<aname>] [B<-p> I<prompt>] [B<-n> I<nchars>] [B<-d> I<delim>] [I<name> ...]
fr: B<read> [B<-ers>] [B<-u> I<fd>] [B<-t> I<délai>] [B<-a> I<nom_t>] [B<-p> I<invite>] [B<-n> I<nb_car>] [B<-d> I<délimiteur>] [I<nom> ...]

source: One line is read from the standard input, or from the file descriptor I<fd> supplied as an argument to the B<-u> option, and the first word is assigned to the first I<name>, the second word to the second I<name>, and so on, with leftover words and their intervening separators assigned to the last I<name>. If there are fewer words read from the input stream than names, the remaining names are assigned empty values. The characters in E<.SM> B<IFS> are used to split the line into words. The backslash character (B<\e>) may be used to remove any special meaning for the next character read and for line continuation. Options, if supplied, have the following meanings:
fr: Une ligne est lue depuis l'entrée standard ou à partir du descripteur de fichier I<fd> fourni en argument à l'option B<-u>, puis le premier mot de cette ligne est affecté au premier I<nom>, le second mot au second I<nom>, et ainsi de suite avec les mots restants et leurs séparateurs affectés au dernier I<nom>. S'il y a moins de mots lus dans le flot d'entrée que de variables, des valeurs vides sont affectées à celles restantes. Les caractères contenus dans la variable E<.SM B<IFS>> sont utilisés pour découper la ligne en mots. Le caractère contre-oblique (B<\e>) permet de supprimer toute signification spéciale pour le caractère suivant et autorise la continuation de lignes. Les options, si fournies, ont les significations suivantes :

source: B<-a >I<aname>
fr: B<-a >I<nom_t>

source: The words are assigned to sequential indices of the array variable I<aname>, starting at 0. I<aname> is unset before any new values are assigned. Other I<name> arguments are ignored.
fr: Les mots sont affectés aux indices successifs d'une variable tableau de nom I<nom_t>, en commençant à 0. I<nom_t> est détruit avant que de nouvelles valeurs soient affectées. Les autres arguments I<nom> sont ignorés.

source: B<-d >I<delim>
fr: B<-d >I<délimiteur>

source: The first character of I<delim> is used to terminate the input line, rather than newline.
fr: Le premier caractère de I<délimiteur> est utilisé pour terminer la ligne de saisie, plutôt qu'un saut de ligne.

source: If the standard input is coming from a terminal, B<readline> (see E<.SM> B<READLINE> above) is used to obtain the line.
fr: Si l'entrée standard provient d'un terminal, la bibliothèque B<readline> (voir E<.SM B<READLINE>> plus haut) est utilisée pour obtenir la ligne.

source: B<-n >I<nchars>
fr: B<-n >I<nb_car>

source: B<read> returns after reading I<nchars> characters rather than waiting for a complete line of input.
fr: B<read> renvoie après avoir lu I<nb_car> caractères plutôt que d'attendre une ligne complète en entrée.

source: B<-p >I<prompt>
fr: B<-p >I<invite>

source: Display I<prompt> on standard error, without a trailing newline, before attempting to read any input. The prompt is displayed only if input is coming from a terminal.
fr: Affiche I<invite> sur la sortie d'erreur, sans caractère final de saut de ligne, avant d'essayer de lire toute nouvelle saisie. L'invite est affichée seulement si l'entrée vient d'un terminal.

source: Backslash does not act as an escape character. The backslash is considered to be part of the line. In particular, a backslash-newline pair may not be used as a line continuation.
fr: La contre-oblique n'agit pas comme un caractère d'échappement. La contre-oblique est considérée comme faisant partie de la ligne. En particulier, le couple contre-oblique-saut de ligne ne peut être utilisé comme une continuation de ligne.

source: Silent mode. If input is coming from a terminal, characters are not echoed.
fr: Mode silencieux. Si une entrée arrive à partir d'un terminal, les caractères ne sont pas affichés.

source: B<-t >I<timeout>
fr: B<-t >I<délai>

source: Cause B<read> to time out and return failure if a complete line of input is not read within I<timeout> seconds. This option has no effect if B<read> is not reading input from the terminal or a pipe.
fr: Conduit B<read> à expirer et renvoyer un échec si une ligne complète en entrée n'a pas été lue dans le I<délai> en secondes. Cette option n'a aucun effet si B<read> ne lit pas l'entrée à partir d'un terminal ou d'un tube.

source: Read input from file descriptor I<fd>.
fr: Lire l'entrée à partir du descripteur de fichier I<fd>.

source: If no I<names> are supplied, the line read is assigned to the variable E<.SM> B<REPLY>. The return code is zero, unless end-of-file is encountered, B<read> times out, or an invalid file descriptor is supplied as the argument to B<-u>.
fr: Si aucun I<nom> n'est fourni, la ligne lue est affectée entièrement à la variable E<.SM B<REPLY>.> Le code renvoyé est zéro, sauf si une fin-de-fichier est rencontrée, si B<read> dépasse son délai de réponse ou si un descripteur de fichier incorrect a été fourni en argument de B<-u>.

source: B<readonly> [B<-apf>] [I<name>[=I<word>] ...]
fr: B<readonly> [B<-apf>] [I<nom>[=I<mot>] ...]

source: The given I<names> are marked readonly; the values of these I<names> may not be changed by subsequent assignment. If the B<-f> option is supplied, the functions corresponding to the I<names> are so marked. The B<-a> option restricts the variables to arrays. If no I<name> arguments are given, or if the B<-p> option is supplied, a list of all readonly names is printed. The B<-p> option causes output to be displayed in a format that may be reused as input. If a variable name is followed by =I<word>, the value of the variable is set to I<word>. The return status is 0 unless an invalid option is encountered, one of the I<names> is not a valid shell variable name, or B<-f> is supplied with a I<name> that is not a function.
fr: Les I<nom>s indiqués reçoivent un attribut lecture-seule ; les valeurs de ces I<nom>s ne pourront plus être modifiées par des affectations ultérieures. Si l'option B<-f> est fournie, les fonctions correspondant à ces I<nom>s sont marquées en conséquence. L'option B<-a> restreint l'action aux variables tableaux. Si aucun argument I<nom> n'est indiqué ou si l'option B<-p> est fournie, une liste de tous les noms en lecture-seule est affichée. L'option B<-p> conduit à afficher la sortie dans un format susceptible d'être réutilisé en entrée. Si le nom d'une variable est suivi par =I<mot>, la variable est mise à I<mot>. L'état renvoyé est 0, sauf si une option incorrecte a été trouvée, si l'un des I<nom>s n'est pas un nom correct de variable de l'interpréteur ou si l'option B<-f> est fournie avec un I<nom> qui ne soit pas une fonction.

source: Causes a function to exit with the return value specified by I<n>. If I<n> is omitted, the return status is that of the last command executed in the function body. If used outside a function, but during execution of a script by the B<.> (B<source>) command, it causes the shell to stop executing that script and return either I<n> or the exit status of the last command executed within the script as the exit status of the script. If used outside a function and not during execution of a script by B<.>\^, the return status is false. Any command associated with the B<RETURN> trap is executed before execution resumes after the function or script.
fr: Conduit à la terminaison d'une fonction en renvoyant la valeur spécifiée par I<n>. Si I<n> est omis, la valeur renvoyée celle de la dernière commande exécutée dans le corps de la fonction. Si utilisée dehors d'une fonction, mais durant l'exécution d'un script par la commande B<.> (B<source>) elle conduit à la suspension de l'exécution du script par l'interpréteur et renvoie comme état final du script soit I<n> soit l'état final de la dernière commande exécutée dans le script. Si utilisée en dehors d'une fonction ni pendant un script exécuté par B<.>\^, l'état renvoyé est faux. Toute commande associée à la capture de B<RETURN> est exécutée avant que l'exécution reprenne après la fonction ou le script.

source: Without options, the name and value of each shell variable are displayed in a format that can be reused as input for setting or resetting the currently-set variables. Read-only variables cannot be reset. In I<posix mode>, only shell variables are listed. The output is sorted according to the current locale. When options are specified, they set or unset shell attributes. Any arguments remaining after the options are processed are treated as values for the positional parameters and are assigned, in order, to B<$1>, B<$2>, B<...> B<$>I<n>. Options, if specified, have the following meanings:
fr: Sans options, le nom et la valeur de chacune des variables de l'interpréteur sont affichés dans un format susceptible d'être réutilisé en entrée pour créer ou réinitialiser les variables courantes. Les variables en lecture seule ne peuvent pas être réinitialisées. Dans le I<mode posix>, seules les variables de l'interpréteur sont affichées. La sortie est triée en fonction des paramètres linguistiques régionaux courants. Lorsque des options sont spécifiées, elles créent ou détruisent des attributs de l'interpréteur. Tous les arguments restant après traitement des options sont considérés comme des valeurs pour les paramètres positionnels et sont affectés, dans l'ordre, à : B<$1>, B<$2>, B<...> B<$>I<n>. Les options, si spécifiées, ont les significations suivantes :

source: Automatically mark variables and functions which are modified or created for export to the environment of subsequent commands.
fr: Marquage automatique des variables et fonctions modifiées ou créées pour qu'elles soient exportées dans l'environnement des commandes exécutées ultérieurement.

source: Report the status of terminated background jobs immediately, rather than before the next primary prompt. This is effective only when job control is enabled.
fr: Signaler l'état des tâches terminées en arrière-plan immédiatement, plutôt que d'attendre l'affichage de la prochaine invite de base. N'est effectif que si le contrôle des tâches est activé.

source: Exit immediately if a I<simple command> (see E<.SM> B<SHELL GRAMMAR> above) exits with a non-zero status. The shell does not exit if the command that fails is part of the command list immediately following a B<while> or B<until> keyword, part of the test in an I<if> statement, part of a B<&&> or B<\(bv\(bv> list, or if the command's return value is being inverted via B<!>. A trap on B<ERR>, if set, is executed before the shell exits.
fr: Termine immédiatement si I<commande simple> (voir E<.SM B<GRAMMAIRE DE L'INTERPRÉTEUR>> plus haut) termine avec un état différent de zéro. L'interpréteur ne termine pas si la commande qui échoue fait partie d'une liste de commandes immédiatement suivie par un mot-clef B<while> ou B<until>, dans le test d'un I<if>, dans une liste de B<&&> ou de B<\(bv\|\(bv> ou si la valeur renvoyée par la commande est inversée par B<!>. Une capture sur B<ERR>, si existante, est exécutée avant que l'interpréteur termine.

source: Disable pathname expansion.
fr: Désactivation du développement des chemins.

source: Remember the location of commands as they are looked up for execution. This is enabled by default.
fr: Mémorisation de l'emplacement des commandes lors de leur exécution. Activé par défaut.

source: All arguments in the form of assignment statements are placed in the environment for a command, not just those that precede the command name.
fr: Tous les arguments sous la forme d'affectations sont placés dans l'environnement d'une commande, et non pas seulement ceux qui précèdent le nom de la commande.

source: Monitor mode. Job control is enabled. This option is on by default for interactive shells on systems that support it (see E<.SM> B<JOB CONTROL> above). Background processes run in a separate process group and a line containing their exit status is printed upon their completion.
fr: Mode supervision. Activation du contrôle des tâches. Cette option est activée par défaut pour les interpréteurs interactifs sur les systèmes qui le permettent (voir E<.SM> B<CONTRÔLE DES TÂCHES> plus haut). Les processus en arrière-plan sont exécutés dans un groupe de processus séparé et une ligne contenant leurs états finaux est affichée lorsqu'ils terminent.

source: Read commands but do not execute them. This may be used to check a shell script for syntax errors. This is ignored by interactive shells.
fr: Lecture de commandes sans exécution. Ceci peut être utilisé pour rechercher les erreurs de syntaxe dans un script. Cette option est ignorée par les interpréteurs interactifs.

source: B<-o >I<option-name>
fr: B<-o >I<nom_d_option>

source: The I<option-name> can be one of the following:
fr: Le I<nom_d_option> est l'un des suivants :

source: Same as B<-a>.
fr: Identique à B<-a>.

source: Same as B<-B>.
fr: Identique à B<-B>.

source: Use an emacs-style command line editing interface. This is enabled by default when the shell is interactive, unless the shell is started with the B<--noediting> option.
fr: Utiliser une interface d'édition des lignes de commande « à la emacs ». C'est le comportement activé par défaut quand l'interpréteur est interactif, à moins que l'interpréteur soit démarré avec l'option B<--noediting>.

source: Same as B<-E>.
fr: Identique à B<-E>.

source: Same as B<-T>.
fr: Identique à B<-T>.

source: Same as B<-e>.
fr: Identique à B<-e>.

source: Same as B<-h>.
fr: Identique à B<-h>.

source: Same as B<-H>.
fr: Identique à B<-H>.

source: Enable command history, as described above under E<.SM> B<HISTORY>. This option is on by default in interactive shells.
fr: Activer l'historique des commandes, comme décrit plus haut dans E<.SM> B<HISTORY>. Cette option est activée par défaut dans les interpréteurs interactifs.

source: The effect is as if the shell command
fr: Identique à l'exécution de la commande d'interpréteur

source: had been executed (see B<Shell Variables> above).
fr: (voir B<Variables de l'interpréteur> plus haut).

source: Same as B<-k>.
fr: Identique à B<-k>.

source: Same as B<-m>.
fr: Identique à B<-m>.

source: Same as B<-C>.
fr: Identique à B<-C>.

source: Same as B<-n>.
fr: Identique à B<-n>.

source: Same as B<-f>. B<nolog> Currently ignored.
fr: Identique à B<-f>. B<nolog> Actuellement ignoré.

source: Same as B<-b>.
fr: Identique à B<-b>.

source: Same as B<-u>.
fr: Identique à B<-u>.

source: Same as B<-t>.
fr: Identique à B<-t>.

source: Same as B<-P>.
fr: Identique à B<-P>.

source: If set, the return value of a pipeline is the value of the last (rightmost) command to exit with a non-zero status, or zero if all commands in the pipeline exit successfully. This option is disabled by default.
fr: Si existante, la valeur renvoyée par une conduite est la valeur de la dernière commande (la plus à droite) à terminer avec un état final différent de zéro ou zéro si toutes les commandes de la conduite terminent avec succès. Cette option est désactivée par défaut.

source: Same as B<-p>.
fr: Identique à B<-p>.

source: Same as B<-v>.
fr: Identique à B<-v>.

source: Use a vi-style command line editing interface.
fr: Utiliser une interface d'édition des lignes de commande « à la vi ».

source: Same as B<-x>.
fr: Identique à B<-x>.

source: If B<-o> is supplied with no I<option-name>, the values of the current options are printed. If B<+o> is supplied with no I<option-name>, a series of B<set> commands to recreate the current option settings is displayed on the standard output.
fr: Si B<-o> est fournie sans I<nom_d_option>, les valeurs actuelles des options sont affichées. Si B<+o> est fournie sans I<nom_d_option>, la série de commandes B<set> permettant de recréer la configuration courante d'options est affichée sur la sortie standard.

source: Turn on I<privileged> mode. In this mode, the E<.SM> B<$ENV> and E<.SM> B<$BASH_ENV> files are not processed, shell functions are not inherited from the environment, and the E<.SM> B<SHELLOPTS> variable, if it appears in the environment, is ignored. If the shell is started with the effective user (group) id not equal to the real user (group) id, and the B<-p> option is not supplied, these actions are taken and the effective user id is set to the real user id. If the B<-p> option is supplied at startup, the effective user id is not reset. Turning this option off causes the effective user and group ids to be set to the real user and group ids.
fr: Basculer en mode I<privilégié>. Dans ce mode, les fichiers B<$ENV> et B<$BASH_ENV> ne sont pas traités, les fonctions de l'interpréteur ne sont pas héritées de l'environnement et la variable B<SHELLOPTS>, si dans l'environnement, est ignorée. Si l'interpréteur démarre avec un UID (resp. GID) effectif différent de son UID (GID) réel et si l'option B<-p> n'est pas fournie, ce comportement est appliqué et l'UID (GID) effectif est mis au UID (GID) réel. Si l'option B<-p> est fournie au démarrage l'UID (GID) effectif n'est pas modifié. Désactiver cette option conduit à la mise des UID et GID effectifs à la valeur des UID et GID réels.

source: Exit after reading and executing one command.
fr: Terminer après lecture et exécution d'une commande.
