Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: An array variable containing all of the parameters in the current bash execution call stack. The final parameter of the last subroutine call is at the top of the stack; the first parameter of the initial call is at the bottom. When a subroutine is executed, the parameters supplied are pushed onto B<BASH_ARGV>. The shell sets B<BASH_ARGV> only when in extended debugging mode (see the description of the B<extdebug> option to the B<shopt> builtin below)
fr: Une variable de type tableau contenant tous les paramètres de la pile d'appel d'exécution de l'interpréteur courant. Le dernier paramètre du dernier sous-programme est au sommet de la pile ; le premier paramètre de l'appel initial est en bas. Lorsqu'un sous-programme est exécuté, les paramètres fournis sont placés dans B<BASH_ARGV>. L'interpréteur crée B<BASH_ARGV> seulement dans le mode de traçage étendu (voir plus bas la description de l'option B<extdebug> de la commande interne B<shopt>).

source: The command currently being executed or about to be executed, unless the shell is executing a command as the result of a trap, in which case it is the command executing at the time of the trap.
fr: La commande en cours d'exécution ou sur le point d'être exécutée, à moins que l'interpréteur n'exécute une commande à la suite d'une capture, auquel cas c'est la commande s'exécutant au moment de la capture.

source: The command argument to the B<-c> invocation option.
fr: L'argument commande de l'option d'appel B<-c>.

source: An array variable whose members are the line numbers in source files corresponding to each member of B<FUNCNAME>. B<${BASH_LINENO[>I<$i>B<]}> is the line number in the source file where B<${FUNCNAME[>I<$ifP>B<]}>I< was called. The corresponding source file name is >B<${BASH_SOURCE[>I<$i>B<]}. Use LINENO to obtain the current line number.>
fr: Une variable de type tableau dont les éléments sont les numéros de ligne des fichiers sources correspondant à chacun des éléments de B<FUNCNAME>. B<${BASH_LINENO[>I<$i>B<]}> est le numéro de la ligne dans le fichier source où B<${FUNCNAME[>I<$ifP>B<]}> a été appelé. Le nom du fichier source correspondant est B<${BASH_SOURCE[>I<$i>B<]}>. Utilisez B<LINENO> pour obtenir le numéro de ligne courant.

source: An array variable whose members are assigned by the B<=~> binary operator to the B<[[> conditional command. The element with index 0 is the portion of the string matching the entire regular expression. The element with index I<n> is the portion of the string matching the I<n>th parenthesized subexpression. This variable is read-only.
fr: Une variable de type tableau dont les éléments sont affectés avec l'opérateur binaire B<=~> dans la commande conditionnelle B<[[>. L'élément d'indice 0 est la partie de la chaîne correspondant à l'expression rationnelle complète. L'élément d'indice I<n> est la partie de la chaîne correspondant à la I<n>-ième sous-expression entre parenthèses. Cette variable est en lecture seule.

source: An array variable whose members are the source filenames corresponding to the elements in the B<FUNCNAME> array variable.
fr: Une variable de type tableau dont les éléments sont les noms des fichiers source correspondants aux éléments de la variable tableau B<FUNCNAME>.

source: Incremented by one each time a subshell or subshell environment is spawned. The initial value is 0.
fr: Incrémenté chaque fois qu'un sous-interpréteur ou qu'un environnement de sous-interpréteur est engendré. La valeur initiale est 0.

source: A readonly array variable whose members hold version information for this instance of B<bash>. The values assigned to the array members are as follows:
fr: Une variable de type tableau protégée en écriture dont les éléments représentent la version de cette instance de B<bash>. Cette valeur est affectée aux éléments du tableau comme suit :

source: The major version number (the I<release>).
fr: Le numéro majeur de la version (I<release>).

source: The minor version number (the I<version>).
fr: Le numéro mineur de la version (I<version>).

source: The patch level.
fr: Le niveau de correctif.

source: The build version.
fr: Le numéro de compilation.

source: The release status (e.g., I<beta1>).
fr: Le statut de cette version (p. ex., I<beta1>).

source: The value of B<MACHTYPE>.
fr: La valeur de B<MACHTYPE>.

source: Expands to a string describing the version of this instance of B<bash>.
fr: Se développe en une chaîne décrivant le numéro de version de cette instance de B<bash>.

source: An index into B<${COMP_WORDS}> of the word containing the current cursor position. This variable is available only in shell functions invoked by the programmable completion facilities (see B<Programmable Completion> below).
fr: Un indice dans B<${COMP_WORDS}> du mot contenant la position courant du curseur. Cette variable n'est disponible que dans les fonctions de l'interpréteur appelées par les outils de complètement programmables (voir B<Complètement programmable> plus bas).

source: The current command line. This variable is available only in shell functions and external commands invoked by the programmable completion facilities (see B<Programmable Completion> below).
fr: La ligne de commande courante. Cette variable n'est disponible que dans les fonctions de l'interpréteur appelées par les outils de complètement programmables (voir B<Complètement programmable> plus bas).

source: The index of the current cursor position relative to the beginning of the current command. If the current cursor position is at the end of the current command, the value of this variable is equal to B<${#COMP_LINE}>. This variable is available only in shell functions and external commands invoked by the programmable completion facilities (see B<Programmable Completion> below).
fr: L'indice de la position courante du curseur relatif au début de la commande courante. Si la position courante du curseur est à la fin de la commande courante, la valeur de cette variable est égale à B<${#COMP_LINE}>. Cette variable n'est disponible que dans les fonctions de l'interpréteur et les commandes externes appelées par les outils de complètement programmables (voir B<Complètement programmable> plus bas).

source: The set of characters that the Readline library treats as word separators when performing word completion. If E<.SM> B<COMP_WORDBREAKS> is unset, it loses its special properties, even if it is subsequently reset.
fr: Le jeu de caractères que la bibliothèque readline considère comme séparateurs de mots lors du complètement de mots. Si E<.SM B<COMP_WORDBREAKS>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: An array variable (see B<Arrays> below) consisting of the individual words in the current command line. This variable is available only in shell functions invoked by the programmable completion facilities (see B<Programmable Completion> below).
fr: Une variable de type tableau (voir B<Tableaux> plus bas) consistant en des mots individuels de la ligne de commande courante. Cette variable n'est disponible que dans les fonctions de l'interpréteur appelées par les outils de complètement programmables (voir B<Complètement programmable> plus bas).

source: An array variable (see B<Arrays> below) containing the current contents of the directory stack. Directories appear in the stack in the order they are displayed by the B<dirs> builtin. Assigning to members of this array variable may be used to modify directories already in the stack, but the B<pushd> and B<popd> builtins must be used to add and remove directories. Assignment to this variable will not change the current directory. If E<.SM> B<DIRSTACK> is unset, it loses its special properties, even if it is subsequently reset.
fr: Une variable de type tableau (voir B<Tableaux> plus bas) représentant le contenu courant de la pile de répertoires. Les répertoires apparaissent dans la pile dans l'ordre dans lequel la commande interne B<dirs> les affiche. Les affectations des éléments de cette variable tableau peuvent être utilisés pour modifier les répertoires déjà dans la pile, mais les commandes internes B<pushd> et B<popd> doivent être utilisées pour ajouter et enlever des répertoires. L'affectation de cette variable ne modifiera pas le répertoire courant. Si E<.SM B<DIRSTACK>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: Expands to the effective user ID of the current user, initialized at shell startup. This variable is readonly.
fr: Contient l'UID effectif de l'utilisateur, initialisé au démarrage de l'interpréteur. Cette variable est en lecture seule.

source: An array variable containing the names of all shell functions currently in the execution call stack. The element with index 0 is the name of any currently-executing shell function. The bottom-most element is "main". This variable exists only when a shell function is executing. Assignments to E<.SM> B<FUNCNAME> have no effect and return an error status. If E<.SM> B<FUNCNAME> is unset, it loses its special properties, even if it is subsequently reset.
fr: Une variable de type tableau contenant le nom de toutes les fonctions de l'interpréteur actuellement dans la pile d'appel d'exécution. L'élément d'indice 0 est le nom de n'importe laquelle des fonctions de l'interpréteur en cours d'exécution. L'élément le plus bas est « main ». Cette variable n'existe que si une fonction de l'interpréteur est en cours d'exécution. Les affectations de B<FUNCNAME> n'ont aucun effet et renvoient un état d'erreur. Si E<.SM B<FUNCNAME>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: An array variable containing the list of groups of which the current user is a member. Assignments to E<.SM> B<GROUPS> have no effect and return an error status. If E<.SM> B<GROUPS> is unset, it loses its special properties, even if it is subsequently reset.
fr: Une variable de type tableau contenant la liste des groupes dont l'utilisateur est membre. Les affectations de E<.SM B<GROUPS>> n'ont aucun effet et renvoient un état d'erreur. Si E<.SM B<GROUPS>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: The history number, or index in the history list, of the current command. If E<.SM> B<HISTCMD> is unset, it loses its special properties, even if it is subsequently reset.
fr: Le numéro d'historique ou l'indice dans la file d'historique, de la commande en cours. Si E<.SM B<HISTCMD>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: Automatically set to the name of the current host.
fr: Automatiquement mis au nom de la machine courante.

source: Automatically set to a string that uniquely describes the type of machine on which B<bash> is executing. The default is system-dependent.
fr: Automatiquement mis à une chaîne qui décrit de façon unique le type de machine sur laquelle B<bash> s'exécute. La valeur par défaut dépend du système.

source: Each time this parameter is referenced, the shell substitutes a decimal number representing the current sequential line number (starting with 1) within a script or function. When not in a script or function, the value substituted is not guaranteed to be meaningful. If E<.SM> B<LINENO> is unset, it loses its special properties, even if it is subsequently reset.
fr: Chaque fois que ce paramètre est consulté, l'interpréteur le remplace par un nombre décimal représentant le numéro de la ligne actuelle (commençant à 1), au sein du script ou de la fonction. Hors d'un script ou d'une fonction, la valeur n'a pas nécessairement de sens. Si E<.SM B<LINENO>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: Automatically set to a string that fully describes the system type on which B<bash> is executing, in the standard GNU I<cpu-company-system> format. The default is system-dependent.
fr: Automatiquement mis à une chaîne décrivant le type du système sur lequel B<bash> s'exécute, dans le format standard de GNU I<processeur-compagnie-système>. La valeur par défaut dépend du système.

source: The previous working directory as set by the B<cd> command.
fr: Le répertoire de travail précédent comme mis par la commande B<cd>.

source: The value of the last option argument processed by the B<getopts> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: La valeur du dernier argument d'option traité par la commande interne B<getopts> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: The index of the next argument to be processed by the B<getopts> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: L'indice du prochain argument à traiter par la commande interne B<getopts> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: Automatically set to a string that describes the operating system on which B<bash> is executing. The default is system-dependent.
fr: Automatiquement mis à une chaîne qui décrit le système d'exploitation sur lequel B<bash> s'exécute. La valeur par défaut dépend du système.

source: An array variable (see B<Arrays> below) containing a list of exit status values from the processes in the most-recently-executed foreground pipeline (which may contain only a single command).
fr: Une variable de type tableau (voir B<Tableaux> plus bas) contenant une liste des états finaux des processus exécutés dans la conduite exécutée la plus récemment au premier plan (qui peut éventuellement contenir une seule commande).

source: The process ID of the shell's parent. This variable is readonly.
fr: L'identifiant du processus parent de l'interpréteur. Cette variable est en lecture seule.

source: The current working directory as set by the B<cd> command.
fr: Le répertoire de travail courant comme mis par la commande B<cd>.

source: Each time this parameter is referenced, a random integer between 0 and 32767 is generated. The sequence of random numbers may be initialized by assigning a value to E<.SM> B<RANDOM>. If E<.SM> B<RANDOM> is unset, it loses its special properties, even if it is subsequently reset.
fr: À chaque fois que ce paramètre est consulté, un entier aléatoire entre 0 et 32767 est engendré. Cette suite de nombres aléatoires peut être initialisée en affectant une valeur à E<.SM B<RANDOM>.> Si E<.SM B<RANDOM>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: Set to the line of input read by the B<read> builtin command when no arguments are supplied.
fr: Mis à la ligne de saisie lue par la commande interne B<read> lorsqu'aucun argument n'a été fourni.

source: Each time this parameter is referenced, the number of seconds since shell invocation is returned. If a value is assigned to E<.SM> B<SECONDS>, the value returned upon subsequent references is the number of seconds since the assignment plus the value assigned. If E<.SM> B<SECONDS> is unset, it loses its special properties, even if it is subsequently reset.
fr: À chaque fois que ce paramètre est consulté, le nombre de secondes écoulées depuis le lancement de l'interpréteur est renvoyé. Si une valeur est affectée à E<.SM B<SECONDS>,> les valeurs renvoyées lors des consultations ultérieures sont le nombre de secondes écoulées depuis l'affectation, ajoutées à la valeur affectée. Si E<.SM B<SECONDS>> est détruite, elle perd ses propriétés spéciales, même si elle est recréée par la suite.

source: A colon-separated list of enabled shell options. Each word in the list is a valid argument for the B<-o> option to the B<set> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below). The options appearing in E<.SM> B<SHELLOPTS> are those reported as I<on> by B<set -o>. If this variable is in the environment when B<bash> starts up, each shell option in the list will be enabled before reading any startup files. This variable is read-only.
fr: Liste des options activées de l'interpréteur, séparées par des virgules. Chaque mot de la liste est un argument correct pour l'option B<-o> de la commande interne B<set> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). Les options apparaissant dans E<.SM B<SHELLOPTS>> sont celle indiquées comme I<actives> par B<set -o>. Si cette variable est dans l'environnement au lancement de B<bash>, chaque option de la liste est activée avant de lire les fichiers d'initialisation. Cette variable est en lecture seule.

source: Incremented by one each time an instance of B<bash> is started.
fr: Incrémenté de 1 à chaque appel d'une instance de B<bash>.

source: Expands to the user ID of the current user, initialized at shell startup. This variable is readonly.
fr: Contient l'UID de l'utilisateur courant, initialisé au démarrage de l'interpréteur. Cette variable est en lecture seule.

source: The following variables are used by the shell. In some cases, B<bash> assigns a default value to a variable; these cases are noted below.
fr: Les variables suivantes sont utilisées par l'interpréteur. Dans certains cas, B<bash> affecte des valeurs par défaut aux variables ; ces cas sont décrits plus bas.

source: If this parameter is set when B<bash> is executing a shell script, its value is interpreted as a filename containing commands to initialize the shell, as in I<~/.bashrc>. The value of E<.SM> B<BASH_ENV> is subjected to parameter expansion, command substitution, and arithmetic expansion before being interpreted as a file name. E<.SM> B<PATH> is not used to search for the resultant file name.
fr: Si ce paramètre existe lorsque B<bash> exécute un script, sa valeur est considérée comme un nom de fichier contenant les commandes d'initialisation de l'interpréteur, comme dans I<~/.bashrc>. La valeur de E<.SM B<BASH_ENV>> est soumise au développement des paramètres, à la substitution de commande et au développement arithmétique avant d'être considérée comme un nom de fichier. E<.SM B<PATH>> n'est pas utilisée pour rechercher le fichier obtenu.

source: The search path for the B<cd> command. This is a colon-separated list of directories in which the shell looks for destination directories specified by the B<cd> command. A sample value is
fr: Le chemin de recherche de la commande interne B<cd>. Il s'agit d'une liste de répertoires, séparés par des deux-points « : », que l'interpréteur consulte lorsqu'il cherche un sous-répertoire destination de la commande B<cd>. Un exemple de valeur est

source: Used by the B<select> builtin command to determine the terminal width when printing selection lists. Automatically set upon receipt of a SIGWINCH.
fr: Utilisée par la commande interne B<select> pour déterminer la taille du terminal lors de l'affichage des listes de sélection. Automatiquement mis à la réception d'un signal SIGWINCH.

source: An array variable from which B<bash> reads the possible completions generated by a shell function invoked by the programmable completion facility (see B<Programmable Completion> below).
fr: Une variable de type tableau dans lequel B<bash> lit les complètements possibles produits par une fonction de l'interpréteur appelée par les outils de complètement programmables (voir B<Complètement programmable> plus bas).

source: If B<bash> finds this variable in the environment when the shell starts with value
fr: Si B<bash> trouve cette variable dans l'environnement lorsque l'interpréteur démarre avec la valeur

source: it assumes that the shell is running in an emacs shell buffer and disables line editing.
fr: il considère que l'interpréteur est lancé dans un tampon d'interpréteur emacs et désactive l'édition en ligne.

source: The default editor for the B<fc> builtin command.
fr: L'éditeur par défaut utilisé par la commande interne B<fc>.

source: A colon-separated list of suffixes to ignore when performing filename completion (see E<.SM> B<READLINE> below). A filename whose suffix matches one of the entries in E<.SM> B<FIGNORE> is excluded from the list of matched filenames. A sample value is
fr: Une liste de suffixes, séparés par des deux-points « : », que B<bash> ignorera lors du complètement des noms de fichiers (voir E<.SM B<READLINE>> plus bas). Un nom de fichier dont le suffixe correspond à l'un de ceux mentionnés dans E<.SM B<FIGNORE>> est exclu de la liste des noms de fichiers correspondant pour le complètement. Par exemple, cette variable peut prendre la valeur

source: (Quoting is needed when assigning a value to this variable, which contains tildes).
fr: (Des protections sont nécessaires pour l'affectation d'une valeur à cette variable, qui contient des tildes).

source: A colon-separated list of patterns defining the set of filenames to be ignored by pathname expansion. If a filename matched by a pathname expansion pattern also matches one of the patterns in E<.SM> B<GLOBIGNORE>, it is removed from the list of matches.
fr: Une liste de motifs séparés par des deux-points, définissant l'ensemble des noms de fichiers à ignorer lors du développement des chemins. Si un nom de fichier correspondant à un motif de développement des chemins, correspond également à un motif dans E<.SM B<GLOBIGNORE>,> il est supprimé de la liste des correspondances.

source: A colon-separated list of values controlling how commands are saved on the history list. If the list of values includes I<ignorespace>, lines which begin with a B<space> character are not saved in the history list. A value of I<ignoredups> causes lines matching the previous history entry to not be saved. A value of I<ignoreboth> is shorthand for I<ignorespace> and I<ignoredups>. A value of I<erasedups> causes all previous lines matching the current line to be removed from the history list before that line is saved. Any value not in the above list is ignored. If B<HISTCONTROL> is unset, or does not include a valid value, all lines read by the shell parser are saved on the history list, subject to the value of B<HISTIGNORE>. The second and subsequent lines of a multi-line compound command are not tested, and are added to the history regardless of the value of B<HISTCONTROL>.
fr: Une liste de valeurs, séparées par des deux-points, commandant la façon dont les commandes sont sauvegardées dans la file d'historique. Si la liste des valeurs contient la valeur I<ignorespace>, les lignes commençant par une B<espace> ne sont pas sauvegardées dans la file d'historique. La valeur I<ignoredups> conduit à ne pas sauvegarder une ligne correspondant exactement à la ligne de commande précédente. La présence de I<ignoreboth> est un condensé pour I<ignorespace> et I<ignoredups>. La valeur I<erasedups> conduit à retirer de la file d'historique toutes les lignes précédant la ligne courante et lui correspondant avant que cette ligne y soit sauvegardée. Toute valeur qui ne fait pas partie de la liste ci-dessus est ignorée. Si E<.SM B<HISTCONTROL>> est inexistante ou si elle ne contient pas une valeur correcte, toutes les lignes lues par l'analyseur de l'interpréteur seront sauvegardées dans la file d'historique, selon la valeur de B<HISTIGNORE>. La seconde ligne et les suivantes d'une commande multiligne ne sont pas testées et sont ajoutées dans l'historique indépendamment de la valeur de B<HISTCONTROL>.

source: The name of the file in which command history is saved (see E<.SM> B<HISTORY> below). The default value is I<~/.bash_history>. If unset, the command history is not saved when an interactive shell exits.
fr: Le nom du fichier dans lequel l'historique des commandes est sauvegardé (voir E<.SM B<HISTORIQUE>> plus bas). Par défaut, il s'agit de I<~/.bash_history>. Si inexistante, l'historique des commandes n'est pas sauvegardé lorsqu'un interpréteur interactif termine.
