Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: The syntax for controlling key bindings in the I<inputrc> file is simple. All that is required is the name of the command or the text of a macro and a key sequence to which it should be bound. The name may be specified in one of two ways: as a symbolic key name, possibly with I<Meta-> or I<Control-> prefixes, or as a key sequence.
fr: La syntaxe de définition des raccourcis clavier dans le fichier I<inputrc> est simple. Tout ce qui est nécessaire est le nom de la commande ou le texte d'une macro et la suite de touches à laquelle il faut l'associer. Les noms de touches peuvent être spécifiés de l'une des deux façons : comme un nom de touche symbolique, éventuellement précédé des préfixes I<Meta-> ou I<Control-> ou sous forme d'une suite de touches.

source: When using the form B<keyname>:\^I<function-name> or I<macro>, I<keyname> is the name of a key spelled out in English. For example:
fr: En utilisant la forme B<touche>:\^I<nom_de_fonction> ou I<macro>, I<touche> est le nom de la touche en anglais. Par exemple :

source: In the above example, I<C-u> is bound to the function B<universal-argument>, I<M-DEL> is bound to the function B<backward-kill-word>, and I<C-o> is bound to run the macro expressed on the right hand side (that is, to insert the text
fr: Dans l'exemple ci-dessus, I<C-u> est associé à la fonction B<universal-argument>, I<M-DEL> à la fonction B<backward-kill-word> et I<C-o> à l'exécution de la macro exprimée dans la partie gauche (c'est-à-dire, insérer le texte

source: into the line).
fr: sur la ligne).

source: In the second form, B<"keyseq">:\^I<function-name> or I<macro>, B<keyseq> differs from B<keyname> above in that strings denoting an entire key sequence may be specified by placing the sequence within double quotes. Some GNU Emacs style key escapes can be used, as in the following example, but the symbolic character names are not recognized.
fr: Avec la seconde forme, B<"touches">:\^I<nom_de_fonction> ou I<macro>, B<touches> diffère de B<touche> ci-dessus en ce que les chaînes notant une suite complète de touches peut être spécifiée en plaçant la suite entre guillemets doubles. Certaines suites de touches d'échappement dans le style GNU Emacs peuvent être utilisées, comme dans l'exemple suivant, mais les noms de caractères symboliques ne sont pas reconnus.

source: In this example, I<C-u> is again bound to the function B<universal-argument>. I<C-x C-r> is bound to the function B<re-read-init-file>, and I<ESC [ 1 1 ~> is bound to insert the text
fr: Dans cet exemple, I<C-u> est à nouveau associé à la fonction B<universal-argument>, I<C-x C-r> à la fonction B<re-read-init-file> et I<ESC [ 1 1 ~> à l'insertion du texte

source: The full set of GNU Emacs style escape sequences is
fr: Le jeu complet des suites de caractères d'échappements du style GNU Emacs est

source: control prefix
fr: préfixe Contrôle

source: meta prefix
fr: préfixe Méta

source: literal "
fr: un guillemet " littéral

source: literal '
fr: une apostrophe ' littérale

source: In addition to the GNU Emacs style escape sequences, a second set of backslash escapes is available:
fr: En plus des suites de caractères d'échappement dans le style GNU Emacs, un second jeu de suites de caractères d'échappement par contre-obliques est disponible :

source: delete
fr: effacement

source: When entering the text of a macro, single or double quotes must be used to indicate a macro definition. Unquoted text is assumed to be a function name. In the macro body, the backslash escapes described above are expanded. Backslash will quote any other character in the macro text, including " and '.
fr: Lorsqu'on saisit le texte d'une macro, il faut utiliser des apostrophes ou des guillemets doubles pour indiquer la définition de la macro. Les textes non protégés sont considérés comme des noms de fonctions. Dans le corps de la macro, les protections par contre-oblique décrites plus haut sont développées. La contre-oblique protégera n'importe quel autre caractère dans le texte de la macro, y compris " et '.

source: B<Bash> allows the current readline key bindings to be displayed or modified with the B<bind> builtin command. The editing mode may be switched during interactive use by using the B<-o> option to the B<set> builtin command (see E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: B<Bash> permet d'afficher ou de modifier les raccourcis clavier readline avec la commande interne B<bind>. On peut basculer d'un mode d'édition à l'autre en mode interactif en utilisant l'option B<-o> de la commande interne B<set> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: Readline Variables
fr: Variables de readline

source: Readline has variables that can be used to further customize its behavior. A variable may be set in the I<inputrc> file with a statement of the form
fr: Readline dispose de variables permettant de personnaliser encore plus son comportement. Une variable peut être mise dans le fichier I<inputrc> avec une affectation de la forme

source: B<set> I<variable-name> I<value>
fr: B<set> I<nom_de_variable> I<valeur>

source: Except where noted, readline variables can take the values B<On> or B<Off> (without regard to case). Unrecognized variable names are ignored. When a variable value is read, empty or null values, "on" (case-insensitive), and "1" are equivalent to B<On>. All other values are equivalent to B<Off>. The variables and their default values are:
fr: Sauf indication contraire, les variables de readline prennent les valeurs B<On> ou B<Off> (la casse étant sans importance). Les noms de variables non reconnues sont ignorés. Lorsqu'une valeur de variable est lue, les variables vides ou de valeur nulle, « on » (insensible à la casse) et « 1 » sont équivalent à B<On>. Toutes les autres valeurs sont équivalentes à B<Off>. Les variables et leurs valeurs par défaut, sont :

source: Controls what happens when readline wants to ring the terminal bell. If set to B<none>, readline never rings the bell. If set to B<visible>, readline uses a visible bell if one is available. If set to B<audible>, readline attempts to ring the terminal's bell.
fr: Cette variable commande readline lorsqu'il faut déclencher l'alarme du terminal. Si mise à B<none>, readline n'émet jamais d'alarme. Si mise à B<visible>, readline utilise une alarme visuelle s'il en est une de disponible. Si mise à B<audible>, readline essaie de faire sonner l'alarme du terminal.

source: If set to B<On>, readline attempts to bind the control characters treated specially by the kernel's terminal driver to their readline equivalents.
fr: Si mise à B<On>, readline tente d'associer les caractères de contrôle traités spécialement par le pilote de terminal du noyau à leurs équivalents readline.

source: The string that is inserted when the readline B<insert-comment> command is executed. This command is bound to B<M-#> in emacs mode and to B<#> in vi command mode.
fr: Cette chaîne est insérée quand la commande readline B<insert-comment> est exécutée. Cette commande est associée à B<M-#> en mode emacs et à B<#> en mode de commande vi.

source: If set to B<On>, readline performs filename matching and completion in a case-insensitive fashion.
fr: Si mise à B<On>, readline effectue les correspondances et complètements de noms de fichiers sans tenir compte de la casse.

source: This determines when the user is queried about viewing the number of possible completions generated by the B<possible-completions> command. It may be set to any integer value greater than or equal to zero. If the number of possible completions is greater than or equal to the value of this variable, the user is asked whether or not he wishes to view them; otherwise they are simply listed on the terminal.
fr: Ceci détermine quand l'utilisateur est interrogé pour voir le nombre de complètements possibles produits par la commande B<possible-completions>. Elle peut être mise à toute valeur entière positive. Si le nombre de complètements possibles est supérieur ou égal à la valeur de cette variable, il est demandé à l'utilisateur s'il veut ou non les voir ; sinon, ils sont simplement affichés sur le terminal.

source: If set to B<On>, readline will convert characters with the eighth bit set to an ASCII key sequence by stripping the eighth bit and prefixing an escape character (in effect, using escape as the I<meta prefix>).
fr: Si mise à B<On>, readline transformera les caractères avec leur huitième bit à 1 en suite de caractères ASCII en supprimant le huitième bit et en insérant comme préfixe un caractère d'échappement (en fait, en utilisant le caractère d'échappement comme I<préfixe méta>).

source: If set to B<On>, readline will inhibit word completion. Completion characters will be inserted into the line as if they had been mapped to B<self-insert>.
fr: Si mise à B<On>, readline empêchera le complètement des mots. Les caractères de complètement seront insérés sur la ligne comme s'ils avaient été associés à B<self-insert>.

source: Controls whether readline begins with a set of key bindings similar to I<emacs> or I<vi>. B<editing-mode> can be set to either B<emacs> or B<vi>.
fr: Commande si readline doit démarrer avec des raccourcis clavier similaires à I<emacs> ou à I<vi>. B<editing-mode> peut être mis soit à B<emacs> ou soit à B<vi>.

source: When set to B<On>, readline will try to enable the application keypad when it is called. Some systems need this to enable the arrow keys.
fr: Quand mise à B<On>, readline essayera d'activer le clavier de l'application lorsqu'elle sera appelée. Sur certains systèmes, cela est nécessaire pour utiliser les flêches.

source: If set to B<on>, tilde expansion is performed when readline attempts word completion.
fr: Si mise à B<on>, le développement du tilde est effectué lorsque readline tente un complètement de commandes.

source: If set to B<on>, the history code attempts to place point at the same location on each history line retrieved with B<previous-history> or B<next-history>.
fr: Si mise à B<on>, le programme d'historique tente de placer le curseur au même endroit sur chaque ligne de l'historique avec B<previous-history> ou B<next-history>.

source: When set to B<On>, makes readline use a single line for display, scrolling the input horizontally on a single screen line when it becomes longer than the screen width rather than wrapping to a new line.
fr: Quand mise à B<On>, readline utilisera une seule ligne d'affichage et fera défiler la saisie horizontalement sur une seule ligne d'écran quand elle devient plus longue que la largeur de l'écran, plutôt que de faire un retour à la ligne.

source: If set to B<On>, readline will enable eight-bit input (that is, it will not strip the high bit from the characters it reads), regardless of what the terminal claims it can support. The name B<meta-flag> is a synonym for this variable.
fr: Si mise à B<On>, readline acceptera des saisies sur huit bits (autrement dit il ne supprimera pas le huitième bit), quel que soit le terminal utilisé. Le nom B<meta-flag> est un synonyme pour cette variable.

source: The string of characters that should terminate an incremental search without subsequently executing the character as a command. If this variable has not been given a value, the characters I<ESC> and I<C-J> will terminate an incremental search.
fr: La chaîne des caractères qui doivent terminer une recherche incrémentale sans que le caractère ne soit exécuté comme une commande. Si cette variable n'a pas reçu de valeur, les caractères I<ESC> et I<C-J> termineront une recherche incrémentale.

source: Set the current readline keymap. The set of valid keymap names is I<emacs, emacs-standard, emacs-meta, emacs-ctlx, vi, vi-command>, and I<vi-insert>. I<vi> is equivalent to I<vi-command>; I<emacs> is equivalent to I<emacs-standard>. The default value is I<emacs>; the value of B<editing-mode> also affects the default keymap.
fr: Configure le jeu de raccourcis readline courant. L'ensemble des noms corrects de jeux de raccourcis est I<emacs, emacs-standard, emacs-meta, emacs-ctlx, vi, vi-command> et I<vi-insert>. I<vi> est équivalent à I<vi-command> ; I<emacs> est équivalent à I<emacs-standard>. La valeur par défaut est I<emacs> ; la valeur de B<editing-mode> modifie aussi le jeu de raccourcis par défaut.

source: If set to B<On>, completed directory names have a slash appended.
fr: Si mise à B<On>, les noms de répertoires ont une barre oblique d'ajoutée.

source: If set to B<On>, history lines that have been modified are displayed with a preceding asterisk (B<*>).
fr: Si mise à B<On>, les lignes d'historique qui ont été modifiées seront précédées à l'affichage d'un astérisque (B<*>).

source: If set to B<On>, completed names which are symbolic links to directories have a slash appended (subject to the value of B<mark-directories>).
fr: Si mise à B<On>, les noms complétés qui sont des liens symboliques vers des répertoires ont une barre oblique d'ajoutée (selon la valeur de B<mark-directories>).

source: This variable, when set to B<On>, causes readline to match files whose names begin with a `.' (hidden files) when performing filename completion, unless the leading `.' is supplied by the user in the filename to be completed.
fr: Cette variable, quand mise à B<On>, conduit readline à faire correspondre des fichiers dont le nom commence par un « . » (fichiers cachés) lors du complètement de noms de fichiers, à moins que le « . » de tête soit fourni par l'utilisateur dans le nom de fichier à compléter.

source: If set to B<On>, readline will display characters with the eighth bit set directly rather than as a meta-prefixed escape sequence.
fr: Si mise à B<On>, readline affichera directement les caractères ayant leur huitième bit à 1, plutôt que d'utiliser une suite de caractères d'échappement avec préfixe méta.

source: If set to B<On>, readline uses an internal I<more>-like pager to display a screenful of possible completions at a time.
fr: Si mise à B<On>, readline utilise un visualisateur interne du type I<more> pour afficher un plein écran à la fois des complètements.

source: If set to B<On>, readline will display completions with matches sorted horizontally in alphabetical order, rather than down the screen.
fr: Si mise à B<On>, readline affichera les complètements correspondants triés horizontalement dans l'ordre alphabétique plutôt que verticalement.

source: This alters the default behavior of the completion functions. If set to B<on>, words which have more than one possible completion cause the matches to be listed immediately instead of ringing the bell.
fr: Ceci modifie le comportement par défaut des fonctions de complètement. Si mise à B<on>, les mots qui ont plus d'un complètement possibles conduisent à l'affichage immédiat des correspondances plutôt qu'à l'émission d'une alarme.

source: This alters the default behavior of the completion functions in a fashion similar to B<show-all-if-ambiguous>. If set to B<on>, words which have more than one possible completion without any possible partial completion (the possible completions don't share a common prefix) cause the matches to be listed immediately instead of ringing the bell.
fr: Ceci modifie le comportement par défaut des fonctions de complètement de façon similaire à B<show-all-if-ambiguous>. Si mise à B<on>, les mots qui ont plus d'un complètement possible sans aucun complètement partiel possible (les complètements possibles ne partagent pas de préfixe commun) conduisent à l'affichage immédiat des correspondances plutôt qu'à l'émission d'une alarme.

source: If set to B<On>, a character denoting a file's type as reported by I<stat>(2) is appended to the filename when listing possible completions.
fr: Si mise à B<On>, un caractère indiquant le type de fichier, comme signalé par I<stat>(2) est ajouté aux noms de fichiers en affichant les complètements possibles.

source: Readline Conditional Constructs
fr: Constructions conditionnelles de readline

source: Readline implements a facility similar in spirit to the conditional compilation features of the C preprocessor which allows key bindings and variable settings to be performed as the result of tests. There are four parser directives used.
fr: Readline implémente un mécanisme inspiré des fonctionnalités de compilation conditionnelle du pré-processeur C qui permet d'effectuer le paramétrage des raccourcis clavier et des variables selon les résultats de tests. Il y a quatre directives d'analyse utilisées.

source: The B<$if> construct allows bindings to be made based on the editing mode, the terminal being used, or the application using readline. The text of the test extends to the end of the line; no characters are required to isolate it.
fr: La structure B<$if> permet de choisir les raccourcis selon le mode d'édition, le terminal utilisé ou l'application utilisant readline. Le texte du test va jusqu'à la fin de la ligne ; aucun caractère n'est nécessaire pour le délimiter.

source: The B<mode=> form of the B<$if> directive is used to test whether readline is in emacs or vi mode. This may be used in conjunction with the B<set keymap> command, for instance, to set bindings in the I<emacs-standard> and I<emacs-ctlx> keymaps only if readline is starting out in emacs mode.
fr: La forme B<mode=> de la directive B<$if> est utilisée pour vérifier si readline est en mode emacs ou vi. Ceci peut être utilisé conjointement à la commande B<set keymap>, par exemple pour ne mettre les raccourcis des jeux de raccourcis I<emacs-standard> et I<emacs-ctlx> que si readline démarre en mode emacs.

source: The B<term=> form may be used to include terminal-specific key bindings, perhaps to bind the key sequences output by the terminal's function keys. The word on the right side of the B<=> is tested against the both full name of the terminal and the portion of the terminal name before the first B<->. This allows I<sun> to match both I<sun> and I<sun-cmd>, for instance.
fr: La forme B<term=> peut être utilisée pour ajouter des raccourcis clavier spécifiques au terminal, comme associer des suites de touches produites par des touches de fonction du terminal. Le mot à droite du signe B<=> est comparé à la fois au nom complet du terminal et à la portion de nom du terminal qui précède le premier signe B<->. Ceci permet, par exemple, de faire correspondre I<sun> avec à la fois I<sun> et I<sun-cmd>.

source: The B<application> construct is used to include application-specific settings. Each program using the readline library sets the I<application name>, and an initialization file can test for a particular value. This could be used to bind key sequences to functions useful for a specific program. For instance, the following command adds a key sequence that quotes the current or previous word in Bash:
fr: La structure B<application> est utilisée pour inclure des paramétrages spécifiques à chaque application. Chaque programme utilisant la bibliothèque readline configure un I<nom d'application> et un fichier d'initialisation peut tester une valeur particulière. Ceci peut être utilisé pour associer des suites de touches à des fonctions utiles pour un certain programme. Par exemple, les commandes suivantes ajoutent une suite de touches qui protège le mot courant ou précédant dans Bash :

source: B<$if> Bash # Quote the current or previous word "\eC-xq": "\eeb\e"\eef\e"" B<$endif>
fr: B<$if> Bash # Protéger le mot courant ou le précédant "\eC-xq": "\eeb\e"\eef\e"" B<$endif>

source: This command, as seen in the previous example, terminates an B<$if> command.
fr: Cette commande, comme on l'a vu dans l'exemple ci-dessus, termine une commande B<$if>.

source: Commands in this branch of the B<$if> directive are executed if the test fails.
fr: Permet d'ajouter des commandes qui seront exécutées si un B<$if> échoue.

source: This directive takes a single filename as an argument and reads commands and bindings from that file. For example, the following directive would read I</etc/inputrc>:
fr: Cette directive prend un seul nom de fichier comme argument et y lit les commandes et les raccourcis. Par exemple, la directive suivante lirait le fichier I</etc/inputrc> :

source: Searching
fr: Recherche

source: Readline provides commands for searching through the command history (see E<.SM> B<HISTORY> below) for lines containing a specified string. There are two search modes: I<incremental> and I<non-incremental>.
fr: Readline fournit des commandes de recherche au sein de l'historique de commandes (voir E<.SM B<HISTORIQUE>> plus bas) des lignes contenant une chaîne donnée. Il y a deux modes de recherche : I<incrémental> et I<non incrémental>.

source: Incremental searches begin before the user has finished typing the search string. As each character of the search string is typed, readline displays the next entry from the history matching the string typed so far. An incremental search requires only as many characters as needed to find the desired history entry. The characters present in the value of the B<isearch-terminators> variable are used to terminate an incremental search. If that variable has not been assigned a value the Escape and Control-J characters will terminate an incremental search. Control-G will abort an incremental search and restore the original line. When the search is terminated, the history entry containing the search string becomes the current line.
fr: Les recherches incrémentales commencent avant même que l'utilisateur ait terminé de saisir la chaîne recherchée. À chaque caractère saisi, readline affiche l'élément suivant de l'historique qui correspond à la chaîne déjà entrée. Une recherche incrémentale nécessite seulement le nombre de caractères indispensable pour retrouver l'élément d'historique désiré. Les caractères se trouvant dans la variable B<isearch-terminators> servent à terminer une recherche incrémentale. Si aucune valeur n'a été affectée à cette variable les caractères Échappement (Escape) et Contrôle-J terminent une recherche incrémentale. Contrôle-G permet d'interrompre une recherche incrémentale et de restaurer la ligne originale. Lorsque la recherche est finie, l'élément d'historique contenant la chaîne désirée devient la ligne courante.

source: To find other matching entries in the history list, type Control-S or Control-R as appropriate. This will search backward or forward in the history for the next entry matching the search string typed so far. Any other key sequence bound to a readline command will terminate the search and execute that command. For instance, a I<newline> will terminate the search and accept the line, thereby executing the command from the history list.
fr: Pour trouver les autres éléments correspondant dans la file d'historique, saisissez selon Contrôle-S ou Contrôle-R. Ceci recherchera en avant ou en arrière dans l'historique l'élément suivant correspondant à la chaîne saisie jusque-là. Toute autre suite de touches associée à une commande readline interrompra la recherche et exécutera la commande. Par exemple, un I<saut de ligne> interrompra la recherche et acceptera la ligne, exécutant ainsi la commande de la file d'historique.

source: Readline remembers the last incremental search string. If two Control-Rs are typed without any intervening characters defining a new search string, any remembered search string is used.
fr: Readline se souvient de la dernière chaîne de recherche incrémentale. Si deux Contrôle-R sont tapés sans caractère pour définir une nouvelle recherche de chaîne, toute chaîne mémorisée sera utilisée.
