Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: 2005 Dec 28
fr: 28 décembre 2005

source: NAME
fr: NOM

source: bash - GNU Bourne-Again SHell
fr: bash - Interpréteur de commandes GNU Bourne-Again SHell.

source: B<bash> [options] [file]
fr: B<bash> [options] [fichier]

source: B<Bash> is an B<sh>-compatible command language interpreter that executes commands read from the standard input or from a file. B<Bash> also incorporates useful features from the I<Korn> and I<C> shells (B<ksh> and B<csh>).
fr: B<Bash> est un interpréteur de commandes (I<shell>) compatible B<sh> qui exécute les commandes lues depuis l'entrée standard ou depuis un fichier. B<Bash> inclut aussi des fonctionnalités utiles des interpréteurs de commandes I<Korn> et I<C> (B<ksh> et B<csh>).

source: B<Bash> is intended to be a conformant implementation of the IEEE POSIX Shell and Tools specification (IEEE Working Group 1003.2). B<Bash> can be configured to be POSIX-conformant by default.
fr: B<Bash> vise à être une implémentation conforme aux spécifications IEEE sur les interpréteurs de commandes et les outils POSIX (groupe de travail de l'IEEE 1003.2). B<Bash> peut être configuré pour être conforme aux spécifications POSIX par défaut.

source: In addition to the single-character shell options documented in the description of the B<set> builtin command, B<bash> interprets the following options when it is invoked:
fr: En plus des options d'interpréteur monocaractères documentées dans la description de la commande interne B<set>, B<bash> accepte les options suivantes lors de son appel :

source: B<-c>I<\| string\^>
fr: B<-c>I<\| chaîne\^>

source: If the B<-c> option is present, then commands are read from I<string>. If there are arguments after the I<string>, they are assigned to the positional parameters, starting with B<$0>.
fr: Si l'option B<-c> est présente, les commandes sont lues depuis la I<chaîne> fournie. S'il y a des arguments après la I<chaîne>, ils sont affectés aux paramètres positionnels, en commençant par B<$0>.

source: If the B<-i> option is present, the shell is I<interactive>.
fr: Si l'option B<-i> est présente, l'interpréteur est I<interactif>.

source: Make B<bash> act as if it had been invoked as a login shell (see E<.SM> B<INVOCATION> below).
fr: Faire que B<bash> se comporte comme s'il avait été appelé comme interpréteur de commandes de connexion (voir E<.SM B<APPEL>> plus bas).

source: If the B<-r> option is present, the shell becomes I<restricted> (see E<.SM> B<RESTRICTED SHELL> below).
fr: Si l'option B<-r> est présente, l'interpréteur devient I<restreint> (voir E<.SM B<INTERPRÉTEUR RESTREINT>> plus bas).

source: If the B<-s> option is present, or if no arguments remain after option processing, then commands are read from the standard input. This option allows the positional parameters to be set when invoking an interactive shell.
fr: Si l'option B<-s> est présente ou s'il ne reste plus d'argument après le traitement des options, alors les commandes sont lues depuis l'entrée standard. Cette option permet d'affecter les paramètres positionnels tout en appelant un interpréteur interactif.

source: A list of all double-quoted strings preceded by B<$> is printed on the standard output. These are the strings that are subject to language translation when the current locale is not B<C> or B<POSIX>. This implies the B<-n> option; no commands will be executed.
fr: Une liste de toutes les chaînes entre guillemets doubles précédées de B<$> est affichée sur la sortie standard. Ce sont les chaînes qui sont sujettes à une traduction quand le paramètre linguistique régional n'est ni B<C> ni B<POSIX>. Cela implique l'option B<-n> ; aucune commande ne sera exécutée.

source: B<[-+]O [>I<shopt_option>B<]>
fr: B<[-+]O [>I<option_shopt>B<]>

source: I<shopt_option> is one of the shell options accepted by the B<shopt> builtin (see E<.SM> B<SHELL BUILTIN COMMANDS> below). If I<shopt_option> is present, B<-O> sets the value of that option; B<+O> unsets it. If I<shopt_option> is not supplied, the names and values of the shell options accepted by B<shopt> are printed on the standard output. If the invocation option is B<+O>, the output is displayed in a format that may be reused as input.
fr: I<option_shopt> est une des options de l'interpréteur acceptées par la commande interne B<shopt> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). Si I<option_shopt> est présente, B<-O> crée cette option ; B<+O> la détruit. Si I<option_shopt> n'est pas fournie, les noms et valeurs des options de l'interpréteur acceptées par B<shopt> sont affichés sur la sortie standard. Si l'option d'appel est B<+O>, la sortie est affichée dans un format réutilisable en entrée.

source: A B<--> signals the end of options and disables further option processing. Any arguments after the B<--> are treated as filenames and arguments. An argument of B<-> is equivalent to B<-->.
fr: Deux caractères B<--> indiquent la fin des options et désactivent le traitement des arguments. Tous les arguments après le B<--> sont traités comme des noms de fichiers et paramètres. B<-> est équivalent à B<-->.

source: B<Bash> also interprets a number of multi-character options. These options must appear on the command line before the single-character options to be recognized.
fr: B<Bash> reconnaît également plusieurs options multicaractères. Ces options doivent, pour être reconnues, apparaître sur la ligne de commande avant les options monocaractères.

source: Arrange for the debugger profile to be executed before the shell starts. Turns on extended debugging mode (see the description of the B<extdebug> option to the B<shopt> builtin below) and shell function tracing (see the description of the B<-o functrace> option to the B<set> builtin below).
fr: Prend les dispositions pour que le paramétrage du traçage soit exécuté avant que l'interpréteur démarre. Enclenche le mode de traçage étendu (voir plus bas la description de l'option B<extdebug> de la commande interne B<shopt>) et le traçage des fonctions de l'interpréteur (voir plus bas la description de l'option B<-o functrace> de la commande interne B<set>).

source: Equivalent to B<-D>, but the output is in the GNU I<gettext> B<po> (portable object) file format.
fr: Équivalent à B<-D>, mais la sortie est dans le format des fichiers B<po> (objets portables) de l'outil GNU I<gettext>.

source: Equivalent to B<-D>.
fr: Équivalent à B<-D>.

source: Display a usage message on standard output and exit successfully.
fr: Affiche un message d'aide sur la sortie standard et termine avec succès.

source: B<--init-file> I<file>
fr: B<--init-file> I<fichier>

source: B<--rcfile> I<file>
fr: B<--rcfile> I<fichier>

source: Execute commands from I<file> instead of the system wide initialization file I</etc/bash.bashrc> and the standard personal initialization file I<~/.bashrc> if the shell is interactive (see E<.SM> B<INVOCATION> below).
fr: Exécuter les commandes contenues dans I<fichier> plutôt que celles du fichier d'initialisation commun à tout le système I</etc/bash.bashrc> et que le fichier d'initialisation personnel standard I<~/.bashrc> si l'interpréteur est interactif (voir E<.SM B<APPEL>> plus bas).

source: Equivalent to B<-l>.
fr: Équivalent à B<-l>.

source: Do not use the GNU B<readline> library to read command lines when the shell is interactive.
fr: Ne pas utiliser la bibliothèque GNU B<readline> pour lire les lignes de commande, lorsque l'interpréteur est interactif.

source: Do not read either the system-wide startup file E<.FN /etc/profile> or any of the personal initialization files I<~/.bash_profile>, I<~/.bash_login>, or I<~/.profile>. By default, B<bash> reads these files when it is invoked as a login shell (see E<.SM> B<INVOCATION> below).
fr: Ne lire ni le fichier de configuration générale E<.FN /etc/profile> ni les fichiers d'initialisation personnels I<~/.bash_profile>, I<~/.bash_login>, ni I<~/.profile>. Par défaut, B<bash> lit ces fichiers lorsqu'il est appelé comme interpréteur de commandes de connexion (voir E<.SM B<APPEL>> plus bas).

source: Do not read and execute the system wide initialization file I</etc/bash.bashrc> and the personal initialization file I<~/.bashrc> if the shell is interactive. This option is on by default if the shell is invoked as B<sh>.
fr: Ne pas lire ni exécuter le fichier de configuration commun à tout le système I</etc/bash.bashrc> ni le fichier personnel d'initialisation I<~/.bashrc> lorsque l'interpréteur est interactif. Cette option est activée par défaut si l'interpréteur est appelé sous le nom B<sh>.

source: Change the behavior of B<bash> where the default operation differs from the POSIX 1003.2 standard to match the standard (I<posix mode>).
fr: Aligner le comportement de B<bash> sur le standard POSIX 1003.2, en ce qui concerne les options dont l'action par défaut diffère de ce standard (I<mode posix>).

source: The shell becomes restricted (see E<.SM> B<RESTRICTED SHELL> below).
fr: L'interpréteur devient restreint (voir E<.SM B<INTERPRÉTEUR RESTREINT>> plus bas).

source: Equivalent to B<-v>.
fr: Équivalent à B<-v>.

source: Show version information for this instance of B<bash> on the standard output and exit successfully.
fr: Affiche le numéro de version de B<bash> sur la sortie standard et termine avec succès.

source: If arguments remain after option processing, and neither the B<-c> nor the B<-s> option has been supplied, the first argument is assumed to be the name of a file containing shell commands. If B<bash> is invoked in this fashion, B<$0> is set to the name of the file, and the positional parameters are set to the remaining arguments. B<Bash> reads and executes commands from this file, then exits. B<Bash>'s exit status is the exit status of the last command executed in the script. If no commands are executed, the exit status is 0. An attempt is first made to open the file in the current directory, and, if no file is found, then the shell searches the directories in E<.SM> B<PATH> for the script.
fr: S'il reste des arguments sur la ligne de commande après traitement des options et que ni l'option B<-c>, ni l'option B<-s> n'ont été fournies, le premier argument est supposé être le nom du fichier dans lequel lire les commandes d'interpréteur. Si B<bash> est appelé de cette façon, le nom du ficher est affecté à B<$0> et les arguments restants aux autres paramètres positionnels. B<Bash> lit et exécute les commandes depuis ce fichier, puis termine. L'état final de B<bash> est l'état final de la dernière commande exécutée dans le script. Si aucune commande n'a été exécutée, l'état final est 0. Une tentative est d'abord faite de trouver le fichier dans le répertoire courant et, si aucun fichier n'est trouvé, l'interpréteur cherche le script dans les répertoires contenus dans E<.SM B<PATH>.>

source: INVOCATION
fr: APPEL

source: A I<login shell> is one whose first character of argument zero is a B<->, or one started with the B<--login> option.
fr: Un interpréteur de commandes est dit I<de connexion> (I<login shell>) si le premier caractère de son argument numéro zéro est un B<-> ou s'il est appelé avec l'option B<--login>.

source: An I<interactive> shell is one started without non-option arguments and without the B<-c> option whose standard input and error are both connected to terminals (as determined by I<isatty>(3)), or one started with the B<-i> option. E<.SM> B<PS1> is set and B<$-> includes B<i> if B<bash> is interactive, allowing a shell script or a startup file to test this state.
fr: Un interpréteur est I<interactif> s'il est appelé sans argument autre que des options et sans l'option B<-c>, dont l'entrée standard et sa sortie d'erreur sont toutes deux connectées à des terminaux (comme déterminé par la fonction I<isatty>(3)) ou s'il est appelé avec l'option B<-i>. E<.SM B<PS1>> est créée et B<$-> contient la lettre B<i> si B<bash> est interactif, ce qui permet à un script ou à un fichier de démarrage de tester cet état.

source: The following paragraphs describe how B<bash> executes its startup files. If any of the files exist but cannot be read, B<bash> reports an error. Tildes are expanded in file names as described below under B<Tilde Expansion> in the E<.SM> B<EXPANSION> section.
fr: Le paragraphe suivant décrit comment B<bash> exécute ses fichiers d'initialisation. Si l'un de ces fichiers existe mais n'est pas accessible en lecture, B<bash> signale une erreur. Les tildes sont remplacés par des noms de fichiers comme décrit plus bas dans B<Développement du tilde> dans le paragraphe E<.SM B<DÉVELOPPEMENTS>.>

source: When B<bash> is invoked as an interactive login shell, or as a non-interactive shell with the B<--login> option, it first reads and executes commands from the file I</etc/profile>, if that file exists. After reading that file, it looks for I<~/.bash_profile>, I<~/.bash_login>, and I<~/.profile>, in that order, and reads and executes commands from the first one that exists and is readable. The B<--noprofile> option may be used when the shell is started to inhibit this behavior.
fr: Lorsque B<bash> est lancé comme interpréteur de commandes de connexion interactif ou comme interpréteur non interactif avec l'option B<--login>, il lit et exécute tout d'abord les commandes se trouvant dans le fichier I</etc/profile> si ce fichier existe. Après lecture de ce fichier, il recherche I<~/.bash_profile>, I<~/.bash_login> et I<~/.profile>, dans cet ordre, puis lit et exécute les commandes se trouvant dans le premier fichier existant et accessible en lecture. L'option B<--noprofile> peut être utilisée à l'appel de l'interpréteur pour empêcher ce comportement.

source: When a login shell exits, B<bash> reads and executes commands from the file I<~/.bash_logout>, if it exists.
fr: Lorsqu'un interpréteur de commandes de connexion termine, B<bash> lit et exécute les commandes du fichier I<~/.bash_logout>, s'il existe.

source: When an interactive shell that is not a login shell is started, B<bash> reads and executes commands from I</etc/bash.bashrc> and I<~/.bashrc>, if these files exist. This may be inhibited by using the B<--norc> option. The B<--rcfile> I<file> option will force B<bash> to read and execute commands from I<file> instead of I</etc/bash.bashrc> and I<~/.bashrc>.
fr: Quand un interpréteur interactif démarre sans être un interpréteur de commandes de connexion, B<bash> lit et exécute les commandes se trouvant dans I</etc/bash.bashrc> et I<~/.bashrc> s'ils existent. Ce comportement peut être empêché à l'aide de l'option B<--norc>. L'option B<--rcfile> I<fichier> forcera B<bash> à lire et exécuter les commandes dans I<fichier> plutôt que dans I</etc/bash.bashrc> et I<~/.bashrc>.

source: When B<bash> is started non-interactively, to run a shell script, for example, it looks for the variable E<.SM> B<BASH_ENV> in the environment, expands its value if it appears there, and uses the expanded value as the name of a file to read and execute. B<Bash> behaves as if the following command were executed:
fr: Quand B<bash> est démarré de façon non interactive, par exemple pour lancer un script, il consulte la variable E<.SM B<BASH_ENV>> dans l'environnement, développe son contenu si elle existe et considère cette valeur comme le nom d'un fichier à lire et exécuter. B<Bash> se comporte comme si la commande suivante était exécutée :

source: but the value of the E<.SM> B<PATH> variable is not used to search for the file name.
fr: mais la valeur de la variable E<.SM B<PATH>> n'est pas utilisée pour rechercher le fichier.

source: If B<bash> is invoked with the name B<sh>, it tries to mimic the startup behavior of historical versions of B<sh> as closely as possible, while conforming to the POSIX standard as well. When invoked as an interactive login shell, or a non-interactive shell with the B<--login> option, it first attempts to read and execute commands from I</etc/profile> and I<~/.profile>, in that order. The B<--noprofile> option may be used to inhibit this behavior. When invoked as an interactive shell with the name B<sh>, B<bash> looks for the variable E<.SM> B<ENV>, expands its value if it is defined, and uses the expanded value as the name of a file to read and execute. Since a shell invoked as B<sh> does not attempt to read and execute commands from any other startup files, the B<--rcfile> option has no effect. A non-interactive shell invoked with the name B<sh> does not attempt to read any other startup files. When invoked as B<sh>, B<bash> enters I<posix> mode after the startup files are read.
fr: Si B<bash> est appelé sous le nom B<sh>, il essaye d'imiter le comportement de démarrage des versions historiques de B<sh> aussi fidèlement que possible, tout en restant conforme aux spécifications POSIX. Lorsqu'il est appelé comme interpréteur de commandes de connexion interactif ou non interactif avec l'option B<--login>, il essaye d'abord de lire et exécuter, dans cet ordre, les commandes de I</etc/profile> puis de I<~/.profile>. L'option B<--noprofile> peut être utilisée pour empêcher ce comportement. Quand il est appelé en tant qu'interpréteur interactif sous le nom B<sh>, B<bash> consulte la variable E<.SM B<ENV>,> développe sa valeur si elle est définie et utilise le résultat en tant que nom de fichier à lire et exécuter. Comme un interpréteur appelé sous le nom B<sh> n'essaye pas de lire et d'exécuter d'autre fichier de démarrage, l'option B<--rcfile> n'a aucun effet. Un interpréteur non interactif appelé sous le nom B<sh> n'essaie de lire aucun autre fichier d'initialisation. Quand il est appelé sous le nom B<sh>, B<bash> entre en mode I<posix> après avoir lu les fichiers d'initialisation.

source: When B<bash> is started in I<posix> mode, as with the B<--posix> command line option, it follows the POSIX standard for startup files. In this mode, interactive shells expand the E<.SM> B<ENV> variable and commands are read and executed from the file whose name is the expanded value. No other startup files are read.
fr: Quand B<bash> est appelé en mode I<posix> comme avec l'option B<--posix> sur la ligne de commande, il suit le standard POSIX pour les fichiers de démarrage. Dans ce mode, les interpréteurs interactifs développent la variable E<.SM B<ENV>> et les commandes sont lues et exécutées à partir du fichier dont le nom est la valeur développée. Aucun autre fichier d'initialisation n'est lu.

source: B<Bash> attempts to determine when it is being run by the remote shell daemon, usually I<rshd>. If B<bash> determines it is being run by I<rshd>, it reads and executes commands from I</etc/bash.bashrc> and I<~/.bashrc>, if these files exist and are readable. It will not do this if invoked as B<sh>. The B<--norc> option may be used to inhibit this behavior, and the B<--rcfile> option may be used to force another file to be read, but I<rshd> does not generally invoke the shell with those options or allow them to be specified.
fr: B<Bash> tente de déterminer s'il est exécuté par le démon lançant les interpréteurs de commandes distants, généralement I<rshd>. Si B<bash> conclut qu'il est exécuté par I<rshd>, il lit et exécute les commandes de I</etc/bash.bashrc> et I<~/.bashrc> si ces fichiers existent et sont lisibles. Il n'a pas ce comportement lorsqu'il est appelé sous le nom B<sh>. L'option B<--norc> peut être utilisée pour empêcher ce comportement et l'option B<--rcfile> peut être utilisée pour forcer la lecture d'un autre fichier, mais I<rshd> n'appelle généralement pas l'interpréteur avec ces options ni ne permet de les spécifier.

source: If the shell is started with the effective user (group) id not equal to the real user (group) id, and the B<-p> option is not supplied, no startup files are read, shell functions are not inherited from the environment, the E<.SM> B<SHELLOPTS> variable, if it appears in the environment, is ignored, and the effective user id is set to the real user id. If the B<-p> option is supplied at invocation, the startup behavior is the same, but the effective user id is not reset.
fr: Si l'interpréteur est lancé avec un identifiant (de groupe) d'utilisateur effectif différent de l'identifiant (de groupe) d'utilisateur réel et si l'option B<-p> n'est pas fournie, aucun fichier d'initialisation n'est lu, les fonctions de l'interpréteur ne sont pas importées depuis l'environnement, la variable E<.SM B<SHELLOPTS>,> si présente dans l'environnement, est ignorée et l'identifiant de l'utilisateur effectif est mis à celui de l'utilisateur réel. Si l'option B<-p> est fournie à l'appel, le comportement au démarrage est le même mais l'identifiant d'utilisateur effectif n'est pas modifié.

source: DEFINITIONS
fr: DÉFINITIONS

source: The following definitions are used throughout the rest of this document.
fr: Les définitions suivantes sont utilisées dans toute la suite ce document.

source: B<blank>
fr: B<blanc>

source: A space or tab.
fr: Une espace ou une tabulation.

source: B<word>
fr: B<mot>

source: A sequence of characters considered as a single unit by the shell. Also known as a B<token>.
fr: Une suite de caractères considérée comme une unité élémentaire par l'interpréteur. On parle également de B<lexème> (token).

source: B<name>
fr: B<nom>

source: A I<word> consisting only of alphanumeric characters and underscores, and beginning with an alphabetic character or an underscore. Also referred to as an B<identifier>.
fr: Un I<mot> ne contenant que des caractères alphanumériques ou le soulignement (underscore), commençant par une lettre ou un soulignement. On s'y réfère également sous le terme B<identificateur>.

source: B<metacharacter>
fr: B<métacaractère>

source: A character that, when unquoted, separates words. One of the following:
fr: Un caractère qui, non protégé, sépare les mots. Un de ceux-ci :

source: B<control operator>
fr: B<opérateur de contrôle>

source: A I<token> that performs a control function. It is one of the following symbols:
fr: Un I<lexème> ayant une fonction de contrôle. C'est l'un des symboles suivants :

source: RESERVED WORDS
fr: MOTS RÉSERVÉS

source: I<Reserved words> are words that have a special meaning to the shell. The following words are recognized as reserved when unquoted and either the first word of a simple command (see E<.SM> B<SHELL GRAMMAR> below) or the third word of a B<case> or B<for> command:
fr: Les I<mots réservés> sont des mots qui ont une signification spéciale pour l'interpréteur. Les mots suivants sont reconnus comme réservés lorsqu'ils ne sont pas protégés et sont soit le premier mot d'une commande simple (voir plus bas E<.SM B<GRAMMAIRE DE L'INTERPRÉTEUR>>) soit le troisième mot d'une commande B<case> ou B<for> :

source: SHELL GRAMMAR
fr: GRAMMAIRE DE L'INTERPRÉTEUR

source: Simple Commands
fr: Commandes simples

source: A I<simple command> is a sequence of optional variable assignments followed by B<blank>-separated words and redirections, and terminated by a I<control operator>. The first word specifies the command to be executed, and is passed as argument zero. The remaining words are passed as arguments to the invoked command.
fr: Une I<commande simple> est une suite d'affectations facultatives de variables, suivie de mots séparés par des I<blancs> et de redirections, et terminée par un I<opérateur de contrôle>. Le premier mot spécifie la commande à exécuter et est passé comme argument zéro. Les mots restants sont transmis comme arguments à la commande appelée.

source: The return value of a I<simple command> is its exit status, or 128+I<n\^> if the command is terminated by signal I<n>.
fr: La valeur renvoyée par une I<commande simple> est son état final ou 128+I<n\^> si la commande a été terminée par le signal I<n>.

source: Pipelines
fr: Conduites
