Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: B<Bash> provides one-dimensional array variables. Any variable may be used as an array; the B<declare> builtin will explicitly declare an array. There is no maximum limit on the size of an array, nor any requirement that members be indexed or assigned contiguously. Arrays are indexed using integers and are zero-based.
fr: B<Bash> fournit des variables tableaux à une dimension. N'importe quelle variable peut être utilisée comme tableau ; la commande interne B<declare> peut servir à déclarer explicitement un tableau. Il n'y a pas de limitation maximum à la taille d'un tableau, ni d'obligation que les éléments soient indicés ou affectés de façon contiguë. Les tableaux sont indicés par des entiers en commençant à zéro.

source: An array is created automatically if any variable is assigned to using the syntax I<name>[I<subscript>]=I<value>. The I<subscript> is treated as an arithmetic expression that must evaluate to a number greater than or equal to zero. To explicitly declare an array, use B<declare -a >I<name> (see E<.SM> B<SHELL BUILTIN COMMANDS> below). B<declare -a >I<name>B<[>I<subscript>B<]> is also accepted; the I<subscript> is ignored. Attributes may be specified for an array variable using the B<declare> and B<readonly> builtins. Each attribute applies to all members of an array.
fr: Un tableau est créé automatiquement si une variable est affectée en utilisant la syntaxe I<nom>[I<indice>]=I<valeur>. L'I<indice> est traité comme une expression arithmétique et s'évalue en un nombre positif. Pour déclarer explicitement un tableau, on utilise B<declare -a >I<nom> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). B<declare -a >I<nom>B<[>I<indice>B<]> est aussi accepté ; l'I<indice> est ignoré. Des attributs peuvent être spécifiés pour une variable tableau en utilisant les commandes internes B<declare> et B<readonly>. Les attributs s'appliquent à tous les éléments d'un tableau.

source: Arrays are assigned to using compound assignments of the form I<name>=B<(>valueI<1> ... valueI<n>B<)>, where each I<value> is of the form [I<subscript>]=I<string>. Only I<string> is required. If the optional brackets and subscript are supplied, that index is assigned to; otherwise the index of the element assigned is the last index assigned to by the statement plus one. Indexing starts at zero. This syntax is also accepted by the B<declare> builtin. Individual array elements may be assigned to using the I<name>[I<subscript>]=I<value> syntax introduced above.
fr: Les tableaux sont affectés en utilisant l'affectation composée de la forme I<nom>=B<(>valeur_I<1> ... valeur_I<n>B<)>, où chaque I<valeur> est de la forme [I<indice>]=I<chaîne>. Seule la I<chaîne> est obligatoire. Si les crochets et les indices facultatifs sont fournis, les affectations ont lieu en conséquence ; sinon l'indice de l'élément affecté est le dernier indice affecté plus un. Les indices commencent à zéro. Cette syntaxe est aussi acceptée par la commande interne B<declare>. Les éléments individuels du tableau sont affectés en utilisant la syntaxe I<nom>[I<indice>]=I<valeur> présentée plus haut.

source: Any element of an array may be referenced using ${I<name>[I<subscript>]}. The braces are required to avoid conflicts with pathname expansion. If I<subscript> is B<@> or B<*>, the word expands to all members of I<name>. These subscripts differ only when the word appears within double quotes. If the word is double-quoted, ${I<name>[*]} expands to a single word with the value of each array member separated by the first character of the E<.SM> B<IFS> special variable, and ${I<name>[@]} expands each element of I<name> to a separate word. When there are no array members, ${I<name>[@]} expands to nothing. If the double-quoted expansion occurs within a word, the expansion of the first parameter is joined with the beginning part of the original word, and the expansion of the last parameter is joined with the last part of the original word. This is analogous to the expansion of the special parameters B<*> and B<@> (see B<Special Parameters> above). ${#I<name>[I<subscript>]} expands to the length of ${I<name>[I<subscript>]}. If I<subscript> is B<*> or B<@>, the expansion is the number of elements in the array. Referencing an array variable without a subscript is equivalent to referencing element zero.
fr: On peut accéder à chaque élément d'un tableau en utilisant la notation ${I<nom>[I<indice>]}. Les accolades sont nécessaires pour éviter les conflits avec le développement des chemins. Si I<indice> est B<@> ou B<*>, le mot se développe en tous les éléments de I<nom>. Ces deux indices ne diffèrent que lorsque le mot apparaît entre guillemets doubles. Si le mot est entre guillemets doubles, ${I<nom>[*]} se développe en un seul mot contenant les valeurs de chaque élément du tableau séparées par le premier caractère de la variable spéciale E<.SM B<IFS>> et ${I<nom>[@]} développe chaque élément de I<nom> en un mot distinct. Quand il n'y a pas d'élément dans le tableau, ${I<nom>[@]} ne se développe en rien. Si le développement entre guillemets doubles survient à l'intérieur d'un mot, le développement du premier paramètre est accolé à la première partie du mot original et le développement du dernier paramètre est accolé à la dernière partie du mot original. Le comportement est analogue à celui des paramètres spéciaux B<*> et B<@> (voir B<Paramètres spéciaux> plus haut). ${#I<nom>[I<indice>]} s'évalue en la longueur de l'élément ${I<nom>[I<indice>]}. Si l'I<indice> est B<*> ou B<@>, s'évalue en le nombre d'éléments dans le tableau. Accéder à une variable tableau sans indice est équivalent à accéder à l'élément zéro.

source: The B<unset> builtin is used to destroy arrays. B<unset> I<name>[I<subscript>] destroys the array element at index I<subscript>. Care must be taken to avoid unwanted side effects caused by filename generation. B<unset> I<name>, where I<name> is an array, or B<unset> I<name>[I<subscript>], where I<subscript> is B<*> or B<@>, removes the entire array.
fr: La commande interne B<unset> sert à détruire les tableaux. B<unset> B<nom>[I<indice>] détruit l'élément de tableau d'indice I<indice>. Un soin particulier doit être apporté afin d'éviter des effets de bords non désirés provoqués par la production des noms de fichiers. B<unset> I<nom>, où I<nom> est un tableau, ou B<unset> I<nom>[I<indice>], avec I<indice> valant B<*> ou B<@> supprime le tableau entier.

source: The B<declare>, B<local>, and B<readonly> builtins each accept a B<-a> option to specify an array. The B<read> builtin accepts a B<-a> option to assign a list of words read from the standard input to an array. The B<set> and B<declare> builtins display array values in a way that allows them to be reused as assignments.
fr: Les commandes internes B<declare>, B<local> et B<readonly> acceptent toutes une option B<-a> pour spécifier un tableau. La commande interne B<read> accepte une option B<-a> pour affecter une liste de mots lus depuis l'entrée standard dans un tableau. Les commandes internes B<set> et B<declare> affichent les valeurs d'un tableau d'une façon qui permet de les réutiliser pour des affectations.

source: EXPANSION
fr: DÉVELOPPEMENTS

source: Expansion is performed on the command line after it has been split into words. There are seven kinds of expansion performed: I<brace expansion>, I<tilde expansion>, I<parameter and variable expansion>, I<command substitution>, I<arithmetic expansion>, I<word splitting>, and I<pathname expansion>.
fr: Les développements sont appliqués à la ligne de commande après qu'elle a été découpée en mots. Sept types de développements sont effectués : le I<développement des accolades>, le I<développement du tilde>, le I<développement des paramètres et des variables>, la I<substitution de commande>, le I<développement arithmétique>, le I<découpage en mots> et le I<développement des chemins>.

source: The order of expansions is: brace expansion, tilde expansion, parameter, variable and arithmetic expansion and command substitution (done in a left-to-right fashion), word splitting, and pathname expansion.
fr: L'ordre des développements est : développement des accolades, du tilde, des paramètres, des variables, arithmétique et substitution de commande (effectuée de la gauche vers la droite), découpage en mots et développement des chemins.

source: On systems that can support it, there is an additional expansion available: I<process substitution>.
fr: Sur les systèmes qui le supportent, un développement supplémentaire a lieu : la I<substitution de processus>.

source: Only brace expansion, word splitting, and pathname expansion can change the number of words of the expansion; other expansions expand a single word to a single word. The only exceptions to this are the expansions of "B<$@>" and "B<${>I<name>B<[@]}>" as explained above (see E<.SM> B<PARAMETERS>).
fr: Seuls le développement des accolades, le découpage en mots et le développement des chemins peuvent modifier le nombre de mots. Les autres développement transforment un mot unique en un autre mot unique. La seule exception à cette règle est le développement de « B<$@> » et « B<${>I<nom>B<[@]}> » comme expliqué plus haut (voir E<.SM B<PARAMÈTRES>>).

source: Brace Expansion
fr: Développement des accolades

source: I<Brace expansion> is a mechanism by which arbitrary strings may be generated. This mechanism is similar to I<pathname expansion>, but the filenames generated need not exist. Patterns to be brace expanded take the form of an optional I<preamble>, followed by either a series of comma-separated strings or a sequence expression between a pair of braces, followed by an optional I<postscript>. The preamble is prefixed to each string contained within the braces, and the postscript is then appended to each resulting string, expanding left to right.
fr: Le I<développement des accolades> est un mécanisme permettant de produire des chaînes quelconques. Il est similaire au I<développement des chemins>, mais les noms de fichiers produits n'existent pas nécessairement. Les motifs qui seront développés prennent la forme d'un I<préambule> facultatif, suivi par soit une série de chaînes séparées par des virgules, soit l'expression d'une série entre accolades, suivi par un I<post-scriptum> facultatif. Le préambule est inséré devant chacune des chaînes contenues entre les accolades et le post-scriptum est concaténé à la fin de chacune des chaînes résultantes, le développement se faisant de gauche à droite.

source: Brace expansions may be nested. The results of each expanded string are not sorted; left to right order is preserved. For example, aB<{>d,c,bB<}>e expands into `ade ace abe'.
fr: Plusieurs développements d'accolades peuvent être imbriqués. Les résultats de chaque développement ne sont pas triés, l'ordre de gauche à droite est conservé. Par exemple aB<{>d,c,bB<}>e se développe en « ade ace abe ».

source: A sequence expression takes the form B<{>I<x>B<..>I<y>B<}>, where I<x> and I<y> are either integers or single characters. When integers are supplied, the expression expands to each number between I<x> and I<y>, inclusive. When characters are supplied, the expression expands to each character lexicographically between I<x> and I<y>, inclusive. Note that both I<x> and I<y> must be of the same type.
fr: Une expression d'une série est de la forme B<{>I<x>B<..>I<y>B<}>, où I<x> et I<y> sont soit des entiers, soit des caractères seuls. Lorsqu'il s'agit d'entiers, l'expression est remplacée par la liste des nombres entre I<x> et I<y>, I<x> et I<y> compris. S'il s'agit de caractères, l'expression se développe en l'ensemble des caractères situés entre I<x> et I<y> d'un point de vue lexicographique. Remarquez que I<x> et I<y> doivent être du même type.

source: Brace expansion is performed before any other expansions, and any characters special to other expansions are preserved in the result. It is strictly textual. B<Bash> does not apply any syntactic interpretation to the context of the expansion or the text between the braces.
fr: le développement des accolades est effectué en premier et tous les caractères ayant une signification spéciale pour les autres développements sont conservés dans le résultat. Il s'agit d'une modification purement littérale. B<Bash> n'effectue aucune interprétation syntaxique du texte entre les accolades.

source: A correctly-formed brace expansion must contain unquoted opening and closing braces, and at least one unquoted comma or a valid sequence expression. Any incorrectly formed brace expansion is left unchanged. A B<{> or B<,> may be quoted with a backslash to prevent its being considered part of a brace expression. To avoid conflicts with parameter expansion, the string B<${> is not considered eligible for brace expansion.
fr: Un développement d'accolades correctement formé doit contenir des accolades ouvrantes et fermantes non protégées et au moins une virgule non protégée ou une expression d'une série correcte. Tout développement d'accolades incorrectement formé est laissé inchangé. Un B<{> ou un B<,> peuvent être protégés par une contre-oblique pour éviter d'être considérés comme partie d'une expression entre accolades. Pour éviter tout conflit avec le développement des paramètres, la chaîne B<${> n'est pas considérée comme éligible au développement des accolades.

source: This construct is typically used as shorthand when the common prefix of the strings to be generated is longer than in the above example:
fr: Cette construction est typiquement utilisée comme raccourci lorsque le préfixe commun aux chaînes à engendrer est plus long que dans l'exemple ci-dessus :

source: or
fr: ou

source: Brace expansion introduces a slight incompatibility with historical versions of B<sh>. B<sh> does not treat opening or closing braces specially when they appear as part of a word, and preserves them in the output. B<Bash> removes braces from words as a consequence of brace expansion. For example, a word entered to B<sh> as I<file{1,2}> appears identically in the output. The same word is output as I<file1 file2> after expansion by B<bash>. If strict compatibility with B<sh> is desired, start B<bash> with the B<+B> option or disable brace expansion with the B<+B> option to the B<set> command (see E<.SM> B<SHELL BUILTIN COMMANDS> below).
fr: Le développement des accolades induit une légère incompatibilité avec les versions historiques de B<sh>. B<sh> n'effectue aucun traitement sur les accolades ouvrantes et fermantes lorsqu'elles apparaissent dans un mot et les laisse inchangées. B<Bash> supprime les accolades dans les mots, après développement. Par exemple, si l'on fournit à B<sh> le mot I<file{1,2}>, il reste inchangé en sortie. Par contre, il est transformé en I<file1 file2> par B<bash>. Si une compatibilité stricte avec B<sh> est nécessaire, lancez B<bash> avec l'option B<+B> ou désactivez le développement des accolades avec l'option B<+B> de la commande B<set> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: Tilde Expansion
fr: Développement du Tilde

source: If a word begins with an unquoted tilde character (`B<~>'), all of the characters preceding the first unquoted slash (or all characters, if there is no unquoted slash) are considered a I<tilde-prefix>. If none of the characters in the tilde-prefix are quoted, the characters in the tilde-prefix following the tilde are treated as a possible I<login name>. If this login name is the null string, the tilde is replaced with the value of the shell parameter E<.SM> B<HOME>. If E<.SM> B<HOME> is unset, the home directory of the user executing the shell is substituted instead. Otherwise, the tilde-prefix is replaced with the home directory associated with the specified login name.
fr: Si un mot commence avec un caractère tilde (« B<~> ») non protégé, tous les caractères précédant la première barre oblique non protégée (voire tous les caractères s'il n'y a pas de barre oblique non protégée), sont considérés comme un I<préfixe tilde>. Si aucun caractère du préfixe tilde n'est protégé, les caractères suivant le tilde sont traités comme un possible I<identifiant de connexion>. Si cet identifiant de connexion est une chaîne vide, le tilde est remplacé par la valeur du paramètre d'interpréteur E<.SM B<HOME>.> Si E<.SM B<HOME>> est inexistante, le répertoire d'accueil de l'utilisateur exécutant l'interpréteur est utilisé à la place. Sinon le préfixe tilde est remplacé par le répertoire d'accueil associé à l'identifiant de connexion spécifié.

source: If the tilde-prefix is a `~+', the value of the shell variable E<.SM> B<PWD> replaces the tilde-prefix. If the tilde-prefix is a `~-', the value of the shell variable E<.SM> B<OLDPWD>, if it is set, is substituted. If the characters following the tilde in the tilde-prefix consist of a number I<N>, optionally prefixed by a `+' or a `-', the tilde-prefix is replaced with the corresponding element from the directory stack, as it would be displayed by the B<dirs> builtin invoked with the tilde-prefix as an argument. If the characters following the tilde in the tilde-prefix consist of a number without a leading `+' or `-', `+' is assumed.
fr: Si le préfixe tilde est « ~+ », la valeur de la variable de l'interpréteur E<.SM B<PWD>> le remplace. Si le préfixe tilde est « ~- », la valeur de la variable de l'interpréteur E<.SM B<OLDPWD>,> si existante, lui est substituée. Si les caractères à la suite du tilde dans le préfixe tilde représentent un nombre I<N> préfixé facultativement par un « + » ou un « - » le préfixe tilde est remplacé par l'élément correspondant de la pile de répertoires telle qu'il serait affiché par la commande interne B<dirs> appelée avec le préfixe tilde en argument. Si les caractères à la suite du tilde dans le préfixe tilde représentent un nombre sans un « + » ou « - » en tête, on suppose qu'il s'agit de « + ».

source: If the login name is invalid, or the tilde expansion fails, the word is unchanged.
fr: Si l'identifiant de connexion est incorrect ou si le développement du tilde échoue, le mot est inchangé.

source: Each variable assignment is checked for unquoted tilde-prefixes immediately following a B<:> or the first B<=>. In these cases, tilde expansion is also performed. Consequently, one may use file names with tildes in assignments to E<.SM> B<PATH>, E<.SM> B<MAILPATH>, and E<.SM> B<CDPATH>, and the shell assigns the expanded value.
fr: Chaque affectation de variable vérifie immédiatement la présence de préfixes tilde non protégés suivant un B<:> ou le premier B<=>. Dans ces cas, le développement des tildes est aussi effectué. On peut donc utiliser des noms de fichiers avec des tildes dans des affectations de E<.SM B<PATH>,> E<.SM B<MAILPATH>> et E<.SM B<CDPATH>> et l'interpréteur affectera la valeur développée.

source: Parameter Expansion
fr: Remplacement des paramètres

source: The `B<$>' character introduces parameter expansion, command substitution, or arithmetic expansion. The parameter name or symbol to be expanded may be enclosed in braces, which are optional but serve to protect the variable to be expanded from characters immediately following it which could be interpreted as part of the name.
fr: Le caractère « B<$> » permet d'introduire le développement des paramètres, la substitution de commande ou le développement arithmétique. Le nom du paramètre ou du symbole à développer peut être encadré par des accolades qui sont facultatives mais servent à éviter le développement de la variable à partir de caractères la suivant immédiatement qui pourraient être considérés comme appartenant à son nom.

source: When braces are used, the matching ending brace is the first `B<}>' not escaped by a backslash or within a quoted string, and not within an embedded arithmetic expansion, command substitution, or parameter expansion.
fr: Lorsque les accolades sont utilisées, l'accolade de fin correspondante est le premier caractère « B<}> » non protégé par une contre-oblique ni inclus dans une chaîne protégée, ni dans un développement arithmétique, une substitution de commande ou un développement des paramètres.

source: ${I<parameter>}
fr: ${I<paramètre>}

source: The value of I<parameter> is substituted. The braces are required when I<parameter> is a positional parameter with more than one digit, or when I<parameter> is followed by a character which is not to be interpreted as part of its name.
fr: est remplacé par la valeur du I<paramètre>. Les accolades sont nécessaire quand le I<paramètre> est un paramètre positionnel ayant plusieurs chiffres, ou si le I<paramètre> est suivi de caractères n'appartenant pas à son nom.

source: If the first character of I<parameter> is an exclamation point, a level of variable indirection is introduced. B<Bash> uses the value of the variable formed from the rest of I<parameter> as the name of the variable; this variable is then expanded and that value is used in the rest of the substitution, rather than the value of I<parameter> itself. This is known as I<indirect expansion>. The exceptions to this are the expansions of ${!I<prefix>*} and ${B<!>I<name>[I<@>]} described below. The exclamation point must immediately follow the left brace in order to introduce indirection.
fr: Si le premier caractère du I<paramètre> est un point d'exclamation, un niveau d'indirection de variable est introduit. B<Bash> utilise la valeur de la variable formée par le reste du I<paramètre> comme un nom de variable. Cette variable est alors développée et la valeur utilisée pour le reste de la substitution plutôt que la valeur du I<paramètre> lui-même. On appelle ce mécanisme I<le développement indirect>. Les exceptions à celui-ci sont les développements de ${!I<prefix>*} et de ${B<!>I<nom>[I<@>]} décrits plus bas. Le point d'exclamation doit immédiatement suivre l'accolade ouvrante afin d'introduire l'indirection.

source: In each of the cases below, I<word> is subject to tilde expansion, parameter expansion, command substitution, and arithmetic expansion. When not performing substring expansion, B<bash> tests for a parameter that is unset or null; omitting the colon results in a test only for a parameter that is unset.
fr: Dans chacun des cas ci-dessous, le I<mot> est soumis au développement du tilde, au développement des paramètres, à la substitution de commande et au développement arithmétique. Quand il n'effectue pas de développement de sous-chaîne, B<bash> teste si le paramètre est inexistant ou vide ; l'absence des deux-points induit un test sur la seule inexistence du paramètre.

source: ${I<parameter>B<:->I<word>}
fr: ${I<paramètre>B<:->I<mot>}

source: B<Use Default Values>. If I<parameter> is unset or null, the expansion of I<word> is substituted. Otherwise, the value of I<parameter> is substituted.
fr: B<Utilisation de valeurs par défaut>. Si le I<paramètre> est inexistant ou vide, le développement du B<mot> et substitué. Sinon, c'est la valeur du I<paramètre> qui est substituée.

source: ${I<parameter>B<:=>I<word>}
fr: ${I<paramètre>B<:=>I<mot>}

source: B<Assign Default Values>. If I<parameter> is unset or null, the expansion of I<word> is assigned to I<parameter>. The value of I<parameter> is then substituted. Positional parameters and special parameters may not be assigned to in this way.
fr: B<Affectation d'une valeur par défaut>. Si le I<paramètre> est inexistant ou vide, le développement du I<mot> lui est affecté. La valeur du I<paramètre> est alors substitué. Les paramètres positionnels et spéciaux ne peuvent pas être affectés de cette façon.

source: ${I<parameter>B<:?>I<word>}
fr: ${I<paramètre>B<:?>I<mot>}
