Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: I<string1> B<!=> I<string2>
fr: I<chaîne_1> B<!=> I<chaîne_2>

source: True if the strings are not equal.
fr: Vrai si les deux chaînes sont différentes.

source: I<string1> B<E<lt>> I<string2>
fr: I<chaîne_1> B<E<lt>> I<chaîne_2>

source: True if I<string1> sorts before I<string2> lexicographically in the current locale.
fr: Vrai si I<chaîne_1> se trouve avant I<chaîne_2> dans l'ordre lexicographique des paramètres linguistiques régionaux courants.

source: I<string1> B<E<gt>> I<string2>
fr: I<chaîne_1> B<E<gt>> I<chaîne_2>

source: True if I<string1> sorts after I<string2> lexicographically in the current locale.
fr: Vrai si I<chaîne_1> se trouve après I<chaîne_2> dans l'ordre lexicographique des paramètres linguistiques régionaux courants.

source: E<.SM> B<OP> is one of B<-eq>, B<-ne>, B<-lt>, B<-le>, B<-gt>, or B<-ge>. These arithmetic binary operators return true if I<arg1> is equal to, not equal to, less than, less than or equal to, greater than, or greater than or equal to I<arg2>, respectively. I<Arg1> and I<arg2> may be positive or negative integers.
fr: E<.SM B<OP>> est l'un des opérateurs suivants B<-eq>, B<-ne>, B<-lt>, B<-le>, B<-gt> ou B<-ge>. Ces opérateurs arithmétiques binaires renvoient vrai si I<arg1> est respectivement égal, différent, inférieur, inférieur ou égal, supérieur, supérieur ou égal à I<arg2>. I<arg1> et I<arg2> peuvent être des entiers positifs ou négatifs.

source: SIMPLE COMMAND EXPANSION
fr: DÉVELOPPEMENT DES COMMANDES SIMPLES

source: When a simple command is executed, the shell performs the following expansions, assignments, and redirections, from left to right.
fr: Lors de l'exécution d'une commande simple, l'interpréteur effectue les développements, affectations et redirections suivants de gauche à droite.

source: The words that the parser has marked as variable assignments (those preceding the command name) and redirections are saved for later processing.
fr: Les mots que l'analyseur a repéré comme affectations de variables (ceux qui précèdent le nom de la commande) et les redirections sont conservées pour un traitement ultérieur.

source: The words that are not variable assignments or redirections are expanded. If any words remain after expansion, the first word is taken to be the name of the command and the remaining words are the arguments.
fr: Les mots qui ne sont ni des affectations de variables ni des redirections sont développés. S'il reste des mots après le développement, le premier mot est considéré comme le nom d'une commande et les suivants comme ses arguments.

source: Redirections are performed as described above under E<.SM> B<REDIRECTION>.
fr: Les redirections sont effectuées comme décrit plus haut dans E<.SM B<REDIRECTION>.>

source: The text after the B<=> in each variable assignment undergoes tilde expansion, parameter expansion, command substitution, arithmetic expansion, and quote removal before being assigned to the variable.
fr: Le texte suivant le B<=> dans chaque affectation de variable est sujet au développement du tilde, des paramètres, à la substitution de commande, au développement arithmétique et à la suppression des protections avant d'être affecté à la variable.

source: If no command name results, the variable assignments affect the current shell environment. Otherwise, the variables are added to the environment of the executed command and do not affect the current shell environment. If any of the assignments attempts to assign a value to a readonly variable, an error occurs, and the command exits with a non-zero status.
fr: Si aucun nom de commande ne résulte des précédentes opérations, les affectations de variables modifient l'environnement courant de l'interpréteur. Sinon les variables sont ajoutées à l'environnement de la commande exécutée et n'affectent pas l'environnement de l'interpréteur courant. Si l'une des tentatives d'affectation concerne une variable en lecture seule, une erreur se produit et la commande termine avec un état différent de zéro.

source: If no command name results, redirections are performed, but do not affect the current shell environment. A redirection error causes the command to exit with a non-zero status.
fr: Si aucun nom de commande n'est obtenu, les redirections sont effectuées mais ne modifient pas l'environnement de l'interpréteur courant. Une erreur de redirection conduit à la terminaison de la commande avec un état différent de zéro.

source: If there is a command name left after expansion, execution proceeds as described below. Otherwise, the command exits. If one of the expansions contained a command substitution, the exit status of the command is the exit status of the last command substitution performed. If there were no command substitutions, the command exits with a status of zero.
fr: S'il reste un nom de commande après le développement, l'exécution a lieu comme décrit plus bas. Sinon la commande termine. Si l'un des développements contient une substitution de commande, l'état final de la commande est l'état final de la dernière substitution de commande effectuée. S'il n'y avait aucune substitution de commande, la commande termine avec un état de zéro.

source: COMMAND EXECUTION
fr: EXÉCUTION DES COMMANDES

source: After a command has been split into words, if it results in a simple command and an optional list of arguments, the following actions are taken.
fr: Après le découpage de la ligne de commande en mots, si le résultat est une commande simple suivie d'une liste facultative d'arguments, les actions suivantes sont effectuées.

source: If the command name contains no slashes, the shell attempts to locate it. If there exists a shell function by that name, that function is invoked as described above in E<.SM> B<FUNCTIONS>. If the name does not match a function, the shell searches for it in the list of shell builtins. If a match is found, that builtin is invoked.
fr: Si le nom de la commande ne contient aucune barre oblique, l'interpréteur tente de la localiser. S'il existe une fonction de l'interpréteur de ce nom, elle est appelée comme nous l'avons vu plus haut dans E<.SM B<FONCTIONS>.> Si le nom n'est pas celui d'une fonction, l'interpréteur le recherche dans la liste des commandes internes. Si une correspondance est trouvée, cette commande interne est appelée.

source: If the name is neither a shell function nor a builtin, and contains no slashes, B<bash> searches each element of the E<.SM> B<PATH> for a directory containing an executable file by that name. B<Bash> uses a hash table to remember the full pathnames of executable files (see B<hash> under E<.SM> B<SHELL BUILTIN COMMANDS> below). A full search of the directories in E<.SM> B<PATH> is performed only if the command is not found in the hash table. If the search is unsuccessful, the shell prints an error message and returns an exit status of 127.
fr: Si le nom n'est ni celui d'une fonction de l'interpréteur, ni celui d'une commande interne et s'il ne contient pas de barre oblique, B<bash> va chercher dans chacun des éléments de E<.SM B<PATH>> un répertoire contenant un fichier exécutable du nom désiré. B<Bash> utilise une table de hachage pour mémoriser les chemins d'accès complets aux fichiers exécutables (voir plus bas la commande B<hash> dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>). Une recherche complète dans les répertoires du E<.SM B<PATH>> n'est effectuée que si la commande ne se trouve pas dans la table de hachage. Si la recherche est infructueuse, l'interpréteur affiche un message d'erreur et renvoie un état final de 127.

source: If the search is successful, or if the command name contains one or more slashes, the shell executes the named program in a separate execution environment. Argument 0 is set to the name given, and the remaining arguments to the command are set to the arguments given, if any.
fr: Si la recherche réussit ou si le nom de la commande contient une ou plusieurs barres obliques, l'interpréteur exécute le programme demandé dans un environnement d'exécution distinct. L'argument 0 est mis au nom indiqué et les éventuels arguments restants de la commande sont mis aux arguments indiqués.

source: If this execution fails because the file is not in executable format, and the file is not a directory, it is assumed to be a I<shell script>, a file containing shell commands. A subshell is spawned to execute it. This subshell reinitializes itself, so that the effect is as if a new shell had been invoked to handle the script, with the exception that the locations of commands remembered by the parent (see B<hash> below under E<.SM> B<SHELL BUILTIN COMMANDS>) are retained by the child.
fr: Si cette exécution échoue parce que le programme n'est pas un exécutable et si le fichier n'est pas un répertoire, il est pris pour un I<script>, un fichier contenant des commandes d'interpréteur. Un sous-interpréteur est alors créé pour exécuter ce script. Ce sous-interpréteur se réinitialisera lui-même, comme si un nouvel interpréteur avait été appelé pour exécuter le script, à la différence qu'il continuera à mémoriser l'emplacement des commandes connues de son parent (voir B<hash> plus bas dans E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>).

source: If the program is a file beginning with B<#!>, the remainder of the first line specifies an interpreter for the program. The shell executes the specified interpreter on operating systems that do not handle this executable format themselves. The arguments to the interpreter consist of a single optional argument following the interpreter name on the first line of the program, followed by the name of the program, followed by the command arguments, if any.
fr: Si le programme est un fichier commençant par B<#!>, le reste de la première ligne indique un interprète pour ce programme. L'interpréteur se chargera d'exécuter cet interprète spécifié sur les systèmes d'exploitation qui ne gèrent pas eux-mêmes ce format d'exécutable. Les arguments de l'interprète consistent en un seul argument facultatif fourni sur la première ligne du fichier à la suite du nom de l'interprète, suivi du nom du programme, suivi des arguments de la commande s'il y en a.

source: COMMAND EXECUTION ENVIRONMENT
fr: ENVIRONNEMENT D'EXÉCUTION DES COMMANDES

source: The shell has an I<execution environment>, which consists of the following:
fr: L'interpréteur fournit un I<environnement d'exécution> consistant en l'ensemble des éléments suivants :

source: open files inherited by the shell at invocation, as modified by redirections supplied to the B<exec> builtin
fr: les fichiers ouverts hérités par l'interpréteur à son appel et modifiés par les redirections fournies à la commande interne B<exec>

source: the current working directory as set by B<cd>, B<pushd>, or B<popd>, or inherited by the shell at invocation
fr: le répertoire de travail courant comme mis par B<cd>, B<pushd> ou B<popd> ou hérité par l'interpréteur à son appel

source: the file creation mode mask as set by B<umask> or inherited from the shell's parent
fr: le masque de création de fichier comme mis par B<umask> ou hérité du parent de l'interpréteur

source: current traps set by B<trap>
fr: captures courantes mises par B<trap>

source: shell parameters that are set by variable assignment or with B<set> or inherited from the shell's parent in the environment
fr: les paramètres de l'interpréteur sont mis par des affectations de variables ou avec la commande interne B<set> ou hérités de l'environnement du parent de l'interpréteur

source: shell functions defined during execution or inherited from the shell's parent in the environment
fr: les fonctions de l'interpréteur définies lors de l'exécution ou héritées de l'environnement du parent de l'interpréteur ;

source: options enabled at invocation (either by default or with command-line arguments) or by B<set>
fr: les options activées à l'appel (par défaut ou avec les arguments de ligne de commande) ou par B<set> ;

source: options enabled by B<shopt>
fr: options activées par B<shopt> ;

source: shell aliases defined with B<alias>
fr: les alias de l'interpréteur définies par la commande B<alias> ;

source: various process IDs, including those of background jobs, the value of B<$$>, and the value of B<$PPID>
fr: les ID des divers processus, y compris ceux des tâches en arrière-plan, la valeur de B<$$> et la valeur de B<$PPID>

source: When a simple command other than a builtin or shell function is to be executed, it is invoked in a separate execution environment that consists of the following. Unless otherwise noted, the values are inherited from the shell.
fr: Lorsqu'une commande autre qu'une commande interne ou une fonction de l'interpréteur doit être exécutée, elle est appelée dans un environnement d'exécution séparé constitué de ce qui suit. Sauf indication contraire, les valeurs sont héritées de l'environnement de l'interpréteur.

source: the shell's open files, plus any modifications and additions specified by redirections to the command
fr: les fichiers ouverts de l'interpréteur, auxquels s'ajoutent les modifications indiquées par les redirections apportées à la commande ;

source: the current working directory
fr: le répertoire de travail courant ;

source: the file creation mode mask
fr: le masque de création de fichiers ;

source: shell variables and functions marked for export, along with variables exported for the command, passed in the environment
fr: les variables et les fonctions de l'interpréteur marquées pour l'exportation, ainsi que les variables exportées spécialement pour la commande ;

source: traps caught by the shell are reset to the values inherited from the shell's parent, and traps ignored by the shell are ignored
fr: les captures interceptées par l'interpréteur sont réinitialisées aux valeurs héritées de l'interpréteur parent et les captures ignorées par l'interpréteur restent ignorées

source: A command invoked in this separate environment cannot affect the shell's execution environment.
fr: Une commande appelée dans un environnement distinct ne peut pas affecter l'environnement d'exécution de l'interpréteur.

source: Command substitution, commands grouped with parentheses, and asynchronous commands are invoked in a subshell environment that is a duplicate of the shell environment, except that traps caught by the shell are reset to the values that the shell inherited from its parent at invocation. Builtin commands that are invoked as part of a pipeline are also executed in a subshell environment. Changes made to the subshell environment cannot affect the shell's execution environment.
fr: Les substitutions de commande, les commandes groupées entre parenthèses et les commandes asynchrones sont appelées dans un environnement de sous-interpréteur qui est une copie de celui de l'interpréteur, sauf que les captures interceptées par l'interpréteur sont réinitialisées aux valeurs que l'interpréteur avait héritées de son parent à son appel. Les commandes internes appelées dans une conduite sont aussi exécutées dans un environnement de sous-interpréteur. Les modifications apportées à l'environnement d'une sous-interpréteur n'affectent aucunement l'environnement d'exécution de l'interpréteur.

source: If a command is followed by a B<&> and job control is not active, the default standard input for the command is the empty file I</dev/null>. Otherwise, the invoked command inherits the file descriptors of the calling shell as modified by redirections.
fr: Si une commande est suivie par un B<&> et que le contrôle des tâches n'est pas actif, l'entrée standard par défaut de la commande est le fichier vide I</dev/null>. Sinon, la commande appelée hérite des descripteurs de fichiers de l'interpréteur appelant comme modifiés par les redirections.

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: When a program is invoked it is given an array of strings called the I<environment>. This is a list of I<name>-I<value> pairs, of the form I<name>=I<value>.
fr: Quand un programme est appelé, il reçoit un tableau de chaînes que l'on appelle I<environnement>. Il s'agit d'une liste de couples I<nom>-I<valeur>, de la forme I<nom>=I<valeur>.

source: The shell provides several ways to manipulate the environment. On invocation, the shell scans its own environment and creates a parameter for each name found, automatically marking it for I<export> to child processes. Executed commands inherit the environment. The B<export> and B<declare -x> commands allow parameters and functions to be added to and deleted from the environment. If the value of a parameter in the environment is modified, the new value becomes part of the environment, replacing the old. The environment inherited by any executed command consists of the shell's initial environment, whose values may be modified in the shell, less any pairs removed by the B<unset> command, plus any additions via the B<export> and B<declare -x> commands.
fr: L'interpréteur fournit plusieurs façons de gérer l'environnement. Au démarrage, l'interpréteur analyse son propre environnement et crée un paramètre pour chaque nom trouvé, en le marquant comme I<exportable> vers les processus enfants. Les commandes exécutées héritent de cet environnement. Les commandes B<export> et B<declare -x> permettent d'ajouter ou de supprimer des paramètres ou des fonctions de l'environnement. Si la valeur d'un paramètre de l'environnement est modifiée, la nouvelle valeur devient une partie de l'environnement et elle remplace l'ancienne. L'environnement hérité par les commandes exécutées est l'environnement initial de l'interpréteur (dont les valeurs peuvent être modifiées), moins les éléments supprimés par la commande B<unset>, plus les éléments ajoutés par les commandes B<export> et B<declare -x>.

source: The environment for any I<simple command> or function may be augmented temporarily by prefixing it with parameter assignments, as described above in E<.SM> B<PARAMETERS>. These assignment statements affect only the environment seen by that command.
fr: L'environnement d'une I<commande simple> ou d'une fonction peut être augmenté temporairement, en la faisant précéder des affectations de paramètres, comme nous l'avons vu plus haut dans E<.SM B<PARAMÈTRES>.> Ces affectations ne concernent que l'environnement vu par cette commande ou fonction.

source: If the B<-k> option is set (see the B<set> builtin command below), then I<all> parameter assignments are placed in the environment for a command, not just those that precede the command name.
fr: Si l'option B<-k> est mise (voir plus bas la commande interne B<set>), alors I<toutes> les affectations de paramètres sont placées dans l'environnement d'une commande exécutée et non seulement celles qui précèdent son nom.

source: When B<bash> invokes an external command, the variable B<_> is set to the full file name of the command and passed to that command in its environment.
fr: Quand B<bash> appelle une commande externe, la variable B<_> est mise au chemin d'accès complet à cette commande et elle est transmise dans l'environnement.

source: EXIT STATUS
fr: ÉTAT FINAL

source: For the shell's purposes, a command which exits with a zero exit status has succeeded. An exit status of zero indicates success. A non-zero exit status indicates failure. When a command terminates on a fatal signal I<N>, B<bash> uses the value of 128+I<N> as the exit status.
fr: Du point de vue de l'interpréteur, une commande qui termine avec état final de zéro a réussi. Un état final de zéro indique le succès. Un état final différent de zéro indique un échec. Quand une commande termine par un signal mortel I<N>, B<bash> utilise la valeur 128+I<N> comme état final.

source: If a command is not found, the child process created to execute it returns a status of 127. If a command is found but is not executable, the return status is 126.
fr: Si une commande n'est pas trouvée, le processus enfant créé pour l'exécuter renvoie un état de 127. Si une commande est trouvée mais pas exécutable, la valeur renvoyée est 126.

source: If a command fails because of an error during expansion or redirection, the exit status is greater than zero.
fr: Si une commande échoue à cause d'une erreur survenue lors d'un développement ou des redirections, l'état final est strictement plus grand que zéro.

source: Shell builtin commands return a status of 0 (I<true>) if successful, and non-zero (I<false>) if an error occurs while they execute. All builtins return an exit status of 2 to indicate incorrect usage.
fr: Les commandes internes renvoient un état de 0 (I<vrai>) si réussies et une valeur différente de zéro (I<faux>) si une erreur se produit pendant leur exécution. Toutes les commandes internes renvoient un état final de 2 pour indiquer un usage incorrect.

source: B<Bash> itself returns the exit status of the last command executed, unless a syntax error occurs, in which case it exits with a non-zero value. See also the B<exit> builtin command below.
fr: B<Bash> lui-même renvoie l'état final de la dernière commande exécutée, à moins qu'une erreur de syntaxe se produise, auquel cas il termine avec une valeur différente de zéro. Voir aussi plus bas la commande interne B<exit>.

source: SIGNALS
fr: SIGNAUX

source: When B<bash> is interactive, in the absence of any traps, it ignores E<.SM> B<SIGTERM> (so that B<kill 0> does not kill an interactive shell), and E<.SM> B<SIGINT> is caught and handled (so that the B<wait> builtin is interruptible). In all cases, B<bash> ignores E<.SM> B<SIGQUIT>. If job control is in effect, B<bash> ignores E<.SM> B<SIGTTIN>, E<.SM> B<SIGTTOU>, and E<.SM> B<SIGTSTP>.
fr: Quand B<bash> fonctionne de façon interactive, en l'absence de capture, il ignore E<.SM B<SIGTERM>> (c'est ainsi que B<kill 0> ne tue pas un interpréteur interactif) et E<.SM B<SIGINT>> est intercepté et géré (c'est ainsi que la commande interne B<wait> est interruptible). Dans tous les cas, B<bash> ignore E<.SM B<SIGQUIT>.> Si le contrôle des tâches est actif, B<bash> ignore E<.SM B<SIGTTIN>,> E<.SM B<SIGTTOU>> et E<.SM B<SIGTSTP>.>

source: Non-builtin commands run by B<bash> have signal handlers set to the values inherited by the shell from its parent. When job control is not in effect, asynchronous commands ignore E<.SM> B<SIGINT> and E<.SM> B<SIGQUIT> in addition to these inherited handlers. Commands run as a result of command substitution ignore the keyboard-generated job control signals E<.SM> B<SIGTTIN>, E<.SM> B<SIGTTOU>, and E<.SM> B<SIGTSTP>.
fr: Les commandes externes lancées par B<bash> ont les gestionnaires de signaux mis aux valeurs héritées par l'interpréteur de son parent. Quand le contrôle des tâches n'est pas actif, les tâches en arrière-plan ignorent les signaux E<.SM B<SIGINT>> et E<.SM B<SIGQUIT>> en plus des gestionnaires hérités. Les commandes exécutées en tant que résultat d'une substitution de commande ignorent les signaux de contrôle de tâches émis par le clavier E<.SM B<SIGTTIN>,> E<.SM B<SIGTTOU>> et E<.SM B<SIGTSTP>.>
