Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: The E<.SM> B<GLOBIGNORE> shell variable may be used to restrict the set of file names matching a I<pattern>. If E<.SM> B<GLOBIGNORE> is set, each matching file name that also matches one of the patterns in E<.SM> B<GLOBIGNORE> is removed from the list of matches. The file names B<``.''> and B<``..''> are always ignored when E<.SM> B<GLOBIGNORE> is set and not null. However, setting E<.SM> B<GLOBIGNORE> to a non-null value has the effect of enabling the B<dotglob> shell option, so all other file names beginning with a B<``.''> will match. To get the old behavior of ignoring file names beginning with a B<``.''>, make B<``.*''> one of the patterns in E<.SM> B<GLOBIGNORE>. The B<dotglob> option is disabled when E<.SM> B<GLOBIGNORE> is unset.
fr: La variable de l'interpréteur E<.SM B<GLOBIGNORE>> peut servir à restreindre l'ensemble des noms de fichiers correspondant à un I<motif>. Si E<.SM B<GLOBIGNORE>> existe, chaque nom de fichier qui correspond aussi à un motif de E<.SM B<GLOBIGNORE>> est supprimé de la liste des correspondances. Les noms de fichiers B<« . »> et B<« .. »> sont toujours ignorés quand E<.SM B<GLOBIGNORE>> existe et n'est pas vide. Toutefois, configurer E<.SM B<GLOBIGNORE>> avec une valeur non vide a pour effet d'activer l'option d'interpréteur B<dotglob>, ainsi tous les autres noms de fichiers commençant par B<« . »> correspondront. Pour obtenir l'ancien comportement ignorant les noms commençant par B<« . »>, placez B<« .* »> dans l'un des motifs de E<.SM B<GLOBIGNORE>.> L'option B<dotglob> est désactivée si la variable E<.SM B<GLOBIGNORE>> est inexistante.

source: B<Pattern Matching>
fr: B<Motifs génériques>

source: Any character that appears in a pattern, other than the special pattern characters described below, matches itself. The NUL character may not occur in a pattern. A backslash escapes the following character; the escaping backslash is discarded when matching. The special pattern characters must be quoted if they are to be matched literally.
fr: Tout caractère apparaissant dans un motif, hormis les caractères spéciaux décrits plus bas correspond avec lui-même. Le caractère NUL ne peut pas se trouver dans un motif. Une contre-oblique protège le caractère qui la suit ; la contre-oblique de protection est supprimée lors de la recherche de correspondance. Les caractères spéciaux de motifs doivent être protégés s'ils sont destinés à une correspondance littérale.

source: The special pattern characters have the following meanings:
fr: Les caractères spéciaux ont les significations suivantes :

source: Matches any string, including the null string.
fr: Correspond à n'importe quelle chaîne, y compris la chaîne vide.

source: Matches any single character.
fr: Correspond à n'importe quel caractère.

source: Matches any one of the enclosed characters. A pair of characters separated by a hyphen denotes a I<range expression>; any character that sorts between those two characters, inclusive, using the current locale's collating sequence and character set, is matched. If the first character following the B<[> is a B<!> or a B<^> then any character not enclosed is matched. The sorting order of characters in range expressions is determined by the current locale and the value of the B<LC_COLLATE> shell variable, if set. A B<-> may be matched by including it as the first or last character in the set. A B<]> may be matched by including it as the first character in the set.
fr: Correspond à l'un des caractères entre crochets. Un couple de caractères séparés par un trait d'union indique une I<expression de plage> ; tout caractère qui correspond à n'importe quel caractère situé entre les deux bornes incluses, en utilisant les suites de collations des paramètres linguistiques régionaux courants et le jeu de caractères. Si le premier caractère suivant le B<[> est un B<!> ou un B<^> alors la correspondance se fait sur les caractères non inclus. L'ordre de tri des caractères dans les expressions de plage est déterminé par les paramètres linguistiques régionaux courants et par la valeur de la variable de l'interpréteur B<LC_COLLATE> si existante. Un B<-> peut être mis en correspondance en l'incluant en premier ou dernier caractère de l'ensemble. Un B<]> peut être mis en correspondance en l'incluant en premier caractère de l'ensemble.

source: Within B<[> and B<]>, I<character classes> can be specified using the syntax B<[:>I<class>B<:]>, where I<class> is one of the following classes defined in the POSIX.2 standard:
fr: Entre B<[> et B<]>, on peut indiquer une I<classe de caractère> en utilisant la syntaxe B<[:>I<classe>B<:]>, où I<classe> est l'une des classes suivantes, définies dans le standard POSIX.2 :

source: A character class matches any character belonging to that class. The B<word> character class matches letters, digits, and the character _.
fr: Une classe correspond à un caractère quelconque qui s'y trouve. La classe de caractères B<word> correspond aux lettres, aux chiffres et au caractère souligné « _ ».

source: Within B<[> and B<]>, an I<equivalence class> can be specified using the syntax B<[=>I<c>B<=]>, which matches all characters with the same collation weight (as defined by the current locale) as the character I<c>.
fr: Entre B<[> et B<]>, on peut indiquer une I<classe d'équivalence> en utilisant la syntaxe B<[=>I<c>B<=]>, qui correspond à n'importe quel caractère ayant le même poids de collation (comme indiqué par les paramètres linguistiques régionaux courants) que le caractère I<c>.

source: Within B<[> and B<]>, the syntax B<[.>I<symbol>B<.]> matches the collating symbol I<symbol>.
fr: Entre B<[> et B<]>, la syntaxe B<[.>I<symbole>B<.]> correspond au symbole de collation I<symbole>.

source: If the B<extglob> shell option is enabled using the B<shopt> builtin, several extended pattern matching operators are recognized. In the following description, a I<pattern-list> is a list of one or more patterns separated by a B<|>. Composite patterns may be formed using one or more of the following sub-patterns:
fr: Si l'option B<extglob> d'interpréteur est activée par la commande interne B<shopt> plusieurs opérateurs de correspondance étendue sont reconnus. Dans la description suivante, une I<liste-motif> est une liste d'un ou plusieurs motifs séparés par des B<|>. Les motifs composés sont formés en utilisant un ou plusieurs sous-motifs comme suit :

source: B<?(>\^I<pattern-list\^>B<)>
fr: B<?(>\^I<liste-motif\^>B<)>

source: Matches zero or one occurrence of the given patterns
fr: Correspond à zéro ou une occurrence des motifs indiqués

source: B<*(>\^I<pattern-list\^>B<)>
fr: B<*(>\^I<liste-motif\^>B<)>

source: Matches zero or more occurrences of the given patterns
fr: Correspond à zéro ou plusieurs occurrences des motifs indiqués

source: B<+(>\^I<pattern-list\^>B<)>
fr: B<+(>\^I<liste-motif\^>B<)>

source: Matches one or more occurrences of the given patterns
fr: Correspond à une ou plusieurs occurrences des motifs indiqués

source: B<@(>\^I<pattern-list\^>B<)>
fr: B<@(>\^I<liste-motif\^>B<)>

source: Matches one of the given patterns
fr: Correspond à une occurrence exactement des motifs indiqués

source: B<!(>\^I<pattern-list\^>B<)>
fr: B<!(>\^I<liste-motif\^>B<)>

source: Matches anything except one of the given patterns
fr: Correspond à tout sauf les motifs indiqués

source: Quote Removal
fr: Suppression des protections

source: After the preceding expansions, all unquoted occurrences of the characters B<\e>, B<'>, and \^B<">\^ that did not result from one of the above expansions are removed.
fr: Après les développements précédents, toutes les occurrences non protégées des caractères B<\e>, B<`> et \^B<">\^ qui ne résultent pas d'un des développements ci-dessus sont supprimées.

source: REDIRECTION
fr: REDIRECTIONS

source: Before a command is executed, its input and output may be I<redirected> using a special notation interpreted by the shell. Redirection may also be used to open and close files for the current shell execution environment. The following redirection operators may precede or appear anywhere within a I<simple command> or may follow a I<command>. Redirections are processed in the order they appear, from left to right.
fr: Avant qu'une commande ne soit exécutée, il est possible de I<rediriger> son entrée et sa sortie en utilisant une notation spéciale interprétée par l'interpréteur. Les redirections peuvent également servir à ouvrir ou fermer des fichiers dans l'environnement actuel de l'interpréteur. Les opérateurs de redirection décrits ci-dessous peuvent apparaître avant ou au sein d'une I<commande simple> ou suivre une I<commande>. Les redirections sont traitées dans l'ordre d'apparition de gauche à droite.

source: In the following descriptions, if the file descriptor number is omitted, and the first character of the redirection operator is B<E<lt>>, the redirection refers to the standard input (file descriptor 0). If the first character of the redirection operator is B<E<gt>>, the redirection refers to the standard output (file descriptor 1).
fr: Dans les descriptions suivantes, si le numéro de descripteur de fichier est omis et si le premier caractère de l'opérateur de redirection est B<E<lt>>, celui-ci correspondra à l'entrée standard (descripteur de fichier 0). Si le premier caractère de l'opérateur est B<E<gt>>, la redirection s'appliquera à la sortie standard (descripteur de fichier 1).

source: The word following the redirection operator in the following descriptions, unless otherwise noted, is subjected to brace expansion, tilde expansion, parameter expansion, command substitution, arithmetic expansion, quote removal, pathname expansion, and word splitting. If it expands to more than one word, B<bash> reports an error.
fr: Le mot qui suit l'opérateur de redirection dans les descriptions suivantes, à moins qu'il en soit fait état autrement, est soumis au développement des accolades, du tilde, des paramètres, à la substitution de commande, au développement arithmétique, à la suppression des protections, au développement des chemins et au découpage en mots. S'il se développe en plusieurs mots, B<bash> signale une erreur.

source: Note that the order of redirections is significant. For example, the command
fr: Remarquez que l'ordre des redirections est important. Par exemple, la commande

source: ls B<E<gt>> dirlist 2B<E<gt>&>1
fr: ls B<E<gt>> liste_répertoires 2B<E<gt>&>1

source: directs both standard output and standard error to the file I<dirlist>, while the command
fr: redirige a la fois la sortie standard et la sortie d'erreur vers le fichier I<liste_répertoires>, alors que la commande

source: ls 2B<E<gt>&>1 B<E<gt>> dirlist
fr: ls 2B<E<gt>&>1 B<E<gt>> liste_répertoires

source: directs only the standard output to file I<dirlist>, because the standard error was duplicated as standard output before the standard output was redirected to I<dirlist>.
fr: ne redirige que la sortie standard vers le fichier I<liste_répertoires>, car la sortie d'erreur standard a été dupliquée vers la sortie standard avant que celle-ci ne soit redirigée vers I<liste_répertoires>.

source: B<Bash> handles several filenames specially when they are used in redirections, as described in the following table:
fr: B<Bash> gère plusieurs noms de fichiers de façon particulière, lorsqu'ils sont utilisés dans des redirections, comme décrit dans la table suivante :

source: If I<fd> is a valid integer, file descriptor I<fd> is duplicated.
fr: Si I<fd> est un entier correct, le descripteur de fichier I<fd> est dupliqué.

source: File descriptor 0 is duplicated.
fr: Le descripteur de fichier 0 est dupliqué.

source: File descriptor 1 is duplicated.
fr: Le descripteur de fichier 1 est dupliqué.

source: File descriptor 2 is duplicated.
fr: Le descripteur de fichier 2 est dupliqué.

source: If I<host> is a valid hostname or Internet address, and I<port> is an integer port number or service name, B<bash> attempts to open a TCP connection to the corresponding socket.
fr: Si I<host> est une adresse Internet ou un nom de machine correct et si I<port> est un numéro de « port » entier ou un nom de service, B<bash> tentera d'ouvrir une connexion TCP sur la « socket » correspondante.

source: If I<host> is a valid hostname or Internet address, and I<port> is an integer port number or service name, B<bash> attempts to open a UDP connection to the corresponding socket.
fr: Si I<host> est un nom de machine correct ou une adresse Internet et si I<port> est un numéro de port entier ou un nom de service, B<bash> tentera d'ouvrir une connexion UDP sur la « socket » correspondante.

source: B<NOTE:> Bash, as packaged for Debian, does B<not> support using the B</dev/tcp> and B</dev/udp> files.
fr: B<Remarque :> Bash, comme empaqueté pour Debian, B<ne permet pas> l'utilisation des fichiers B</dev/tcp> et B</dev/udp>.

source: A failure to open or create a file causes the redirection to fail.
fr: Un échec à l'ouverture ou à la création d'un fichier conduit à l'échec de la redirection.

source: Redirections using file descriptors greater than 9 should be used with care, as they may conflict with file descriptors the shell uses internally.
fr: Les redirections qui utilisent des descripteurs de fichiers supérieurs à 9 doivent être utilisés avec précaution car il peut y avoir des conflits avec les descripteurs de fichiers que l'interpréteur utilise en interne.

source: Redirecting Input
fr: Redirection d'entrée

source: Redirection of input causes the file whose name results from the expansion of I<word> to be opened for reading on file descriptor I<n>, or the standard input (file descriptor 0) if I<n> is not specified.
fr: Une redirection d'entrée conduit à l'ouverture en lecture avec le descripteur de fichier numéro I<n> du fichier dont le nom résulte du développement du I<mot> ou en tant qu'entrée standard (descripteur de fichier 0) si I<n> n'est pas spécifié.

source: The general format for redirecting input is:
fr: Le format général des redirections d'entrée est :

source: [I<n>]B<E<lt>>I<word>
fr: [I<n>]B<E<lt>>I<mot>

source: Redirecting Output
fr: Redirection de sortie

source: Redirection of output causes the file whose name results from the expansion of I<word> to be opened for writing on file descriptor I<n>, or the standard output (file descriptor 1) if I<n> is not specified. If the file does not exist it is created; if it does exist it is truncated to zero size.
fr: Une redirection de sortie conduit à l'ouverture en écriture du fichier dont le nom résulte du développement du I<mot> avec comme descripteur de fichier I<n> ou en tant que sortie standard (descripteur de fichier 1) si I<n> n'est pas spécifié. Si le fichier n'existe pas, il est créé. S'il existait déjà, sa taille est ramenée à 0.

source: The general format for redirecting output is:
fr: Le format général des redirections de sortie est le suivant :

source: [I<n>]B<E<gt>>I<word>
fr: [I<n>]B<E<gt>>I<mot>

source: If the redirection operator is B<E<gt>>, and the B<noclobber> option to the B<set> builtin has been enabled, the redirection will fail if the file whose name results from the expansion of I<word> exists and is a regular file. If the redirection operator is B<E<gt>|>, or the redirection operator is B<E<gt>> and the B<noclobber> option to the B<set> builtin command is not enabled, the redirection is attempted even if the file named by I<word> exists.
fr: Si l'opérateur de redirection est B<E<gt>> et si l'option B<noclobber> de la commande interne B<set> est activée, la redirection échouera si le fichier dont le nom résulte du développement du I<mot> existe et est un fichier normal. Si l'opérateur de redirection est B<E<gt>|> ou l'opérateur B<E<gt>> avec l'option B<noclobber> de la commande interne B<set> n'est pas activée, la redirection sera tentée même si le fichier dont le nom résulte du développement du I<mot> existe.

source: Appending Redirected Output
fr: Ajout d'une sortie redirigée

source: Redirection of output in this fashion causes the file whose name results from the expansion of I<word> to be opened for appending on file descriptor I<n>, or the standard output (file descriptor 1) if I<n> is not specified. If the file does not exist it is created.
fr: La redirection de la sortie de cette façon conduit à l'ouverture du fichier dont le nom résulte du développement du I<mot> pour ajouter au descripteur de fichier I<n> ou à la sortie standard (descripteur de fichier 1) si I<n> n'est pas spécifié. Si le fichier n'existe pas, il est créé.

source: The general format for appending output is:
fr: Le format général pour les sorties avec ajout est :

source: [I<n>]B<E<gt>E<gt>>I<word>
fr: [I<n>]B<E<gt>E<gt>>I<mot>

source: Redirecting Standard Output and Standard Error
fr: Redirection de la sortie standard et de la sortie d'erreur

source: B<Bash> allows both the standard output (file descriptor 1) and the standard error output (file descriptor 2) to be redirected to the file whose name is the expansion of I<word> with this construct.
fr: B<Bash> permet la redirection simultanée de la sortie standard (descripteur 1) et de la sortie d'erreur (descripteur 2), dans un fichier dont le nom est le résultat du développement du I<mot> avec cette construction.

source: There are two formats for redirecting standard output and standard error:
fr: Il y a deux formes pour effectuer cette double redirection :

source: B<&E<gt>>I<word>
fr: B<&E<gt>>I<mot>

source: and
fr: et

source: B<E<gt>&>I<word>
fr: B<E<gt>&>I<mot>

source: Of the two forms, the first is preferred. This is semantically equivalent to
fr: La première des deux formes est préférée. Ceci est sémantiquement équivalent à

source: B<E<gt>>I<word> 2B<E<gt>&>1
fr: B<E<gt>>I<mot> 2B<E<gt>&>1

source: Here Documents
fr: Document en ligne

source: This type of redirection instructs the shell to read input from the current source until a line containing only I<word> (with no trailing blanks) is seen. All of the lines read up to that point are then used as the standard input for a command.
fr: Ce type de redirection commande à l'interpréteur de lire son entrée de la source courante jusqu'à ce qu'il voie une ligne contenant seulement le I<mot> prévu (sans blancs finaux). Toutes les lignes lues jusqu'à ce point sont ensuite utilisées comme l'entrée standard pour une commande.

source: The format of here-documents is:
fr: Le format des documents en ligne est le suivant :

source: B<E<lt>E<lt>>[B<->]I<word> I<here-document> I<delimiter>
fr: B<E<lt>E<lt>>[B<->]I<mot> I<document_en_ligne> I<délimiteur>

source: No parameter expansion, command substitution, arithmetic expansion, or pathname expansion is performed on I<word>. If any characters in I<word> are quoted, the I<delimiter> is the result of quote removal on I<word>, and the lines in the here-document are not expanded. If I<word> is unquoted, all lines of the here-document are subjected to parameter expansion, command substitution, and arithmetic expansion. In the latter case, the character sequence B<\eE<lt>newlineE<gt>> is ignored, and B<\e> must be used to quote the characters B<\e>, B<$>, and B<`>.
fr: Il n'y a ni développement des paramètres, ni substitution de commande, ni développement arithmétique, ni développement des chemins d'effectué sur le I<mot>. Si l'un quelconque des caractères du I<mot> est protégé, I<délimiteur> est le résultat de la suppression des protections sur I<mot> et les lignes du document en ligne ne sont pas développées. Si le I<mot> n'est pas protégé, toutes les lignes du document en ligne sont soumises au développement des paramètres, à la substitution de commande et au développement arithmétique. Dans ce dernier cas, la suite de caractères B<\eE<lt>saut de ligneE<gt>> est ignorée et B<\e> doit être utilisée pour protéger les caractères B<\e>, B<$> et B<`>.

source: If the redirection operator is B<E<lt>E<lt>->, then all leading tab characters are stripped from input lines and the line containing I<delimiter>. This allows here-documents within shell scripts to be indented in a natural fashion.
fr: Si l'opérateur de redirection est B<E<lt>E<lt>-,> alors les tabulations en tête de chaque ligne sont supprimées de l'entrée, y compris dans la ligne contenant I<délimiteur>. Ceci permet d'indenter de façon naturelle les documents en ligne au sein des scripts.

source: Here Strings
fr: Chaînes en ligne

source: A variant of here documents, the format is:
fr: Une variante aux documents en ligne, le format est :

source: B<E<lt>E<lt>E<lt>>I<word>
fr: B<E<lt>E<lt>E<lt>>I<mot>

source: The I<word> is expanded and supplied to the command on its standard input.
fr: Le I<mot> est développé et fourni à la commande sur son entrée standard.

source: Duplicating File Descriptors
fr: Dédoublement de descripteur de fichier

source: The redirection operator
fr: L'opérateur de redirection

source: [I<n>]B<E<lt>&>I<word>
fr: [I<n>]B<E<lt>&>I<mot>

source: is used to duplicate input file descriptors. If I<word> expands to one or more digits, the file descriptor denoted by I<n> is made to be a copy of that file descriptor. If the digits in I<word> do not specify a file descriptor open for input, a redirection error occurs. If I<word> evaluates to B<->, file descriptor I<n> is closed. If I<n> is not specified, the standard input (file descriptor 0) is used.
fr: permet de dupliquer les descripteurs de fichiers en entrée. Si le I<mot> se transforme en un ou plusieurs chiffres, le descripteur de fichier noté par I<n> devient une copie de ce descripteur. Si les chiffres du I<mot> ne correspondent pas à un descripteur ouvert en lecture pour l'entrée, une erreur de redirection se produit. Si le I<mot> prend la forme B<->, le descripteur I<n> est fermé. Si I<n> n'est pas mentionné, l'entrée standard (descripteur 0) est utilisée.

source: The operator
fr: L'opérateur

source: [I<n>]B<E<gt>&>I<word>
fr: [I<n>]B<E<gt>&>I<mot>

source: is used similarly to duplicate output file descriptors. If I<n> is not specified, the standard output (file descriptor 1) is used. If the digits in I<word> do not specify a file descriptor open for output, a redirection error occurs. As a special case, if I<n> is omitted, and I<word> does not expand to one or more digits, the standard output and standard error are redirected as described previously.
fr: est utilisé de façon similaire pour dupliquer les descripteurs de sortie. Si I<n> n'est pas précisé, on considère la sortie standard (descripteur 1). Si les chiffres du I<mot> ne correspondent pas à un descripteur en écriture, une erreur se produit. Un cas particulier se produit si I<n> est omis et si I<mot> ne se développe pas sous forme de chiffres. Alors, les sorties standard et d'erreurs sont toutes deux redirigées comme précédemment.

source: Moving File Descriptors
fr: Déplacement de descripteurs de fichiers

source: [I<n>]B<E<lt>&>I<digit>B<->
fr: [I<n>]B<E<lt>&>I<chiffre>B<->

source: moves the file descriptor I<digit> to file descriptor I<n>, or the standard input (file descriptor 0) if I<n> is not specified. I<digit> is closed after being duplicated to I<n>.
fr: déplace le descripteur de fichier I<chiffre> vers le descripteur de fichier I<n> ou sur l'entrée standard (descripteur de fichier 0) si I<n> n'est pas spécifié. I<chiffre> est fermé après avoir été dupliqué en I<n>.

source: Similarly, the redirection operator
fr: De la même façon, l'opérateur de redirection

source: [I<n>]B<E<gt>&>I<digit>B<->
fr: [I<n>]B<E<gt>&>I<chiffre>B<->

source: moves the file descriptor I<digit> to file descriptor I<n>, or the standard output (file descriptor 1) if I<n> is not specified.
fr: déplace le descripteur de fichier I<chiffre> vers le descripteur de fichier I<n> ou sur la sortie standard (descripteur de fichier 1) si I<n> n'est pas spécifié.

source: Opening File Descriptors for Reading and Writing
fr: Ouverture en Lecture/Écriture d'un descripteur de fichier
