Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: Attempt completion on the text before point, treating it as a command name. Command completion attempts to match the text against aliases, reserved words, shell functions, shell builtins, and finally executable filenames, in that order.
fr: Essayer le complètement sur le texte situé avant le curseur, en le traitant comme un nom de commande. Le complètement des commandes essaie de faire correspondre le texte, dans cet ordre, aux alias, mots réservés, fonctions de l'interpréteur, commandes internes de l'interpréteur et finalement les noms de fichiers exécutables.

source: List the possible completions of the text before point, treating it as a command name.
fr: Afficher les complètements possibles du texte situé avant le curseur, en le traitant comme un nom de commande.

source: Attempt completion on the text before point, comparing the text against lines from the history list for possible completion matches.
fr: Essayer le complètement du texte situé avant le curseur, en le comparant aux lignes de la file d'historique lui correspondant pour les complètements possibles.

source: Perform filename completion and insert the list of possible completions enclosed within braces so the list is available to the shell (see B<Brace Expansion> above).
fr: Effectuer un complètement en noms de fichiers et insérer la liste des complètements possibles entre accolades afin que la liste soit exploitable par l'interpréteur (voir B<Développement des accolades> plus haut).

source: Keyboard Macros
fr: Macros clavier

source: Begin saving the characters typed into the current keyboard macro.
fr: Démarre la mémorisation dans la macro en cours des caractères tapés.

source: Stop saving the characters typed into the current keyboard macro and store the definition.
fr: Arrête la mémorisation dans la macro en cours des caractères saisis et conserve la définition.

source: Re-execute the last keyboard macro defined, by making the characters in the macro appear as if typed at the keyboard.
fr: Ré-exécute la dernière macro définie, en agissant comme si les caractères contenus dans cette macro étaient saisis au clavier.

source: Miscellaneous
fr: Divers

source: Read in the contents of the I<inputrc> file, and incorporate any bindings or variable assignments found there.
fr: Lire le contenu du fichier I<inputrc> et prendre en compte tous raccourcis ou affectations de variables qui s'y trouvent.

source: Abort the current editing command and ring the terminal's bell (subject to the setting of B<bell-style>).
fr: Abandonner l'édition en cours et émettre une alarme de terminal (selon la configuration de la variable B<bell-style>).

source: If the metafied character I<x> is lowercase, run the command that is bound to the corresponding uppercase character.
fr: Si le caractère I<x> précédé de Méta est en minuscule, exécuter la commande qui est associée aux caractères majuscules correspondants.

source: Metafy the next character typed. E<.SM> B<ESC> B<f> is equivalent to B<Meta-f>.
fr: Considérer le prochain caractère saisi comme un Méta. E<.SM B<ESC>> B<f> est équivalent à B<Meta-f>.

source: Incremental undo, separately remembered for each line.
fr: Fonction d'annulation incrémentale, chaque ligne étant mémorisée séparément.

source: Undo all changes made to this line. This is like executing the B<undo> command enough times to return the line to its initial state.
fr: Annuler toutes les modifications sur cette ligne. Ceci est équivalent à répéter B<undo> en nombre suffisant pour ramener la ligne à son état initial.

source: Perform tilde expansion on the current word.
fr: Effectuer le développement du tilde sur le mot courant.

source: Set the mark to the point. If a numeric argument is supplied, the mark is set to that position.
fr: Placer la marque à la position actuelle du curseur. Si un argument numérique est fourni, la marque est posée à la position correspondante.

source: Swap the point with the mark. The current cursor position is set to the saved position, and the old cursor position is saved as the mark.
fr: Échanger le curseur et la marque. Le position courante du curseur est mise à la position sauvegardée précédemment et l'ancienne position du curseur est mémorisée comme la marque.

source: A character is read and point is moved to the next occurrence of that character. A negative count searches for previous occurrences.
fr: Un caractère est lu et le curseur déplacé à l'occurrence suivante de ce caractère. Un argument négatif recherche les occurrences précédentes.

source: A character is read and point is moved to the previous occurrence of that character. A negative count searches for subsequent occurrences.
fr: Un caractère est lu et le curseur déplacé à l'occurrence précédente de ce caractère. Un argument négatif recherche les occurrences suivantes.

source: Without a numeric argument, the value of the readline B<comment-begin> variable is inserted at the beginning of the current line. If a numeric argument is supplied, this command acts as a toggle: if the characters at the beginning of the line do not match the value of B<comment-begin>, the value is inserted, otherwise the characters in B<comment-begin> are deleted from the beginning of the line. In either case, the line is accepted as if a newline had been typed. The default value of B<comment-begin> causes this command to make the current line a shell comment. If a numeric argument causes the comment character to be removed, the line will be executed by the shell.
fr: Sans argument numérique, la valeur de la variable B<comment-begin> de readline est insérée au début de la ligne courante. Si un argument numérique est fourni, cette commande agit comme une bascule : si les caractères du début de ligne ne correspondent pas à la valeur de B<comment-begin>, la valeur est insérée, sinon, les caractères dans B<comment-begin> sont effacés du début de la ligne. Dans les deux cas, la ligne est acceptée comme si un saut de ligne avait été saisi. La valeur par défaut de B<comment-begin> conduit cette commande à transformer la ligne courante de l'interpréteur en commentaire. Si un argument numérique conduit à l'effacement du caractère de commentaire, la ligne sera exécutée par l'interpréteur.

source: The word before point is treated as a pattern for pathname expansion, with an asterisk implicitly appended. This pattern is used to generate a list of matching file names for possible completions.
fr: Le mot avant le curseur est traité comme un motif pour un développement de chemin, avec un astérisque implicitement ajouté. Ce motif est utilisé pour produire une liste de noms de fichiers correspondants pour de possibles complètements.

source: The word before point is treated as a pattern for pathname expansion, and the list of matching file names is inserted, replacing the word. If a numeric argument is supplied, an asterisk is appended before pathname expansion.
fr: Le mot précédant le curseur est considéré comme un motif de développement de chemin et la liste des fichiers correspondants est insérée à sa place. Si un argument numérique est fourni, un astérisque est ajouté avant le développement du chemin.

source: The list of expansions that would have been generated by B<glob-expand-word> is displayed, and the line is redrawn. If a numeric argument is supplied, an asterisk is appended before pathname expansion.
fr: La liste des développements qui aurait été produite par B<glob-expand-word> est affichée et la ligne est rafraîchie. Si un argument numérique est fourni, un astérisque est ajouté devant le développement du chemin.

source: Print all of the functions and their key bindings to the readline output stream. If a numeric argument is supplied, the output is formatted in such a way that it can be made part of an I<inputrc> file.
fr: Afficher toutes les fonctions et leurs raccourcis clavier sur le flot de sortie de readline. Si un argument numérique est fourni, la sortie est mise en forme de façon à être incorporée dans un fichier I<inputrc>.

source: Print all of the settable readline variables and their values to the readline output stream. If a numeric argument is supplied, the output is formatted in such a way that it can be made part of an I<inputrc> file.
fr: Afficher toutes les variables readline modifiables et leurs valeurs sur le flot de sortie. Si un argument numérique est fourni, la sortie est mise en forme de façon qu'elle puisse être incorporée dans un fichier I<inputrc>.

source: Print all of the readline key sequences bound to macros and the strings they output. If a numeric argument is supplied, the output is formatted in such a way that it can be made part of an I<inputrc> file.
fr: Afficher toutes les suites de touches readline associées à des macros et les chaînes auxquelles elles correspondent. Si un argument numérique est fourni, la sortie est mise en forme d'une façon lui permettant d'être incorporée dans un fichier I<inputrc>.

source: Display version information about the current instance of B<bash>.
fr: Afficher des informations sur la version courante de B<bash>.

source: Programmable Completion
fr: Complètement programmable

source: When word completion is attempted for an argument to a command for which a completion specification (a I<compspec>) has been defined using the B<complete> builtin (see E<.SM> B<SHELL BUILTIN COMMANDS> below), the programmable completion facilities are invoked.
fr: Lorsqu'un complètement de mot est tenté pour un argument d'une commande pour laquelle une spécification de complètement a été définie en utilisant la commande interne B<complete> (voir plus bas E<.SM B<COMMANDES INTERNES DE L'INTERPRÉTEUR>>), les outils de complètement programmables sont appelés.

source: First, the command name is identified. If a compspec has been defined for that command, the compspec is used to generate the list of possible completions for the word. If the command word is a full pathname, a compspec for the full pathname is searched for first. If no compspec is found for the full pathname, an attempt is made to find a compspec for the portion following the final slash.
fr: En premier lieu, le nom de la commande est identifié. Si une spécification de complètement a été définie pour cette commande, elle est utilisée pour produire la liste des complètements possibles pour le mot. Si le mot de commande est un chemin d'accès complet, on cherche en premier lieu une spécification de complètement pour le chemin d'accès complet. Si aucune spécification de complètement n'est trouvée pour le chemin d'accès complet, une tentative est effectuée pour trouver une spécification de complètement pour la portion suivant la barre oblique finale.

source: Once a compspec has been found, it is used to generate the list of matching words. If a compspec is not found, the default B<bash> completion as described above under B<Completing> is performed.
fr: Une fois qu'une spécification de complètement a été trouvée, elle est utilisée pour produire la liste des mots correspondants. Si aucune spécification de complètement n'est trouvée, le complètement par défaut de B<bash>, tel que décrit plus haut dans B<Complètement> est effectué.

source: First, the actions specified by the compspec are used. Only matches which are prefixed by the word being completed are returned. When the B<-f> or B<-d> option is used for filename or directory name completion, the shell variable E<.SM> B<FIGNORE> is used to filter the matches.
fr: Tout d'abord, les actions définies par la spécification de complètement sont utilisées. Seules les correspondances qui sont préfixées par le mot à compléter sont renvoyées. Lorsque l'option B<-f> ou B<-d> est utilisée pour le complètement des noms de fichiers ou de répertoire, la variable de l'interpréteur E<.SM> B<FIGNORE> est utilisée pour filtrer les correspondances.

source: Any completions specified by a filename expansion pattern to the B<-G> option are generated next. The words generated by the pattern need not match the word being completed. The E<.SM> B<GLOBIGNORE> shell variable is not used to filter the matches, but the E<.SM> B<FIGNORE> variable is used.
fr: Tous les complètements spécifiés par le motif de développement de nom de fichier de l'option B<-G> sont ensuite produits. Il n'est pas nécessaire que les mots produits par le motif correspondent au mot à compléter. La variable de l'interpréteur E<.SM B<GLOBIGNORE>> n'est pas utilisée pour filtrer les correspondances, mais la variable E<.SM B<FIGNORE>> est utilisée.

source: Next, the string specified as the argument to the B<-W> option is considered. The string is first split using the characters in the E<.SM> B<IFS> special variable as delimiters. Shell quoting is honored. Each word is then expanded using brace expansion, tilde expansion, parameter and variable expansion, command substitution, and arithmetic expansion, as described above under E<.SM> B<EXPANSION>. The results are split using the rules described above under B<Word Splitting>. The results of the expansion are prefix-matched against the word being completed, and the matching words become the possible completions.
fr: Ensuite, la chaîne spécifiée comme argument à l'option B<-W> est prise en compte. Cette chaîne est tout d'abord découpée en utilisant les caractères de la variable spéciale E<.SM B<IFS>> comme délimiteurs. La protection de l'interprétation est prise en compte. Chaque mot est ensuite développé en utilisant les développements d'accolades, du tilde, des paramètres et des variables, de même que la substitution de commande et le développement arithmétique comme décrit plus haut dans E<.SM B<DÉVELOPPEMENTS>.> Les résultats sont découpés en utilisant les règles décrites plus haut dans B<Découpage en mots>. Les résultats du développement sont comparés au mot à compléter en considérant ce dernier comme préfixe et les mots correspondants deviennent les complètements possibles.

source: After these matches have been generated, any shell function or command specified with the B<-F> and B<-C> options is invoked. When the command or function is invoked, the E<.SM> B<COMP_LINE> and E<.SM> B<COMP_POINT> variables are assigned values as described above under B<Shell Variables>. If a shell function is being invoked, the E<.SM> B<COMP_WORDS> and E<.SM> B<COMP_CWORD> variables are also set. When the function or command is invoked, the first argument is the name of the command whose arguments are being completed, the second argument is the word being completed, and the third argument is the word preceding the word being completed on the current command line. No filtering of the generated completions against the word being completed is performed; the function or command has complete freedom in generating the matches.
fr: Après que ces correspondances ont été produites, toute fonction de l'interpréteur ou commande spécifiée avec les options B<-F> et B<-C> est appelée. Lorsque la commande ou la fonction est appelée, les variables E<.SM B<COMP_LINE>> et E<.SM B<COMP_POINT>> se voient affectées de valeurs comme décrit plus haut dans B<Variables de l'interpréteur>. Si une fonction de l'interpréteur est appelée, les variables E<.SM B<COMP_WORDS>> et E<.SM B<COMP_CWORD>> sont également créées. Lorsqu'une fonction ou une commande est appelée, le premier argument est le nom de la commande dont les arguments doivent être complétés, le second argument est le mot à compléter et le troisième argument est le mot précédent celui devant être complété sur la ligne de commande. Aucun filtrage des complètements produits pour le mot à compléter n'est effectué ; la fonction ou la commande a toute liberté dans la production des correspondances.

source: Any function specified with B<-F> is invoked first. The function may use any of the shell facilities, including the B<compgen> builtin described below, to generate the matches. It must put the possible completions in the E<.SM> B<COMPREPLY> array variable.
fr: Toute fonction appelée avec B<-F> est appelée en premier. La fonction peut utiliser tous les outils de l'interpréteur, incluant la commande interne B<compgen> décrite plus bas, pour produire les correspondances. Elle doit mettre les complètements possibles dans la variable tableau E<.SM B<COMPREPLY>.>

source: Next, any command specified with the B<-C> option is invoked in an environment equivalent to command substitution. It should print a list of completions, one per line, to the standard output. Backslash may be used to escape a newline, if necessary.
fr: Ensuite, toute commande spécifiée avec l'option B<-C> est appelée dans un environnement équivalent à la substitution de commande. Elle devrait afficher une liste des complètements possibles, une par ligne, sur la sortie standard. Si nécessaire, une contre-oblique peut être utilisée pour protéger un caractère de saut de ligne.

source: After all of the possible completions are generated, any filter specified with the B<-X> option is applied to the list. The filter is a pattern as used for pathname expansion; a B<&> in the pattern is replaced with the text of the word being completed. A literal B<&> may be escaped with a backslash; the backslash is removed before attempting a match. Any completion that matches the pattern will be removed from the list. A leading B<!> negates the pattern; in this case any completion not matching the pattern will be removed.
fr: Après que tous les complètements possibles ont été produits, un filtre, spécifié avec l'option B<-X>, est appliqué à la liste. Ce filtre est un motif comme utilisé dans le développement des chemins ; un B<&> dans le motif est remplacé par le texte du mot en cours de complètement. Un B<&> littéral peut être protégé par une contre-oblique ; la contre-oblique est supprimée avant la tentative de mise en correspondance. Tout complètement qui correspond au motif sera retirée de la liste. Un B<!> au début du motif provoque la négation de ce motif ; dans ce cas, tout complètement ne correspondant pas au motif sera retiré de la liste.

source: Finally, any prefix and suffix specified with the B<-P> and B<-S> options are added to each member of the completion list, and the result is returned to the readline completion code as the list of possible completions.
fr: Finalement, tous préfixe et suffixe spécifiés avec les options B<-P> et B<-S> sont ajoutés à chacun des éléments de la liste de complètement et le résultat est renvoyé au programme de complètement de readline comme étant la liste des complètements possibles.

source: If the previously-applied actions do not generate any matches, and the B<-o dirnames> option was supplied to B<complete> when the compspec was defined, directory name completion is attempted.
fr: Si les opérations précédemment appliquées ne produisent aucune correspondance, et si l'option B<-o dirnames> a été fournie à B<complete> lorsque la spécification de complètement a été définie, le complètement des noms de répertoire est tenté.

source: If the B<-o plusdirs> option was supplied to B<complete> when the compspec was defined, directory name completion is attempted and any matches are added to the results of the other actions.
fr: Si l'option B<-o plusdirs> a été fournie à B<complete> lors de la définition de la spécification de complètement, le complètement des noms de répertoires est tenté et toute correspondance est ajoutée aux résultats des autres actions.

source: By default, if a compspec is found, whatever it generates is returned to the completion code as the full set of possible completions. The default B<bash> completions are not attempted, and the readline default of filename completion is disabled. If the B<-o bashdefault> option was supplied to B<complete> when the compspec was defined, the B<bash> default completions are attempted if the compspec generates no matches. If the B<-o default> option was supplied to B<complete> when the compspec was defined, readline's default completion will be performed if the compspec (and, if attempted, the default B<bash> completions) generate no matches.
fr: Par défaut, si une spécification de complètement est trouvée, tout ce qu'elle produit est renvoyé au programme de complètement comme un jeu complet des complètements possibles. Les complètements par défaut de B<bash> ne sont pas tentés et le complètement par défaut de readline ou le complètement de fichiers est déactivé. Si l'option B<-o bashdefault> a été fournie à B<complete> lors de la définition de la spécification de complètement, les complètements par défaut de B<bash> sont tentés si la spécification de complètement ne produit aucune correspondance. Si l'option B<-o default> a été fournie à B<complete> lors de la définition de la spécification de complètement, le complètement par défaut de readline sera effectué si la spécification de complètement (et, si tentés, les complètements par défaut de B<bash>) ne produise(nt) aucune correspondance.

source: When a compspec indicates that directory name completion is desired, the programmable completion functions force readline to append a slash to completed names which are symbolic links to directories, subject to the value of the B<mark-directories> readline variable, regardless of the setting of the B<mark-symlinked-directories> readline variable.
fr: Lorsqu'une spécification de complètement indique qu'un complètement de nom de répertoire est souhaité, les fonctions de complètement programmable forcent readline à ajouter une barre oblique pour compléter les noms qui sont des liens symboliques vers des répertoires, selon la valeur de la variable B<mark-directories> de readline, indépendamment du paramétrage de la variable B<mark-symlinked-directories> de readline.

source: HISTORY
fr: HISTORIQUE

source: When the B<-o history> option to the B<set> builtin is enabled, the shell provides access to the I<command history>, the list of commands previously typed. The value of the B<HISTSIZE> variable is used as the number of commands to save in a history list. The text of the last E<.SM> B<HISTSIZE> commands (default 500) is saved. The shell stores each command in the history list prior to parameter and variable expansion (see E<.SM> B<EXPANSION> above) but after history expansion is performed, subject to the values of the shell variables E<.SM> B<HISTIGNORE> and E<.SM> B<HISTCONTROL>.
fr: Quand l'option B<-o history> de la commande interne B<set> est activée, l'interpréteur donne accès à un I<historique des commandes>, c'est-à-dire la liste des commandes précédemment utilisées. La valeur de la variable B<HISTSIZE> est utilisée comme le nombre de commandes à sauvegarder dans la file d'historique. Le texte des E<.SM B<HISTSIZE>> dernières commandes (par défaut 500) est sauvegardé. L'interpréteur conserve chaque commande dans la file d'historique avant le développement des paramètres et des variables (voir E<.SM B<DÉVELOPPEMENTS>> plus haut) mais après avoir effectué le développement de l'historique, selon les valeurs des variables de l'interpréteur E<.SM B<HISTIGNORE>> et E<.SM B<HISTCONTROL>.>
