Repository: bigon/manpages-fr-extra
Catalog: bash/po4a/po/*.po
Languages: fr

source: Return a status of 0 or 1 depending on the evaluation of the conditional expression I<expr>. Each operator and operand must be a separate argument. Expressions are composed of the primaries described above under E<.SM> B<CONDITIONAL EXPRESSIONS>. B<test> does not accept any options, nor does it accept and ignore an argument of B<--> as signifying the end of options.
fr: Renvoie un état de 0 ou 1 selon l'évaluation de la condition I<expr>. Chaque opérateur et opérande doit être représenté par un argument distinct. Les conditions sont composées des primitives décrites plus haut dans E<.SM B<CONDITIONS>.> B<test> n'accepte aucune option, n'accepte pas non plus et ignore l'argument B<--> signifiant la fin des options.

source: Expressions may be combined using the following operators, listed in decreasing order of precedence.
fr: Les conditions peuvent être combinées avec les opérateurs suivant, décrits par ordre de priorité décroissante.

source: True if I<expr> is false.
fr: Vrai si I<expr> est fausse.

source: Returns the value of I<expr>. This may be used to override the normal precedence of operators.
fr: Renvoie la valeur de I<expr>. Peut servir à surpasser la priorité normale des opérateurs.

source: True if both I<expr1> and I<expr2> are true.
fr: Vrai si I<expr1> et I<expr2> sont toutes deux vraies.

source: True if either I<expr1> or I<expr2> is true.
fr: Vrai si I<expr1> ou I<expr2> est vraie.

source: B<test> and B<[> evaluate conditional expressions using a set of rules based on the number of arguments.
fr: B<test> et B<[> évaluent les conditions en fonction d'un jeu de règles dépendant du nombre d'arguments.

source: 0 arguments
fr: 0 argument

source: The expression is false.
fr: La condition est fausse.

source: The expression is true if and only if the argument is not null.
fr: La condition est vraie si et seulement si l'argument n'est pas vide.

source: If the first argument is B<!>, the expression is true if and only if the second argument is null. If the first argument is one of the unary conditional operators listed above under E<.SM> B<CONDITIONAL EXPRESSIONS>, the expression is true if the unary test is true. If the first argument is not a valid unary conditional operator, the expression is false.
fr: Si le premier argument est B<!>, la condition est vraie si et seulement si le second argument est vide. Si le premier argument est l'un des opérateurs conditionnel unaires décrits plus haut dans E<.SM B<CONDITIONS>> la condition est vraie si le test unaire est vrai. Si le premier argument n'est pas un opérateur conditionnel unaire correct, la condition est fausse.

source: If the second argument is one of the binary conditional operators listed above under E<.SM> B<CONDITIONAL EXPRESSIONS>, the result of the expression is the result of the binary test using the first and third arguments as operands. If the first argument is B<!>, the value is the negation of the two-argument test using the second and third arguments. If the first argument is exactly B<(> and the third argument is exactly B<)>, the result is the one-argument test of the second argument. Otherwise, the expression is false. The B<-a> and B<-o> operators are considered binary operators in this case.
fr: Si le second argument est l'un des opérateurs conditionnels binaires décrits plus haut dans E<.SM B<CONDITIONS>,> le résultat de la condition est le résultat du test binaire utilisant le premier et le troisième argument en tant qu'opérandes. Si le premier argument est B<!>, la valeur est la négation du test binaire utilisant les deuxième et troisième arguments. Si le premier argument est exactement B<(> et le troisième argument est exactement B<)>, le résultat est le test unaire du second argument. Sinon la condition est fausse. Les opérateurs B<-a> et B<-o> sont considérés comme des opérateurs binaires dans ce cas.

source: If the first argument is B<!>, the result is the negation of the three-argument expression composed of the remaining arguments. Otherwise, the expression is parsed and evaluated according to precedence using the rules listed above.
fr: Si le premier argument est B<!>, le résultat est la négation de la condition à trois arguments composée des arguments restants. Sinon la condition est analysée et évaluée selon les règles de priorité décrites ci-dessus.

source: 5 or more arguments
fr: 5 arguments ou plus

source: The expression is parsed and evaluated according to precedence using the rules listed above.
fr: La condition est analysée et évaluée selon les règles de priorité décrites ci-dessus.

source: Print the accumulated user and system times for the shell and for processes run from the shell. The return status is 0.
fr: Affiche les durées cumulées utilisateur et système pour l'interpréteur et les processus lancés par cet interpréteur. L'état renvoyé est 0.

source: The command I<arg> is to be read and executed when the shell receives signal(s) I<sigspec>. If I<arg> is absent (and there is a single I<sigspec>) or B<->, each specified signal is reset to its original disposition (the value it had upon entrance to the shell). If I<arg> is the null string the signal specified by each I<sigspec> is ignored by the shell and by the commands it invokes. If I<arg> is not present and B<-p> has been supplied, then the trap commands associated with each I<sigspec> are displayed. If no arguments are supplied or if only B<-p> is given, B<trap> prints the list of commands associated with each signal. The B<-l> option causes the shell to print a list of signal names and their corresponding numbers. Each I<sigspec> is either a signal name defined in E<lt>I<signal.h>E<gt>, or a signal number. Signal names are case insensitive and the SIG prefix is optional. If a I<sigspec> is E<.SM> B<EXIT> (0) the command I<arg> is executed on exit from the shell. If a I<sigspec> is E<.SM> B<DEBUG>, the command I<arg> is executed before every I<simple command>, I<for> command, I<case> command, I<select> command, every arithmetic I<for> command, and before the first command executes in a shell function (see E<.SM> B<SHELL GRAMMAR> above). Refer to the description of the B<extdebug> option to the B<shopt> builtin for details of its effect on the B<DEBUG> trap. If a I<sigspec> is E<.SM> B<ERR>, the command I<arg> is executed whenever a simple command has a non-zero exit status, subject to the following conditions. The E<.SM> B<ERR> trap is not executed if the failed command is part of the command list immediately following a B<while> or B<until> keyword, part of the test in an I<if> statement, part of a B<&&> or B<\(bv\(bv> list, or if the command's return value is being inverted via B<!>. These are the same conditions obeyed by the B<errexit> option. If a I<sigspec> is E<.SM> B<RETURN>, the command I<arg> is executed each time a shell function or a script executed with the B<.> or B<source> builtins finishes executing. Signals ignored upon entry to the shell cannot be trapped or reset. Trapped signals are reset to their original values in a child process when it is created. The return status is false if any I<sigspec> is invalid; otherwise B<trap> returns true.
fr: La commande I<arg> sera lue et exécutée lorsque l'interpréteur reçoit l'un des signaux I<sigspec>. Si I<arg> est absent (et qu'il n'y a qu'un I<sigspec>) ou s'il est B<->, chaque signal spécifié est réinitialisé dans son état d'origine (la valeur qu'il avait au démarrage de l'interpréteur). Si I<arg> est la chaîne vide, le signal spécifié par chaque I<sigspec> est ignoré par l'interpréteur et par les commandes qu'il appelle. Si I<arg> est absent et si B<-p> a été fournie alors les commandes de captures associées à chacun des I<sigspec> sont affichées. Si aucun argument n'est fourni ou si seulement B<-p> est indiqué, B<trap> affiche la liste des commandes associées à chaque signal. L'option B<-l> conduit l'interpréteur à afficher une liste de noms de signaux et leurs numéros correspondants. Chaque I<sigspec> est soit un nom de signal défini dans E<lt>I<signal.h>E<gt> ou un numéro de signal. Les noms de signaux sont insensible à la casse et le préfixe SIG est facultatif. Si un I<sigspec> est E<.SM B<EXIT>> (0) la commande I<arg> est exécutée quand l'interpréteur termine. Si un I<sigspec> est E<.SM B<DEBUG>,> la commande I<arg> est exécutée avant chaque I<commande simple>, commande I<for>, commande I<case>, commande I<select>, chaque commande I<for> arithmétique et avant que la première commande soit exécutée dans une fonction de l'interpréteur (voir plus haut E<.SM B<GRAMMAIRE DE L'INTERPRÉTEUR>>). Se référer à la description de l'option B<extdebug> de la commande interne B<shopt> pour les détails de son effet sur la capture de B<DEBUG>. Si un I<sigspec> est E<.SM B<ERR>,> la commande I<arg> est exécutée chaque fois qu'une commande simple a un état final différent de zéro, selon les conditions suivantes. La capture de E<.SM B<ERR>> n'est pas exécutée si la commande qui a échoué fait partie d'une liste de commandes suivant immédiatement un mot-clef B<while> ou B<until>, un test d'un I<if>, d'un B<&&> ou d'une liste B<\(bv\(bv> ou si la valeur renvoyée par la commande est inversée par B<!>. Ce sont les mêmes conditions que pour l'option B<errexit>. Si un I<sigspec> est E<.SM B<RETURN>,> la commande I<arg> est exécutée chaque fois qu'une fonction de l'interpréteur ou un script exécuté par les commandes internes B<.> ou B<source> finit son exécution. Les signaux ignorés lors de l'appel de l'interpréteur ne peuvent être capturés ni réinitialisés. Les captures sont réinitialisées à leurs valeurs originelles dans un processus enfant lors de sa création. L'état renvoyé est faux si l'un des I<sigspec> est incorrect, sinon B<trap> renvoie vrai.

source: B<type> [B<-aftpP>] I<name> [I<name> ...]
fr: B<type> [B<-aftpP>] I<nom> [I<nom> ...]

source: With no options, indicate how each I<name> would be interpreted if used as a command name. If the B<-t> option is used, B<type> prints a string which is one of I<alias>, I<keyword>, I<function>, I<builtin>, or I<file> if I<name> is an alias, shell reserved word, function, builtin, or disk file, respectively. If the I<name> is not found, then nothing is printed, and an exit status of false is returned. If the B<-p> option is used, B<type> either returns the name of the disk file that would be executed if I<name> were specified as a command name, or nothing if
fr: Sans option, indique comment chaque I<nom> doit être interprété si on l'utilise en nom de commande. Si l'attribut B<-t> est utilisé, B<type> affiche une des phrases suivantes I<alias>, I<keyword>, I<function>, I<builtin> ou I<file> selon que le I<nom> est un alias, un mot-clé réservé de l'interpréteur, une fonction, une commande interne ou un fichier sur le disque. Si le I<nom> n'est pas trouvé, rien n'est affiché et un état final à faux est renvoyé. Si l'option B<-p> est utilisée, B<type> renvoie le nom du fichier qui sera exécuté si l'on tape le I<nom> en guise de commande ou rien si

source: would not return I<file>. The B<-P> option forces a E<.SM> B<PATH> search for each I<name>, even if
fr: ne renvoyait pas I<file>. L'option B<-P> force une recherche dans E<.SM B<PATH>> pour chaque I<nom>, même si

source: would not return I<file>. If a command is hashed, B<-p> and B<-P> print the hashed value, not necessarily the file that appears first in E<.SM> B<PATH>. If the B<-a> option is used, B<type> prints all of the places that contain an executable named I<name>. This includes aliases and functions, if and only if the B<-p> option is not also used. The table of hashed commands is not consulted when using B<-a>. The B<-f> option suppresses shell function lookup, as with the B<command> builtin. B<type> returns true if any of the arguments are found, false if none are found.
fr: ne renvoyait pas I<file>. Si une commande est disponible dans la table de hachage, B<-p> et B<-P> affichent la valeur de cette table, qui n'est pas nécessairement le fichier apparaissant en premier dans le E<.SM B<PATH>.> Si l'option B<-a> est appelée, B<type> affiche tous les emplacements contenant un exécutable du I<nom> indiqué. Ceci inclut les alias et les fonctions, sauf si l'option B<-p> est également présente. La table de hachage des commandes n'est pas consultée avec l'option B<-a>. L'option B<-f> supprime la fonction de l'interpréteur de consultation de table, comme avec la commande interne B<command>. B<type> renvoie vrai si l'un des arguments est trouvé et faux si aucun n'a été trouvé.

source: B<ulimit> [B<-SHacdefilmnpqrstuvx> [I<limit>]]
fr: B<ulimit> [B<-SHacdefilmnpqrstuvx> [I<limitation>]]

source: Provides control over the resources available to the shell and to processes started by it, on systems that allow such control. The B<-H> and B<-S> options specify that the hard or soft limit is set for the given resource. A hard limit cannot be increased once it is set; a soft limit may be increased up to the value of the hard limit. If neither B<-H> nor B<-S> is specified, both the soft and hard limits are set. The value of I<limit> can be a number in the unit specified for the resource or one of the special values B<hard>, B<soft>, or B<unlimited>, which stand for the current hard limit, the current soft limit, and no limit, respectively. If I<limit> is omitted, the current value of the soft limit of the resource is printed, unless the B<-H> option is given. When more than one resource is specified, the limit name and unit are printed before the value. Other options are interpreted as follows:
fr: Fournit, sur les systèmes qui le permettent, un mécanisme de contrôle des ressources disponibles pour l'interpréteur et pour les processus qu'il lance. Les options B<-H> et B<-S> spécifient si la limitation est stricte (hard) ou flexible (soft) pour la ressource indiquée. Une limitation stricte ne peut pas être augmentée une fois qu'elle a été mise ; une limitation flexible peut être augmentée jusqu'à la valeur de la limitation stricte correspondante. Si ni B<-H> ni B<-S> n'est spécifié les limitations strictes et flexibles sont toutes deux mises. La valeur de la I<limitation> peut être un nombre (utilisant les unités particulières de la ressource) ou l'une des valeurs spéciales B<hard>, B<soft> ou B<unlimited>, qui signifient, respectivement, la limitation stricte courante, la limitation flexible courante et l'absence de limitation. Si la I<limitation> est omise, la valeur courante de la limitation flexible pour la ressource est affichée, sauf si l'option B<-H> est indiquée. Quand plusieurs ressources sont spécifiées, les noms des limitations et leurs unités sont affichés avant les valeurs. Les autres options sont interprétées comme suit :

source: All current limits are reported
fr: Toutes les limitations courantes sont signalées

source: The maximum size of core files created
fr: La taille maximum des fichiers core créés

source: The maximum size of a process's data segment
fr: La taille maximum du segment de données d'un processus

source: The maximum scheduling priority (`nice')
fr: La priorité d'ordonnancement maximum (« nice »)

source: The maximum size of files created by the shell
fr: La taille maximum d'un fichier créé par l'interpréteur

source: The maximum number of pending signals
fr: Le nombre maximum de signaux en attente

source: The maximum size that may be locked into memory
fr: La taille maximum qui peut être verrouillée en mémoire

source: The maximum resident set size
fr: La taille maximum de la partie résidente d'un processus

source: The maximum number of open file descriptors (most systems do not allow this value to be set)
fr: Le nombre maximum de descripteurs de fichiers ouverts (la plupart des systèmes ne permettent pas de modifier cette valeur)

source: The pipe size in 512-byte blocks (this may not be set)
fr: La taille d'un tube en blocs de 512 octets (parfois inexistante)

source: The maximum number of bytes in POSIX message queues
fr: Le nombre maximum d'octets dans les files de messages POSIX

source: The maximum rt priority
fr: La priorité rt maximum

source: The maximum stack size
fr: La taille maximum de la pile

source: The maximum amount of cpu time in seconds
fr: La durée maximum, en seconde, de temps CPU accordé à un processus

source: The maximum number of processes available to a single user
fr: Le nombre maximum de processus autorisés pour un seul utilisateur

source: The maximum amount of virtual memory available to the shell
fr: La quantité de mémoire virtuelle disponible pour l'interpréteur

source: The maximum number of file locks
fr: Le nombre maximum de verrous de fichiers

source: If I<limit> is given, it is the new value of the specified resource (the B<-a> option is display only). If no option is given, then B<-f> is assumed. Values are in 1024-byte increments, except for B<-t>, which is in seconds, B<-p>, which is in units of 512-byte blocks, and B<-n> and B<-u>, which are unscaled values. The return status is 0 unless an invalid option or argument is supplied, or an error occurs while setting a new limit.
fr: Si une I<limitation> est indiquée, elle sera la nouvelle valeur pour la ressource spécifiée (l'option B<-a> correspond à l'affichage seul). Si aucune option n'est indiquée alors B<-f> est supposée. Les valeurs s'expriment par pas de 1024 octets, sauf pour B<-t> qui est en secondes, B<-p>, qui utilise des unités de blocs de 512 octets, ainsi que B<-n> et B<-u>, qui n'ont pas d'unités. L'état renvoyé est 0 sauf si une option ou un argument incorrect est fourni ou si une erreur se produit en mettant la nouvelle limitation.

source: The user file-creation mask is set to I<mode>. If I<mode> begins with a digit, it is interpreted as an octal number; otherwise it is interpreted as a symbolic mode mask similar to that accepted by I<chmod>(1). If I<mode> is omitted, the current value of the mask is printed. The B<-S> option causes the mask to be printed in symbolic form; the default output is an octal number. If the B<-p> option is supplied, and I<mode> is omitted, the output is in a form that may be reused as input. The return status is 0 if the mode was successfully changed or if no I<mode> argument was supplied, and false otherwise.
fr: Le masque de création de fichier de l'utilisateur est mis à I<mode>. Si I<mode> commence par un chiffre, il est interprété comme un nombre octal, sinon il est considéré comme un masque symbolique, semblable à ceux acceptés par I<chmod>(1). Si I<mode> est omis ou si l'option B<-S> est fournie, la valeur courante du masque est affichée. L'option B<-S> conduit à l'affichage du masque sous forme symbolique, l'affichage par défaut étant en octal. Si l'option B<-p> est fournie et si le I<mode> est omis, la sortie a lieu dans un format réutilisable en entrée. L'état renvoyé est 0 si le mode a pu être changé correctement ou si aucun argument I<mode> n'a été fourni, et faux sinon.

source: B<unalias> [-B<a>] [I<name> ...]
fr: B<unalias> [-B<a>] [I<nom> ...]

source: Remove each I<name> from the list of defined aliases. If B<-a> is supplied, all alias definitions are removed. The return value is true unless a supplied I<name> is not a defined alias.
fr: Supprime le I<nom> de la liste des alias définis. Si l'option B<-a> est fournie, toutes les définitions d'alias sont supprimées. La valeur renvoyée est vrai sauf si un I<nom> fourni n'est pas un alias défini.

source: B<unset> [-B<fv>] [I<name> ...]
fr: B<unset> [-B<fv>] [I<nom> ...]

source: For each I<name>, remove the corresponding variable or function. If no options are supplied, or the B<-v> option is given, each I<name> refers to a shell variable. Read-only variables may not be unset. If B<-f> is specified, each I<name> refers to a shell function, and the function definition is removed. Each unset variable or function is removed from the environment passed to subsequent commands. If any of E<.SM> B<RANDOM>, E<.SM> B<SECONDS>, E<.SM> B<LINENO>, E<.SM> B<HISTCMD>, E<.SM> B<FUNCNAME>, E<.SM> B<GROUPS>, or E<.SM> B<DIRSTACK> are unset, they lose their special properties, even if they are subsequently reset. The exit status is true unless a I<name> is readonly.
fr: Pour chaque I<nom> indiqué, supprimer la variable ou la fonction correspondante. Si aucune option n'est fournie ou si l'option B<-v> est indiquée, chaque I<nom> se réfère à une variable de l'interpréteur. Les variables en lecture-seule ne peuvent pas être détruites. Si l'option B<-f> est spécifiée, chaque I<nom> se réfère à une fonction de l'interpréteur et la définition de la fonction est supprimée. Chaque variable ou fonction détruite est supprimée de l'environnement transmis aux commandes ultérieures. Si l'une des variables E<.SM B<RANDOM>,> E<.SM B<SECONDS>,> E<.SM B<LINENO>,> E<.SM B<HISTCMD>,> E<.SM B<FUNCNAME>,> E<.SM B<GROUPS>> ou E<.SM B<DIRSTACK>> est détruite, elle perd ses propriétés spécifiques, même s'il elle est recréée ultérieurement. L'état final est vrai, à moins qu'un des I<nom>s ne soit en lecture seule.

source: Wait for each specified process and return its termination status. Each I<n> may be a process ID or a job specification; if a job spec is given, all processes in that job's pipeline are waited for. If I<n> is not given, all currently active child processes are waited for, and the return status is zero. If I<n> specifies a non-existent process or job, the return status is 127. Otherwise, the return status is the exit status of the last process or job waited for.
fr: Attend que chaque processus spécifié termine et renvoie son état final. Chaque I<n> peut être un PID ou une spécification de tâche ; si une spécification de tâche est indiquée, la fin de tous les processus de la conduite de cette tâche sera attendue. Si I<n> est omis, la fin de tous les processus enfants actuellement actifs sera attendue et l'état renvoyé est zéro. Si I<n> spécifie un processus ou une tâche inexistants, l'état renvoyé est 127. Sinon, l'état renvoyé est l'état final du dernier processus ou tâche attendu.

source: RESTRICTED SHELL
fr: INTERPRÉTEUR RESTREINT

source: If B<bash> is started with the name B<rbash>, or the B<-r> option is supplied at invocation, the shell becomes restricted. A restricted shell is used to set up an environment more controlled than the standard shell. It behaves identically to B<bash> with the exception that the following are disallowed or not performed:
fr: Si B<bash> démarre sous le nom B<rbash> ou si l'option B<-r> est fournie lors de son appel, l'interpréteur devient restreint. Un interpréteur restreint permet de créer un environnement plus contrôlé qu'un interpréteur standard. Il se comporte de même façon que B<bash> à la différence des actions suivantes qui sont interdites ou non effectuées :

source: changing directories with B<cd>
fr: changer de répertoire avec B<cd>

source: setting or unsetting the values of B<SHELL>, B<PATH>, B<ENV>, or B<BASH_ENV>
fr: créer ou détruire les valeurs de B<SHELL>, B<PATH>, B<ENV> ou B<BASH_ENV>

source: specifying command names containing B</>
fr: indiquer des noms de commandes contenant un B</>

source: specifying a file name containing a B</> as an argument to the B<.> builtin command
fr: indiquer un nom de fichier contenant un B</> comme argument de la commande interne B<.> ;

source: Specifying a filename containing a slash as an argument to the B<-p> option to the B<hash> builtin command
fr: Spécifier un nom de fichier contenant une barre oblique comme argument de l'option B<-p> de la commande interne B<hash>

source: importing function definitions from the shell environment at startup
fr: importer une définition de fonction dans l'environnement au démarrage ;

source: parsing the value of B<SHELLOPTS> from the shell environment at startup
fr: analyser les valeurs de B<SHELLOPTS> au démarrage ;
