Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: specifying an engine (by its unique B<id> string) will cause B<speed> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.
fr: Indiquer un moteur (en utilisant son identifiant unique I<id>) forcera B<speed> à essayer d'obtenir une référence fonctionnelle pour le moteur indiqué et l'initialiser si nécessaire. Le moteur sera ensuite utilisé par défaut pour tous les algorithmes disponibles.

source: B<[zero or more test algorithms]>
fr: B<[zéro ou plusieurs algorithmes]>

source: If any options are given, B<speed> tests those algorithms, otherwise all of the above are tested.
fr: Si une des options est fournie, B<speed> testera ces algorithmes. Sinon, tous les algorithmes seront testés.

source: spkac - SPKAC printing and generating utility
fr: spkac - Utilitaire d'affichage et de génération de SPKAC

source: B<openssl> B<spkac> [B<-in filename>] [B<-out filename>] [B<-key keyfile>] [B<-passin arg>] [B<-challenge string>] [B<-pubkey>] [B<-spkac spkacname>] [B<-spksect section>] [B<-noout>] [B<-verify>] [B<-engine id>]
fr: B<openssl> B<spkac> [B<-in> I<nom_fichier>] [B<-out> I<nom_fichier>] [B<-key> I<fichier_clef>] [B<-passin> I<param>] [B<-challenge> I<chaîne>] [B<-pubkey>] [B<-spkac> I<nomspkac>] [B<-spksect> I<section>] [B<-noout>] [B<-verify>] [B<-engine> I<id>]

source: The B<spkac> command processes Netscape signed public key and challenge (SPKAC) files. It can print out their contents, verify the signature and produce its own SPKACs from a supplied private key.
fr: La commande B<spkac> analyse des fichiers signés de clefs publiques et défis de Netscape (SPKAC : « Signed Public Key And Challenge »). Elle peut afficher leur contenu, vérifier la signature et produire ses propres SPKAC à partir d'une clef privée.

source: This specifies the input filename to read from or standard input if this option is not specified. Ignored if the B<-key> option is used.
fr: Indiquer le fichier à lire en entrée. Par défaut, si cette option n'est pas utilisée, l'entrée standard sera lue. Cette option est ignorée si l'option B<-key> est utilisée.

source: specifies the output filename to write to or standard output by default.
fr: Le nom du fichier de sortie. Par défaut, la sortie standard est utilisée.

source: B<-key keyfile>
fr: B<-key> I<fichier_clef>

source: create an SPKAC file using the private key in B<keyfile>. The B<-in>, B<-noout>, B<-spksect> and B<-verify> options are ignored if present.
fr: Créer un fichier SPKAC en utilisant la clef privée B<fichier_clef>. Les options B<-in>, B<-noout>, B<-spksect> et B<-verify> sont ignorées si cette option est présente.

source: B<-passin password>
fr: B<-passin> I<param>

source: B<-challenge string>
fr: B<-challenge> I<chaîne>

source: specifies the challenge string if an SPKAC is being created.
fr: Indiquer la chaîne du défi si un SPKAC est créé.

source: B<-spkac spkacname>
fr: B<-spkac> I<nom_spkac>

source: allows an alternative name form the variable containing the SPKAC. The default is "SPKAC". This option affects both generated and input SPKAC files.
fr: Permettre un autre nom pour la variable qui contient le SPKAC. Par défaut, il s'agit de « SPKAC ». Cette option concerne à la fois les fichiers générés et les fichiers en entrée.

source: B<-spksect section>
fr: B<-spksect> I<section>

source: allows an alternative name form the section containing the SPKAC. The default is the default section.
fr: Permettre un autre nom pour la section contenant le SPKAC. Par défaut, il s'agit de la section « default ».

source: don't output the text version of the SPKAC (not used if an SPKAC is being created).
fr: Ne pas afficher la version textuelle du SPKAC (pas utilisé si un SPKAC est créé).

source: output the public key of an SPKAC (not used if an SPKAC is being created).
fr: Afficher la clef publique d'un SPKAC (pas utilisé si un SPKAC est créé).

source: verifies the digital signature on the supplied SPKAC.
fr: Vérifier la signature numérique du SPKAC fourni.

source: specifying an engine (by its unique B<id> string) will cause B<spkac> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.
fr: Indiquer un moteur (en utilisant son identifiant unique I<id>) forcera B<spkac> à essayer d'obtenir une référence fonctionnelle pour le moteur indiqué et l'initialiser si nécessaire. Le moteur sera ensuite utilisé par défaut pour tous les algorithmes disponibles.

source: Print out the contents of an SPKAC:
fr: Afficher le contenu d'un SPKAC :

source: Verify the signature of an SPKAC:
fr: Vérifier la signature d'un SPKAC :

source: Create an SPKAC using the challenge string "hello":
fr: Créer un SPKAC en utilisant la chaîne de défi « salut » :

source: openssl spkac -key key.pem -challenge hello -out spkac.cnf
fr: openssl spkac -key key.pem -challenge salut -out spkac.cnf

source: Example of an SPKAC, (long lines split up for clarity):
fr: Exemple d'un SPKAC, (les lignes longues ont été coupées pour plus de clarté) :

source: A created SPKAC with suitable DN components appended can be fed into the B<ca> utility.
fr: Un SPKAC créé avec l'ajout des bons composants DN peut être fourni à l'utilitaire B<ca>.

source: SPKACs are typically generated by Netscape when a form is submitted containing the B<KEYGEN> tag as part of the certificate enrollment process.
fr: Les SPKAC sont typiquement générés par Netscape quand un formulaire est soumis en contenant l'étiquette B<KEYGEN> dans le cadre d'un processus d'enrôlement de certificats.

source: The challenge string permits a primitive form of proof of possession of private key. By checking the SPKAC signature and a random challenge string some guarantee is given that the user knows the private key corresponding to the public key being certified. This is important in some applications. Without this it is possible for a previous SPKAC to be used in a "replay attack".
fr: La chaîne de défi permet une sorte de preuve primitive de la possession de la clef privée. En vérifiant la signature du SPKAC et un défi aléatoire, une certaine garantie est donnée que l'utilisateur connaît la clef privée correspondant à la clef publique qui est certifiée. C'est important pour certaines applications. Sans ce défi, il est possible de réutiliser un SPKAC précédent dans une « attaque par rejeu ».

source: L<ca(1)|ca(1)>
fr: L<B<ca>(1)|ca(1)>

source: ts - Time Stamping Authority tool (client/server)
fr: ts - Outil d’autorité d’horodatage (client et serveur)

source: B<openssl> B<ts> B<-query> [B<-rand> file:file...] [B<-config> configfile] [B<-data> file_to_hash] [B<-digest> digest_bytes] [B<-md2>|B<-md4>|B<-md5>|B<-sha>|B<-sha1>|B<-mdc2>|B<-ripemd160>|B<...>] [B<-policy> object_id] [B<-no_nonce>] [B<-cert>] [B<-in> request.tsq] [B<-out> request.tsq] [B<-text>]
fr: B<openssl ts -query> [B<-rand> I<fichier>B<:>I<fichier>...] [B<-config> I<fichier_conf>] [B<-data> I<fichier_à_hacher>] [B<-digest> I<octets_sign>] [B<-md2>|B<-md4>|B<-md5>|B<-sha>|B<-sha1>|B<-mdc2>|B<-ripemd160>|...] [B<-policy> I<id_objet>] [B<-no_nonce>] [B<-cert>] [B<-in> I<demande.tsq>] [B<-out> I<demande.tsq>] [B<-text>]

source: B<openssl> B<ts> B<-reply> [B<-config> configfile] [B<-section> tsa_section] [B<-queryfile> request.tsq] [B<-passin> password_src] [B<-signer> tsa_cert.pem] [B<-inkey> private.pem] [B<-chain> certs_file.pem] [B<-policy> object_id] [B<-in> response.tsr] [B<-token_in>] [B<-out> response.tsr] [B<-token_out>] [B<-text>] [B<-engine> id]
fr: B<openssl ts -reply> [B<-config> I<fichier_conf>] [B<section> I<section_tsa>] [B<-queryfile> I<demande.tsq>] [B<-passin> I<src_mot_de_passe>] [B<-signer> I<tsa_cert.pem>] [B<-inkey> I<privée.pem>] [B<-chain> I<fichier_certs.pem>] [B<-policy> I<id_objet>] [B<-in> I<réponse.tsr>] [B<-token_in>] [B<-out> I<response.tsr>] [B<-token_out>] [B<-text>] [B<-engine> I<id>]

source: B<openssl> B<ts> B<-verify> [B<-data> file_to_hash] [B<-digest> digest_bytes] [B<-queryfile> request.tsq] [B<-in> response.tsr] [B<-token_in>] [B<-CApath> trusted_cert_path] [B<-CAfile> trusted_certs.pem] [B<-untrusted> cert_file.pem]
fr: B<openssl ts -verify> [B<-data> I<fichier_à_hacher>] [B<-digest> I<octets_sign>] [B<-queryfile> I<demande.tsq>] [B<-in> I<réponse.tsr>] [B<-token_in>] [B<-CApath> I<chemin_cert_confiance>] [B<-CAfile> I<certs_confiance.pem>] [B<-untrusted> I<fichier_cert.pem>]

source: The B<ts> command is a basic Time Stamping Authority (TSA) client and server application as specified in RFC 3161 (Time-Stamp Protocol, TSP). A TSA can be part of a PKI deployment and its role is to provide long term proof of the existence of a certain datum before a particular time. Here is a brief description of the protocol:
fr: La commande B<ts> est une application client et serveur d’autorité d’horodatage (« Time Stamping Authority », TSA) conforme à la RFC 3161 (protocole d'horodatage, « Time-Stamp Protocol » TSP). Une TSA peut faire partie d'un déploiement de PKI et son rôle est de fournir des preuves à long terme de l'existence d'une certaine donnée avant un moment donné. Voici une brève description du protocole.

source: The TSA client computes a one-way hash value for a data file and sends the hash to the TSA.
fr: Le client TSA calcule une valeur de hachage à sens unique pour un fichier de données et envoie le hachage à la TSA.

source: The TSA attaches the current date and time to the received hash value, signs them and sends the time stamp token back to the client. By creating this token the TSA certifies the existence of the original data file at the time of response generation.
fr: La TSA attache la date et l'heure à la valeur de hachage reçue, les signe et envoie le jeton d’horodatage au client. En créant ce jeton, la TSA certifie l'existence du fichier original de données au moment où la réponse est créée.

source: The TSA client receives the time stamp token and verifies the signature on it. It also checks if the token contains the same hash value that it had sent to the TSA.
fr: Le client TSA reçoit le jeton d'horodatage et en vérifie la signature. Il vérifie également si le jeton contient la même valeur de hachage qu'il avait envoyé à la TSA.

source: There is one DER encoded protocol data unit defined for transporting a time stamp request to the TSA and one for sending the time stamp response back to the client. The B<ts> command has three main functions: creating a time stamp request based on a data file, creating a time stamp response based on a request, verifying if a response corresponds to a particular request or a data file.
fr: Une unité de données de protocole encodée DER est définie pour le transport d'une demande d'horodatage à la TSA et une autre pour l'envoi de la réponse d'horodatage au client. La commande B<ts> a trois fonctions principales : créer une demande d'horodatage à partir d'un fichier de données, créer une réponse d'horodatage à partir d'une demande et vérifier si une réponse correspond à une demande particulière ou à un fichier de données.

source: There is no support for sending the requests/responses automatically over HTTP or TCP yet as suggested in RFC 3161. The users must send the requests either by ftp or e-mail.
fr: Aucune prise en charge n’existe encore pour l’envoi de demandes et réponses automatiquement par HTTP ou TCP comme suggéré dans la RFC 3161. Les utilisateurs doivent envoyer les demandes par FTP ou courrier électronique.

source: Time Stamp Request generation
fr: Création de demande d’horodatage

source: The B<-query> switch can be used for creating and printing a time stamp request with the following options:
fr: L’option B<-query> peut être utilisée pour créer et afficher une demande d'horodatage avec les options suivantes :

source: B<-rand> file:file...
fr: B<-rand> I<fichier>B<:>I<fichier>...

source: The files containing random data for seeding the random number generator. Multiple files can be specified, the separator is B<;> for MS-Windows, B<,> for VMS and B<:> for all other platforms. (Optional)
fr: Les fichiers contenant des données aléatoires utilisées pour initialiser le générateur de nombres pseudoaléatoires. Plusieurs fichiers peuvent être indiqués en utilisant le séparateur du système d'exploitation : « B<;> » pour Windows, « B<,> » pour OpenVMS et « B<:> » pour tous les autres. (Facultatif)

source: B<-config> configfile
fr: B<-config> I<fichier_conf>

source: The configuration file to use, this option overrides the B<OPENSSL_CONF> environment variable. Only the OID section of the config file is used with the B<-query> command. (Optional)
fr: Le fichier de configuration à utiliser, cette option remplace la variable d'environnement B<OPENSSL_CONF>. Seule la section OID du fichier de configuration est utilisée avec la commande B<-query>. (Facultatif)

source: B<-data> file_to_hash
fr: B<-data> I<fichier_à_hacher>

source: The data file for which the time stamp request needs to be created. stdin is the default if neither the B<-data> nor the B<-digest> parameter is specified. (Optional)
fr: Le fichier de données pour lequel la demande d'horodatage doit être créée. L’entrée standard est la valeur par défaut si aucune des options B<-data> ou B<-digest> n’est indiquée. (Facultatif)

source: B<-digest> digest_bytes
fr: B<-digest> I<octets_sign>

source: It is possible to specify the message imprint explicitly without the data file. The imprint must be specified in a hexadecimal format, two characters per byte, the bytes optionally separated by colons (e.g. 1A:F6:01:... or 1AF601...). The number of bytes must match the message digest algorithm in use. (Optional)
fr: Indiquer explicitement l’empreinte du message est possible sans le fichier de données. L’empreinte doit être indiquée au format hexadécimal, deux caractères par octet, les octets éventuellement séparés par des deux-points (par exemple 1A:F6:01:... ou 1AF601...). Le nombre d’octets doit correspondre à l’algorithme de signature de message utilisé. (Facultatif)

source: B<-md2>|B<-md4>|B<-md5>|B<-sha>|B<-sha1>|B<-mdc2>|B<-ripemd160>|B<...>
fr: B<-md2>|B<-md4>|B<-md5>|B<-sha>|B<-sha1>|B<-mdc2>|B<-ripemd160>|...

source: The message digest to apply to the data file, it supports all the message digest algorithms that are supported by the openssl B<dgst> command. The default is SHA-1. (Optional)
fr: La signature de message à appliquer au fichier de données, tous les algorithmes de signature de message pris en charge par la commande openssl B<dgst> sont utilisables. La valeur par défaut est SHA-1. (Facultatif)

source: B<-policy> object_id
fr: B<policy> I<id_objet>

source: The policy that the client expects the TSA to use for creating the time stamp token. Either the dotted OID notation or OID names defined in the config file can be used. If no policy is requested the TSA will use its own default policy. (Optional)
fr: La politique attendue par le client de la TSA à utiliser pour créer le jeton d'horodatage. Soit la notation OID avec points, soit les noms d’OID définis dans le fichier de configuration peuvent être utilisés. Si aucune politique n’est demandée, la TSA utilisera sa propre politique par défaut. (Facultatif)

source: No nonce is specified in the request if this option is given. Otherwise a 64 bit long pseudo-random none is included in the request. It is recommended to use nonce to protect against replay-attacks. (Optional)
fr: Aucun nonce n’est indiqué dans la demande si cette option est donnée. Sinon, un nonce pseudoaléatoire de 64 bits est inclus dans la demande. Utiliser nonce est recommandé pour se protéger contre les attaques par rejeu. (Facultatif)

source: The TSA is expected to include its signing certificate in the response. (Optional)
fr: La TSA devrait inclure son certificat de signature dans la réponse. (Facultatif)

source: B<-in> request.tsq
fr: B<-in> I<demande.tsq>

source: This option specifies a previously created time stamp request in DER format that will be printed into the output file. Useful when you need to examine the content of a request in human-readable
fr: Cette option indique une demande d'horodatage précédemment créée au format DER qui sera envoyée dans le fichier de sortie. Utile pour examiner le contenu d'une demande au format lisible. (Facultatif)

source: B<-out> request.tsq
fr: B<-out> I<demande.tsq>

source: Name of the output file to which the request will be written. Default is stdout. (Optional)
fr: Nom du fichier de sortie où la demande doit être écrite. La sortie standard par défaut. (Facultatif)

source: If this option is specified the output is human-readable text format instead of DER. (Optional)
fr: Si cette option est indiquée, la sortie est au format texte lisible au lieu de DER. (Facultatif)

source: Time Stamp Response generation
fr: Création de réponse d’horodatage

source: A time stamp response (TimeStampResp) consists of a response status and the time stamp token itself (ContentInfo), if the token generation was successful. The B<-reply> command is for creating a time stamp response or time stamp token based on a request and printing the response/token in human-readable format. If B<-token_out> is not specified the output is always a time stamp response (TimeStampResp), otherwise it is a time stamp token (ContentInfo).
fr: Une réponse d’horodatage (TimeStampResp) se compose d'un état de réponse et du jeton d'horodatage lui-même (ContentInfo), si la création du jeton a réussi. La commande B<-reply> permet de créer une réponse d'horodatage ou un jeton d'horodatage suivant la demande et l’affichage de la réponse ou du jeton dans un format lisible. Si B<-token_out> n'est pas indiqué, la sortie est toujours une réponse d'horodatage (TimeStampResp), sinon c'est un jeton d'horodatage (ContentInfo).

source: The configuration file to use, this option overrides the B<OPENSSL_CONF> environment variable. See B<CONFIGURATION FILE OPTIONS> for configurable variables. (Optional)
fr: Le fichier de configuration à utiliser, cette option remplace la variable d'environnement B<OPENSSL_CONF>. Consultez B<OPTIONS DU FICHIER DE CONFIGURATION> pour les variables configurables. (Facultatif)

source: B<-section> tsa_section
fr: B<-spksect> I<section>

source: The name of the config file section conatining the settings for the response generation. If not specified the default TSA section is used, see B<CONFIGURATION FILE OPTIONS> for details. (Optional)
fr: Le nom de la section du fichier de configuration contenant les paramètres pour la création de la réponse. S'il n'est pas indiqué, la section TSA par défaut est utilisée, consultez B<OPTIONS DU FICHIER DE CONFIGURATION> pour plus de précisions. (Facultatif)

source: B<-queryfile> request.tsq
fr: B<-queryfile> I<demande.tsq>

source: The name of the file containing a DER encoded time stamp request. (Optional)
fr: Le nom du fichier contenant une demande d’horodatage encodée en DER. (Facultatif)

source: B<-passin> password_src
fr: B<-passin> I<src_mot_de_passe>

source: Specifies the password source for the private key of the TSA. See B<PASS PHRASE ARGUMENTS> in L<openssl(1)|openssl(1)>. (Optional)
fr: Indiquer la source pour la clef privée de la TSA. Consultez la section B<PARAMÈTRES DE PHRASE SECRÈTE> d'L<B<openssl>(1)|openssl(1)>.

source: B<-signer> tsa_cert.pem
fr: B<-signer> I<tsa_cert.pem>

source: The signer certificate of the TSA in PEM format. The TSA signing certificate must have exactly one extended key usage assigned to it: timeStamping. The extended key usage must also be critical, otherwise the certificate is going to be refused. Overrides the B<signer_cert> variable of the config file. (Optional)
fr: Le certificat de signataire de la TSA au format PEM. Le certificat de signature TSA doit avoir exactement une utilisation de clef étendue attribuée : timeStamping. L'utilisation de la clef étendue doit aussi être critique, sinon le certificat sera refusé. Cela remplace la variable B<signer_cert> du fichier de configuration. (Facultatif)

source: B<-inkey> private.pem
fr: B<-inkey> I<privée.pem>

source: The signer private key of the TSA in PEM format. Overrides the B<signer_key> config file option. (Optional)
fr: La clef privée du signataire de la TSA au format PEM. Cela remplace l'option B<signer_key> du fichier de configuration. (Facultatif)

source: B<-chain> certs_file.pem
fr: B<-chain> I<fichier_certs.pem>

source: The collection of certificates in PEM format that will all be included in the response in addition to the signer certificate if the B<-cert> option was used for the request. This file is supposed to contain the certificate chain for the signer certificate from its issuer upwards. The B<-reply> command does not build a certificate chain automatically. (Optional)
fr: L’ensemble des certificats au format PEM qui seront tous inclus dans la réponse en plus du certificat de signataire si l'option B<-cert> a été utilisée pour la demande. Ce fichier est censé contenir la chaîne de certificats pour le certificat de signataire à partir de ses émetteurs. La commande B<-reply> ne construit pas de chaîne de certificats automatiquement. (Facultatif)

source: The default policy to use for the response unless the client explicitly requires a particular TSA policy. The OID can be specified either in dotted notation or with its name. Overrides the B<default_policy> config file option. (Optional)
fr: La politique par défaut à utiliser pour la réponse à moins que le client ne demande explicitement une politique TSA particulière. L'OID peut être indiqué en utilisant une notation avec points ou par son nom. Cela remplace l'option B<default_policy> du fichier de configuration. (Facultatif)

source: B<-in> response.tsr
fr: B<-in> I<réponse.tsr>

source: Specifies a previously created time stamp response or time stamp token (if B<-token_in> is also specified) in DER format that will be written to the output file. This option does not require a request, it is useful e.g. when you need to examine the content of a response or token or you want to extract the time stamp token from a response. If the input is a token and the output is a time stamp response a default 'granted' status info is added to the token. (Optional)
fr: Indiquer une réponse d'horodatage créée précédemment ou un jeton d'horodatage (si B<-token_in> est également indiquée) au format DER qui sera écrit dans le fichier de sortie. Cette option ne nécessite pas de demande, elle est par exemple utile pour examiner le contenu d'une réponse ou d'un jeton ou pour extraire le jeton d'horodatage d'une réponse. Si l'entrée est un jeton et la sortie une réponse d'horodatage, une information d’état accordée (« granted ») par défaut est ajoutée au jeton. (Facultatif)

source: This flag can be used together with the B<-in> option and indicates that the input is a DER encoded time stamp token (ContentInfo) instead of a time stamp response (TimeStampResp). (Optional)
fr: Cet indicateur peut être utilisé avec l'option B<-in> et indique que l'entrée est un jeton d'horodatage encodé DER (ContentInfo) au lieu d'une réponse d'horodatage (TimeStampResp). (Facultatif)

source: B<-out> response.tsr
fr: B<-out> I<réponse.tsr>

source: The response is written to this file. The format and content of the file depends on other options (see B<-text>, B<-token_out>). The default is stdout. (Optional)
fr: La réponse est écrite dans ce fichier. Le format et le contenu du fichier dépendent d'autres options (consultez B<-text>, B<-token_out>). La valeur par défaut est la sortie standard. (Facultatif)
