Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: This option can be specified only when just one request is sent to the server. The time stamp response will be written to the given output file. '-' means standard output. In case of multiple time stamp requests or the absence of this argument the names of the output files will be derived from the names of the input files and the default or specified extension argument. (Optional)
fr: Cette option ne peut être indiquée que si une seule requête est envoyée au serveur. La réponse d'horodatage sera écrite dans le fichier de sortie donné. « - » signifie la sortie standard. Dans le cas de plusieurs demandes d'horodatage ou d'absence de cet argument, les noms des fichiers de sortie seront déduits des noms des fichiers d'entrée et de l’argument d’extension par défaut ou indiqué. (Facultatif)

source: The name of the currently processed request is printed on standard error. (Optional)
fr: Le nom de la demande en cours de traitement est affiché sur la sortie d’erreur standard. (Facultatif)

source: Switches on verbose mode for the underlying B<curl> library. You can see detailed debug messages for the connection. (Optional)
fr: Activer le mode bavard de la bibliothèque B<curl> sous-jacente. Les messages détaillés de débogage sont visibles pour la connexion. (Facultatif)

source: B<-k> private_key.pem
fr: B<-k> I<clef_privée.pem>

source: (HTTPS) In case of certificate-based client authentication over HTTPS <private_key.pem> must contain the private key of the user. The private key file can optionally be protected by a passphrase. The B<-c> option must also be specified. (Optional)
fr: (HTTPS) En cas d’authentification client à base de certificat par HTTPS, I<clef_privée.pem> doit contenir la clef privée de l'utilisateur. Le fichier de clef privée peut éventuellement être protégé par une phrase secrète. L’option B<-c> doit aussi être indiquée. (Facultatif)

source: B<-p> key_password
fr: B<-p> I<mot_de_passe_clef>

source: (HTTPS) Specifies the passphrase for the private key specified by the B<-k> argument. If this option is omitted and the key is passphrase protected B<tsget> will ask for it. (Optional)
fr: (HTTPS) Indiquer la phrase secrète de la clef privée indiquée par l’argument de l'option B<-k>. Si cette option est omise et que la clef est protégée par phrase secrète, B<tsget> la demandera. (Facultatif)

source: B<-c> client_cert.pem
fr: B<-c> I<cert_client.pem>

source: (HTTPS) In case of certificate-based client authentication over HTTPS <client_cert.pem> must contain the X.509 certificate of the user. The B<-k> option must also be specified. If this option is not specified no certificate-based client authentication will take place. (Optional)
fr: (HTTPS) En cas d’authentification client à base de certificat par HTTPS, I<cert_client.pem> doit contenir le certificat X.509 de l'utilisateur. L’option B<-k> doit également être indiquée. Si cette option n'est pas indiquée, aucune authentification du client à base de certificat n’aura lieu. (Facultatif)

source: B<-C> CA_certs.pem
fr: B<-C> I<certs_CA.pem>

source: (HTTPS) The trusted CA certificate store. The certificate chain of the peer's certificate must include one of the CA certificates specified in this file. Either option B<-C> or option B<-P> must be given in case of HTTPS. (Optional)
fr: (HTTPS) L’ensemble des certificats d’autorité de confiance. La chaîne de certificats du certificat du pair doit inclure l'un des certificats d’autorité indiqués dans ce fichier. Soit l'option B<-C>, soit l'option B<-P> doit être donnée avec HTTPS. (Facultatif)

source: B<-P> CA_path
fr: B<-P> I<chemin_CA>

source: (HTTPS) The path containing the trusted CA certificates to verify the peer's certificate. The directory must be prepared with the B<c_rehash> OpenSSL utility. Either option B<-C> or option B<-P> must be given in case of HTTPS. (Optional)
fr: (HTTPS) Le chemin d'accès aux certificats d’autorité de confiance pour vérifier le certificat du pair. Le répertoire doit être préparé avec l’utilitaire B<c_rehash> d’OpenSSL. Soit l'option B<-C>, soit l'option B<-P> doit être donnée avec HTTPS. (Facultatif)

source: B<-g> EGD_socket
fr: B<-g> I<socket_EGD>

source: The name of an EGD socket to get random data from. (Optional)
fr: Le nom d'une socket EGD pour obtenir des données aléatoires. (Facultatif)

source: [request]...
fr: [I<demande>] ...

source: List of files containing B<RFC 3161> DER-encoded time stamp requests. If no requests are specified only one request will be sent to the server and it will be read from the standard input. (Optional)
fr: Liste des fichiers contenant les demandes d’horodatage B<RFC 3161> encodées DER. Si aucune demande n'est indiquée, une seule demande sera envoyée au serveur et sera lue à partir de l'entrée standard. (Facultatif)

source: The B<TSGET> environment variable can optionally contain default arguments. The content of this variable is added to the list of command line arguments.
fr: La variable d'environnement B<TSGET> peut éventuellement contenir des arguments par défaut. Le contenu de cette variable est ajouté à la liste des arguments de ligne de commande.

source: The examples below presume that B<file1.tsq> and B<file2.tsq> contain valid time stamp requests, tsa.opentsa.org listens at port 8080 for HTTP requests and at port 8443 for HTTPS requests, the TSA service is available at the /tsa absolute path.
fr: Les exemples ci-dessous supposent que I<fichier1.tsq> et I<fichier2.tsq> contiennent des demandes d'horodatage valables, tsa.opentsa.org écoute sur le port 8080 les requêtes HTTP et sur le port 8443 les requêtes HTTPS, le service TSA est disponible au chemin absolu /tsa.

source: Get a time stamp response for file1.tsq over HTTP, output is written to file1.tsr:
fr: Obtenir une réponse d'horodatage pour I<fichier1.tsq> sur HTTP, la sortie est écrite dans I<fichier1.tsr> :

source: tsget -h http://tsa.opentsa.org:8080/tsa file1.tsq
fr: tsget -h http://tsa.opentsa.org:8080/tsa fichier1.tsq

source: Get a time stamp response for file1.tsq and file2.tsq over HTTP showing progress, output is written to file1.reply and file2.reply respectively:
fr: Obtenir une réponse d'horodatage pour I<fichier1.tsq> et I<fichier2.tsq> sur HTTP en montrant l’activité, la sortie est respectivement écrite dans I<fichier1.réponse> et I<fichier2.réponse> :

source: tsget -h http://tsa.opentsa.org:8080/tsa -v -e .reply \ file1.tsq file2.tsq
fr: tsget -h http://tsa.opentsa.org:8080/tsa -v -e .réponse \ fichier1.tsq fichier2.tsq

source: Create a time stamp request, write it to file3.tsq, send it to the server and write the response to file3.tsr:
fr: Créer une demande d'horodatage, l’écrire dans I<fichier3.tsq>, l'envoyer au serveur et écrire la réponse dans I<fichier3.tsr> :

source: openssl ts -query -data file3.txt -cert | tee file3.tsq \ | tsget -h http://tsa.opentsa.org:8080/tsa \ -o file3.tsr
fr: openssl ts -query -data fichier3.txt -cert | tee fichier3.tsq \ | tsget -h http://tsa.opentsa.org:8080/tsa \ -o fichier3.tsr

source: Get a time stamp response for file1.tsq over HTTPS without client authentication:
fr: Obtenir une réponse d'horodatage pour I<fichier1.tsq> par HTTPS sans authentification du client :

source: tsget -h https://tsa.opentsa.org:8443/tsa \ -C cacerts.pem file1.tsq
fr: tsget -h https://tsa.opentsa.org:8443/tsa \ -C cacerts.pem fichier1.tsq

source: Get a time stamp response for file1.tsq over HTTPS with certificate-based client authentication (it will ask for the passphrase if client_key.pem is protected):
fr: Obtenir une réponse d'horodatage pour I<fichier1.tsq> par HTTPS avec authentification du client à base de certificat (la phrase secrète sera demandée si I<clef_client.pem> est protégée) :

source: tsget -h https://tsa.opentsa.org:8443/tsa -C cacerts.pem \ -k client_key.pem -c client_cert.pem file1.tsq
fr: tsget -h https://tsa.opentsa.org:8443/tsa -C cacerts.pem \ -k clef_client.pem -c client_cert.pem fichier1.tsq

source: You can shorten the previous command line if you make use of the B<TSGET> environment variable. The following commands do the same as the previous example:
fr: La ligne de commande précédente peut être raccourcie en utilisant la variable d'environnement B<TSGET>. Les commandes suivantes font la même chose que l'exemple précédent :

source: TSGET='-h https://tsa.opentsa.org:8443/tsa -C cacerts.pem \ -k client_key.pem -c client_cert.pem' export TSGET tsget file1.tsq
fr: TSGET='-h https://tsa.opentsa.org:8443/tsa -C cacerts.pem \ -k clef_client.pem -c client_cert.pem' export TSGET tsget fichier1.tsq

source: L<openssl(1)|openssl(1)>, L<ts(1)|ts(1)>, L<curl(1)|curl(1)>, B<RFC 3161>
fr: L<B<openssl>(1)|openssl(1)>, L<B<ts>(1)|ts(1)>, L<B<curl>(1)|curl(1)>, B<RFC 3161>

source: verify - Utility to verify certificates.
fr: verify - Utilitaire de vérification de certificats

source: B<openssl> B<verify> [B<-CApath directory>] [B<-CAfile file>] [B<-purpose purpose>] [B<-policy arg>] [B<-ignore_critical>] [B<-crl_check>] [B<-crl_check_all>] [B<-policy_check>] [B<-explicit_policy>] [B<-inhibit_any>] [B<-inhibit_map>] [B<-x509_strict>] [B<-extended_crl>] [B<-use_deltas>] [B<-policy_print>] [B<-untrusted file>] [B<-help>] [B<-issuer_checks>] [B<-attime timestamp>] [B<-verbose>] [B<->] [certificates]
fr: B<openssl> B<verify> [B<-CApath> I<répertoire>] [B<-CAfile> I<fichier>] [B<-purpose> I<raison>] [B<-policy> I<param>] [B<-ignore_critical>] [B<-crl_check>] [B<-crl_check_all>] [B<-policy_check>] [B<-explicit_policy>] [B<-inhibit_any>] [B<-inhibit_map>] [B<-x509_strict>] [B<-extended_crl>] [B<-use_deltas>] [B<-policy_print>] [B<-untrusted> I<fichier>] [B<-help>] [B<-issuer_checks>] [B<-attime> I<horodatage>] [B<-verbose>] [B<->] [I<certificats>]

source: The B<verify> command verifies certificate chains.
fr: La commande B<verify> vérifie des chaînes de certificats.

source: B<-CApath directory>
fr: B<-CApath> I<répertoire>

source: A directory of trusted certificates. The certificates should have names of the form: hash.0 or have symbolic links to them of this form ("hash" is the hashed certificate subject name: see the B<-hash> option of the B<x509> utility). Under Unix the B<c_rehash> script will automatically create symbolic links to a directory of certificates.
fr: Un répertoire de certificats de confiance. Les certificats devraient avoir des noms de la forme : I<hachage>.0 ou avoir des liens symboliques vers eux de cette forme (« I<hachage> » est le nom de sujet du certificat haché : consultez l'option B<-hash> de l'utilitaire B<x509>). Sous UNIX, le script B<c_rehash> créera automatiquement les liens symboliques vers un répertoire de certificats.

source: B<-CAfile file> A file of trusted certificates. The file should contain multiple certificates in PEM format concatenated together.
fr: B<-CAfile> I<fichier> Un fichier avec des certificats de confiance. Le fichier doit contenir des certificats au format PEM, concaténés.

source: B<-untrusted file>
fr: B<-untrusted> I<fichier>

source: A file of untrusted certificates. The file should contain multiple certificates in PEM format concatenated together.
fr: Un fichier avec des certificats qui ne sont pas de confiance. Le fichier doit contenir des certificats au format PEM, concaténés.

source: B<-purpose purpose>
fr: B<-purpose> I<raison>

source: The intended use for the certificate. If this option is not specified, B<verify> will not consider certificate purpose during chain verification. Currently accepted uses are B<sslclient>, B<sslserver>, B<nssslserver>, B<smimesign>, B<smimeencrypt>. See the B<VERIFY OPERATION> section for more information.
fr: Le but de ce certificat. Si cette option n'est pas indiquée, B<verify> ne considérera pas la raison du certificat lors de la vérification de chaîne. Les utilisations actuellement acceptées sont : B<sslclient>, B<sslserver>, B<nssslserver>, B<smimesign> et B<smimeencrypt>. Consultez la section B<OPÉRATION DE VÉRIFICATION> pour de plus amples renseignements.

source: Print out a usage message.
fr: Afficher un message sur l'utilisation.

source: Print extra information about the operations being performed.
fr: Afficher des informations supplémentaires à propos des opérations effectuées.

source: Print out diagnostics relating to searches for the issuer certificate of the current certificate. This shows why each candidate issuer certificate was rejected. The presence of rejection messages does not itself imply that anything is wrong; during the normal verification process, several rejections may take place.
fr: Afficher les diagnostics relatifs aux recherches du certificat émetteur du certificat actuel. Cela montre la raison pour laquelle chaque certificat émetteur candidat a été rejeté. La présence de messages de rejets n'implique pas qu'il y a un problème ; lors du processus de vérification normal, plusieurs rejets peuvent avoir lieu.

source: B<-attime timestamp>
fr: B<-attime> I<horodatage>

source: Perform validation checks using time specified by B<timestamp> and not current system time. B<timestamp> is the number of seconds since 01.01.1970 (UNIX time).
fr: Réaliser les vérifications de validation en utilisant la date indiquée par I<horodatage> au lieu de la date système actuelle. I<horodatage> est le nombre de secondes écoulées depuis le 1er janvier 1970 (date UNIX).

source: B<-policy arg>
fr: B<-policy> I<param>

source: Enable policy processing and add B<arg> to the user-initial-policy-set (see RFC5280). The policy B<arg> can be an object name an OID in numeric form. This argument can appear more than once.
fr: Activer le traitement de la politique et ajouter I<param> à user-initial-policy-set (consultez la RFC 5280). La politique I<param> peut être un nom d'objet ou un OID sous forme numérique. Cet argument peut être fourni plus d'une fois.

source: Enables certificate policy processing.
fr: Activer le traitement de la politique de certificat.

source: Set policy variable require-explicit-policy (see RFC5280).
fr: Définir la variable de politique require-explicit-policy (consultez la RFC 5280).

source: Set policy variable inhibit-any-policy (see RFC5280).
fr: Définir la variable de politique inhibit-any-policy (consultez la RFC 5280).

source: Set policy variable inhibit-policy-mapping (see RFC5280).
fr: Définir la variable de politique inhibit-policy-mapping (consultez la RFC 5280).

source: Print out diagnostics related to policy processing.
fr: Afficher les diagnostics relatifs au traitement de politique.

source: Checks end entity certificate validity by attempting to look up a valid CRL. If a valid CRL cannot be found an error occurs.
fr: Vérifier la fin de validité d'une entité de certificat en essayant de rechercher une liste valable de révocations de certificat. Cela produit une erreur si une liste valable de révocations de certificat ne peut pas être trouvée.

source: Checks the validity of B<all> certificates in the chain by attempting to look up valid CRLs.
fr: Vérifier la validité de B<tous> les certificats de la chaîne en essayant de rechercher une liste valable de révocations de certificat.

source: Normally if an unhandled critical extension is present which is not supported by OpenSSL the certificate is rejected (as required by RFC5280). If this option is set critical extensions are ignored.
fr: Normalement, si une extension critique non gérée mais présente n'est pas prise en charge par OpenSSL, le certificat est rejeté (conformément à la RFC 5280). Si cette option est définie, les extensions critiques sont ignorées.

source: For strict X.509 compliance, disable non-compliant workarounds for broken certificates.
fr: Pour une conformité X.509 stricte, désactiver les contournements non conformes pour les certificats cassés.

source: Enable extended CRL features such as indirect CRLs and alternate CRL signing keys.
fr: Activer les fonctionnalités étendues de liste de révocations de certificat, comme les listes indirectes de révocations de certificat et les clefs de signature alternatives de liste de révocations de certificat.

source: Enable support for delta CRLs.
fr: Activer la prise en charge pour les deltas de listes de révocations de certificat.

source: Verify the signature on the self-signed root CA. This is disabled by default because it doesn't add any security.
fr: Vérifier la signature du certificat racine autosigné de l'autorité de certification. C'est désactivé par défaut parce que cela n'ajoute aucune sécurité.

source: Indicates the last option. All arguments following this are assumed to be certificate files. This is useful if the first certificate filename begins with a B<->.
fr: Indiquer la dernière option. Tous les arguments suivants sont considérés comme des fichiers de certificat. C'est pratique si le premier nom de fichier de certificat commence par un B<->.

source: B<certificates>
fr: B<certificats>

source: One or more certificates to verify. If no certificates are given, B<verify> will attempt to read a certificate from standard input. Certificates must be in PEM format.
fr: Un ou plusieurs certificats à vérifier. Si aucun certificat n'est donné, B<verify> essayera de lire un certificat depuis l'entrée standard. Les certificats devraient être au format PEM.

source: VERIFY OPERATION
fr: OPÉRATION DE VÉRIFICATION

source: The B<verify> program uses the same functions as the internal SSL and S/MIME verification, therefore this description applies to these verify operations too.
fr: Le programme B<verify> utilise les mêmes fonctions que les vérifications internes SSL et S/MIME, par conséquent cette description s'applique aussi à ces opérations de vérification.

source: There is one crucial difference between the verify operations performed by the B<verify> program: wherever possible an attempt is made to continue after an error whereas normally the verify operation would halt on the first error. This allows all the problems with a certificate chain to be determined.
fr: Une différence fondamentale existe entre les opérations de vérification réalisées par le programme B<verify> : à chaque fois que c'est possible, une tentative de continuer est essayée après une erreur, alors que l'opération de vérification se serait normalement arrêtée après la première erreur. Cela permet de déterminer tous les problèmes avec une chaîne de certificats.

source: The verify operation consists of a number of separate steps.
fr: L'opération de vérification est constituée de plusieurs étapes séparées.

source: Firstly a certificate chain is built up starting from the supplied certificate and ending in the root CA. It is an error if the whole chain cannot be built up. The chain is built up by looking up the issuers certificate of the current certificate. If a certificate is found which is its own issuer it is assumed to be the root CA.
fr: D'abord, une chaîne de certificats est construite à partir du certificat fourni jusqu'au certificat racine de l'autorité de certification. C'est une erreur si la chaîne complète ne peut pas être construite. La chaîne est construite en recherchant le certificat émetteur du certificat actuel. Si le certificat trouvé est son propre émetteur, il est considéré comme le certificat racine de l'autorité de certification.

source: The process of 'looking up the issuers certificate' itself involves a number of steps. In versions of OpenSSL before 0.9.5a the first certificate whose subject name matched the issuer of the current certificate was assumed to be the issuers certificate. In OpenSSL 0.9.6 and later all certificates whose subject name matches the issuer name of the current certificate are subject to further tests. The relevant authority key identifier components of the current certificate (if present) must match the subject key identifier (if present) and issuer and serial number of the candidate issuer, in addition the keyUsage extension of the candidate issuer (if present) must permit certificate signing.
fr: Le processus de « recherche du certificat émetteur » lui-même implique un certain nombre d'étapes. Jusqu'à la version 0.9.5a d'OpenSSL, le premier certificat dont le nom de sujet correspond au nom de l'émetteur du certificat actuel était considéré comme le certificat émetteur. Dans OpenSSL 0.9.6 et les versions suivantes, tous les certificats dont le nom de sujet correspond au nom de l'émetteur du certificat actuel sont sujets à d'autres tests. Les composants identificateurs concernant la clef d'autorité du certificat actuel (s'ils existent) doivent correspondre au sujet de l'identificateur de clef (s'il existe), et l'émetteur, le numéro de série de l'émetteur candidat, en plus de l'extension keyUsage de l'émetteur candidat (s'il existe), doivent permettre la signature de certificat.

source: The lookup first looks in the list of untrusted certificates and if no match is found the remaining lookups are from the trusted certificates. The root CA is always looked up in the trusted certificate list: if the certificate to verify is a root certificate then an exact match must be found in the trusted list.
fr: La recherche commence par la liste de certificats qui ne sont pas de confiance, et si aucune correspondance n'est trouvée, la recherche continue avec les certificats de confiance. Le certificat racine de l'autorité de certification est toujours recherché dans la liste des certificats de confiance : si le certificat à vérifier est un certificat racine, alors une correspondance exacte doit être trouvée dans la liste des certificats de confiance.

source: The second operation is to check every untrusted certificate's extensions for consistency with the supplied purpose. If the B<-purpose> option is not included then no checks are done. The supplied or "leaf" certificate must have extensions compatible with the supplied purpose and all other certificates must also be valid CA certificates. The precise extensions required are described in more detail in the B<CERTIFICATE EXTENSIONS> section of the B<x509> utility.
fr: La deuxième opération est de vérifier toutes les extensions des certificats qui ne sont pas de confiance, en cohérence avec la raison fournie. Si l'option B<-purpose> n'est pas incluse, aucune vérification n'est réalisée. Le certificat fourni ou « feuille » (VS racine) doit avoir des extensions compatibles avec la raison fournie et tous les autres certificats doivent aussi être des certificats d'autorité de certification valables. Les extensions exactes nécessaires sont décrites plus en détail dans la section B<EXTENSIONS DE CERTIFICATS> de l'utilitaire B<x509>.

source: The third operation is to check the trust settings on the root CA. The root CA should be trusted for the supplied purpose. For compatibility with previous versions of SSLeay and OpenSSL a certificate with no trust settings is considered to be valid for all purposes.
fr: La troisième opération est de vérifier les réglages de confiance du certificat racine de l'autorité de certification. Le certificat racine de l'autorité de certification devrait être de confiance pour la raison fournie. Par compatibilité avec les versions précédentes de SSLeay et OpenSSL, un certificat sans réglages de confiance est considéré valable dans tous les cas.

source: The final operation is to check the validity of the certificate chain. The validity period is checked against the current system time and the notBefore and notAfter dates in the certificate. The certificate signatures are also checked at this point.
fr: La dernière opération est de vérifier la validité de la chaîne de certificats. La période de validité est vérifiée par rapport à l'heure actuelle du système et les dates notBefore et notAfter du certificat. Les signatures de certificat sont aussi vérifiées à ce moment.
