Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: If all operations complete successfully then certificate is considered valid. If any operation fails then the certificate is not valid.
fr: Si toutes les opérations se terminent avec succès, alors le certificat est considéré valable. Si n'importe quelle opération échoue, alors le certificat est incorrect.

source: When a verify operation fails the output messages can be somewhat cryptic. The general form of the error message is:
fr: Quand une opération de vérification échoue, les messages de sortie peuvent être un peu abscons. La forme globale du message d'erreur est :

source: The first line contains the name of the certificate being verified followed by the subject name of the certificate. The second line contains the error number and the depth. The depth is number of the certificate being verified when a problem was detected starting with zero for the certificate being verified itself then 1 for the CA that signed the certificate and so on. Finally a text version of the error number is presented.
fr: La première ligne contient le nom du certificat en cours de vérification suivi par le nom de sujet du certificat. La deuxième ligne contient le numéro d'erreur et la profondeur. La profondeur est le nombre de certificats ayant été vérifiés quand un problème a été détecté, avec zéro pour le certificat vérifié lui-même, puis un pour l'autorité de certification qui a signé le certificat et ainsi de suite. Enfin, la version texte du numéro d'erreur est présentée.

source: An exhaustive list of the error codes and messages is shown below, this also includes the name of the error code as defined in the header file x509_vfy.h Some of the error codes are defined but never returned: these are described as "unused".
fr: Une liste exhaustive des codes d'erreur et messages est montrée ci-dessous, cela inclut également le nom du code d'erreur tel qu'il est défini dans le fichier d'en-têtes F<x509_vfy.h>. Certains codes d'erreur sont définis mais jamais renvoyés : ce sont ceux décrits comme « inutilisés ».

source: the operation was successful.
fr: L'opération a réussi.

source: the issuer certificate of a looked up certificate could not be found. This normally means the list of trusted certificates is not complete.
fr: Le certificat émetteur d'un certificat recherché est introuvable. Cela signifie normalement que la liste de certificats de confiance n'est pas complète.

source: the CRL of a certificate could not be found.
fr: La liste de révocations de certificat est introuvable.

source: the certificate signature could not be decrypted. This means that the actual signature value could not be determined rather than it not matching the expected value, this is only meaningful for RSA keys.
fr: La signature de certificat n'a pas pu être déchiffrée. Cela signifie que la valeur de signature réelle n'a pas pu être déterminée, plutôt qu'elle ne correspond pas à la valeur attendue, ce n'est significatif que pour les clefs RSA.

source: the CRL signature could not be decrypted: this means that the actual signature value could not be determined rather than it not matching the expected value. Unused.
fr: La signature de liste de révocations de certificat n'a pas pu être déchiffrée : cela signifie que la valeur de signature réelle n'a pas pu être déterminée, plutôt qu'elle ne correspond pas à la valeur attendue. Inutilisé.

source: the public key in the certificate SubjectPublicKeyInfo could not be read.
fr: La clef publique du certificat SubjectPublicKeyInfo n'a pas pu être lue.

source: the signature of the certificate is invalid.
fr: La signature du certificat est incorrecte.

source: the certificate is not yet valid: the notBefore date is after the current time.
fr: Le certificat n'est pas encore valable : la date notBefore est après la date actuelle.

source: the certificate has expired: that is the notAfter date is before the current time.
fr: Le certificat a expiré : c'est parce que la date notAfter est avant la date actuelle.

source: the CRL is not yet valid.
fr: La liste de révocations de certificat n'est pas encore valable.

source: the CRL has expired.
fr: La liste de révocations de certificat a expiré.

source: the certificate notBefore field contains an invalid time.
fr: Le champ notBefore du certificat contient une date incorrecte.

source: the certificate notAfter field contains an invalid time.
fr: Le champ notAfter du certificat contient une date incorrecte.

source: the CRL lastUpdate field contains an invalid time.
fr: Le champ lastUpdate de la liste de révocations de certificat contient une date incorrecte.

source: the CRL nextUpdate field contains an invalid time.
fr: Le champ nextUpdate de la liste de révocations de certificat contient une date incorrecte.

source: an error occurred trying to allocate memory. This should never happen.
fr: Une erreur s'est produite en essayant d'allouer de la mémoire. Cela ne devrait jamais arriver.

source: the passed certificate is self signed and the same certificate cannot be found in the list of trusted certificates.
fr: Le certificat passé est autosigné et le même certificat est introuvable dans la liste des certificats de confiance.

source: the certificate chain could be built up using the untrusted certificates but the root could not be found locally.
fr: La chaîne de certificats aurait pu être construite en utilisant des certificats qui ne sont pas de confiance mais le certificat racine est introuvable localement.

source: the issuer certificate could not be found: this occurs if the issuer certificate of an untrusted certificate cannot be found.
fr: Le certificat émetteur est introuvable : cela arrive si le certificat émetteur d'un certificat qui n'est pas de confiance est introuvable.

source: no signatures could be verified because the chain contains only one certificate and it is not self signed.
fr: Aucune signature n'a pu être vérifiée car la chaîne ne contient qu'un seul certificat et il n'est pas autosigné.

source: the certificate chain length is greater than the supplied maximum depth. Unused.
fr: La longueur de la chaîne de certificats est plus grande que la profondeur maximale fournie. Inutilisé.

source: the certificate has been revoked.
fr: Le certificat a été révoqué.

source: a CA certificate is invalid. Either it is not a CA or its extensions are not consistent with the supplied purpose.
fr: Un certificat de l'autorité de certification est incorrect. Soit ce n'est pas une autorité de certification, soit ses extensions ne sont pas cohérentes avec la raison fournie.

source: the basicConstraints pathlength parameter has been exceeded.
fr: Le paramètre de longueur de chemin basicConstraints a été dépassé.

source: the supplied certificate cannot be used for the specified purpose.
fr: Le certificat fourni n'a pas pu être utilisé pour la raison fournie.

source: the root CA is not marked as trusted for the specified purpose.
fr: Le certificat racine de l'autorité de certification n'est pas marqué de confiance pour la raison fournie.

source: the root CA is marked to reject the specified purpose.
fr: Le certificat racine de l'autorité de certification est marqué pour rejeter la raison fournie.

source: the current candidate issuer certificate was rejected because its subject name did not match the issuer name of the current certificate. Only displayed when the B<-issuer_checks> option is set.
fr: Le certificat émetteur candidat actuel a été rejeté car son nom de sujet ne correspondait pas au nom d'émetteur du certificat actuel. Affiché seulement quand l'option B<-issuer_checks> est activée.

source: the current candidate issuer certificate was rejected because its subject key identifier was present and did not match the authority key identifier current certificate. Only displayed when the B<-issuer_checks> option is set.
fr: Le certificat émetteur candidat actuel a été rejeté car son objet d'identificateur de clef était présent et ne correspondait pas à l'identificateur de clef d'autorité du certificat actuel. Affiché seulement quand l'option B<-issuer_checks> est activée.

source: the current candidate issuer certificate was rejected because its issuer name and serial number was present and did not match the authority key identifier of the current certificate. Only displayed when the B<-issuer_checks> option is set.
fr: Le certificat émetteur candidat actuel a été rejeté car son nom d'émetteur et son numéro de série étaient présents et ne correspondaient pas à l'identificateur de clef d'autorité du certificat actuel. Affiché seulement quand l'option B<-issuer_checks> est activée.

source: the current candidate issuer certificate was rejected because its keyUsage extension does not permit certificate signing.
fr: Le certificat émetteur candidat actuel a été rejeté car son extension keyUsage ne permet pas la signature de certificat.

source: an application specific error. Unused.
fr: Une erreur spécifique à l'application. Inutilisé.

source: Although the issuer checks are a considerable improvement over the old technique they still suffer from limitations in the underlying X509_LOOKUP API. One consequence of this is that trusted certificates with matching subject name must either appear in a file (as specified by the B<-CAfile> option) or a directory (as specified by B<-CApath>. If they occur in both then only the certificates in the file will be recognised.
fr: Bien que les vérifications d'émetteur constituent une amélioration considérable par rapport à l'ancienne technique, elles souffrent encore des limites de l'interface de programmation X509_LOOKUP sous-jacente. Une conséquence de cela est que les certificats de confiance avec un nom de sujet correspondant doivent soit apparaître dans un fichier (comme indiqué avec l'option B<-CAfile>), soit dans un répertoire (comme indiqué avec l'option B<-CApath>). S'ils apparaissent dans les deux, alors seuls les certificats du fichier seront reconnus.

source: Previous versions of OpenSSL assume certificates with matching subject name are identical and mishandled them.
fr: Les versions précédentes d'OpenSSL considèrent que les certificats avec les mêmes noms de sujet sont identiques et les gèrent mal.

source: Previous versions of this documentation swapped the meaning of the B<X509_V_ERR_UNABLE_TO_GET_ISSUER_CERT> and B<20 X509_V_ERR_UNABLE_TO_GET_ISSUER_CERT_LOCALLY> error codes.
fr: Les versions précédentes de cette documentation inversaient la signification des codes d'erreur B<X509_V_ERR_UNABLE_TO_GET_ISSUER_CERT> et B<20 X509_V_ERR_UNABLE_TO_GET_ISSUER_CERT_LOCALLY>.

source: L<x509(1)|x509(1)>
fr: L<B<x509>(1)|x509(1)>

source: version - print OpenSSL version information
fr: version - Afficher les informations sur la version d'OpenSSL

source: This command is used to print out version information about OpenSSL.
fr: Cette commande permet d'afficher les informations sur la version d'OpenSSL.

source: all information, this is the same as setting all the other flags.
fr: toutes les informations, identique à l'utilisation de toutes les autres options.

source: the current OpenSSL version.
fr: la version actuelle d'OpenSSL.

source: the date the current version of OpenSSL was built.
fr: la date à laquelle cette version d'OpenSSL a été construite.

source: option information: various options set when the library was built.
fr: informations sur les options : les différentes options utilisées pour la construction de la bibliothèque.

source: compilation flags.
fr: options de compilation.

source: platform setting.
fr: configuration de la plate-forme.

source: OPENSSLDIR setting.
fr: configuration OPENSSLDIR.

source: The output of B<openssl version -a> would typically be used when sending in a bug report.
fr: La sortie de B<openssl version -a> est généralement utilisée pour l'envoi d'un rapport de bogue.

source: HISTORY
fr: HISTORIQUE

source: The B<-d> option was added in OpenSSL 0.9.7.
fr: L'option B<-d> a été ajoutée dans la version 0.9.7 d'OpenSSL.
