Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: the certificates specified by the B<-verify_other> option should be explicitly trusted and no additional checks will be performed on them. This is useful when the complete responder certificate chain is not available or trusting a root CA is not appropriate.
fr: Les certificats indiqués par l'option B<-verify_other> devraient être explicitement de confiance et aucune vérification supplémentaire ne sera effectuée. C’est utile lorsque la chaîne complète de certificats répondeur n'est pas disponible ou quand faire confiance à une autorité de certification racine n'est pas approprié.

source: B<-VAfile file>
fr: B<-VAfile> I<fichier>

source: file containing explicitly trusted responder certificates. Equivalent to the B<-verify_other> and B<-trust_other> options.
fr: Fichier contenant les certificats de répondeur explicitement approuvés. Équivalent aux options B<-verify_other> et B<-trust_other>.

source: don't attempt to verify the OCSP response signature or the nonce values. This option will normally only be used for debugging since it disables all verification of the responders certificate.
fr: Ne pas essayer de vérifier la signature de réponse OCSP ou les valeurs de nonce. Cette option ne sera normalement utilisée que pour le débogage, car elle désactive toute vérification du certificat des répondeurs.

source: ignore certificates contained in the OCSP response when searching for the signers certificate. With this option the signers certificate must be specified with either the B<-verify_other> or B<-VAfile> options.
fr: Ignorer les certificats contenus dans la réponse OCSP lors de la recherche du certificat des signataires. Avec cette option, le certificat des signataires doit être indiqué avec les options B<-verify_other> ou B<-VAfile>

source: don't check the signature on the OCSP response. Since this option tolerates invalid signatures on OCSP responses it will normally only be used for testing purposes.
fr: Ne pas vérifier la signature de réponse OCSP. Puisque cette option tolère les signatures non valables des réponses OCSP, elle ne devrait être utilisée qu’à des fins de test.

source: don't verify the OCSP response signers certificate at all. Since this option allows the OCSP response to be signed by any certificate it should only be used for testing purposes.
fr: Ne pas vérifier du tout le certificat des signataires de réponse OCSP. Puisque cette option permet à la réponse OCSP d’être signée par n’importe quel certificat, elle ne devrait être utilisée qu’à des fins de test.

source: do not use certificates in the response as additional untrusted CA certificates.
fr: Ne pas utiliser les certificats dans la réponse comme des certificats supplémentaires d’autorité non fiables.

source: don't perform any additional checks on the OCSP response signers certificate. That is do not make any checks to see if the signers certificate is authorised to provide the necessary status information: as a result this option should only be used for testing purposes.
fr: Ne pas effectuer de contrôle supplémentaire sur le certificat des signataires de réponse OCSP. C'est-à-dire, ne pas faire de contrôle pour vérifier que le certificat des signataires est autorisé à fournir les informations d'état nécessaires : par conséquent, cette option ne devrait être utilisée qu’à des fins de test.

source: B<-validity_period nsec>, B<-status_age age>
fr: B<-validity_period> I<n>, B<-status_age> I<age>

source: these options specify the range of times, in seconds, which will be tolerated in an OCSP response. Each certificate status response includes a B<notBefore> time and an optional B<notAfter> time. The current time should fall between these two values, but the interval between the two times may be only a few seconds. In practice the OCSP responder and clients clocks may not be precisely synchronised and so such a check may fail. To avoid this the B<-validity_period> option can be used to specify an acceptable error range in seconds, the default value is 5 minutes.
fr: Ces options indiquent la plage de temps, en seconde, qui sera tolérée dans une réponse OCSP. Chaque réponse d'état de certificat comprend un temps B<notBefore> et un temps B<notAfter>. Le temps actuel devrait se situer entre ces deux valeurs, mais l'intervalle entre les deux temps peut n’être que de quelques secondes. En pratique, les horloges du répondeur et des clients OCSP peuvent ne pas être précisément synchronisées et donc ce type de contrôle peut échouer. Pour éviter cela, l’option B<-validity_period> peut être utilisée pour indiquer une plage d'erreur acceptable en secondes, la valeur par défaut est de 5 minutes.

source: If the B<notAfter> time is omitted from a response then this means that new status information is immediately available. In this case the age of the B<notBefore> field is checked to see it is not older than B<age> seconds old. By default this additional check is not performed.
fr: Si le temps B<notAfter> est omis dans une réponse, cela signifie que de nouvelles informations d'état sont disponibles immédiatement. Dans ce cas, l'âge du champ B<notBefore> est vérifié pour voir s’il n'est pas plus vieux que B<age> en seconde. Par défaut, cette vérification supplémentaire n'est pas effectuée.

source: B<-md5|-sha1|-sha256|-ripemod160|...>
fr: B<-md5>|B<-sha1>|B<-sha256>|B<-ripemod160>|...

source: this option sets digest algorithm to use for certificate identification in the OCSP request. By default SHA-1 is used.
fr: Cette option définit l’algorithme de signature à utiliser pour l'identification de certificat dans la demande OCSP. Par défaut, SHA-1 est utilisé.

source: OCSP SERVER OPTIONS
fr: OPTIONS DE SERVEUR OCSP

source: B<-index indexfile>
fr: B<-index> I<fichier>

source: B<indexfile> is a text index file in B<ca> format containing certificate revocation information.
fr: I<fichier> est un fichier texte d'indices au format B<ca> contenant des informations de révocations de certificat.

source: If the B<index> option is specified the B<ocsp> utility is in responder mode, otherwise it is in client mode. The request(s) the responder processes can be either specified on the command line (using B<issuer> and B<serial> options), supplied in a file (using the B<respin> option) or via external OCSP clients (if B<port> or B<url> is specified).
fr: Si l'option B<-index> est indiquée, l'utilitaire B<ocsp> est en mode répondeur, sinon il est en mode client. La ou les demandes que les répondeurs traitent peuvent être soit indiquées sur la ligne de commande (avec des options B<-issuer> et B<-serial>), soit fournies dans un fichier (en utilisant l'option B<-respin>) ou à l’aide de clients OCSP externes (si B<-port> ou B<-url> sont indiquées).

source: If the B<index> option is present then the B<CA> and B<rsigner> options must also be present.
fr: Si l'option B<-index> est présente, alors les options B<-CA> et B<-rsigner> doivent également être présentes.

source: B<-CA file>
fr: B<-CA> I<fichier>

source: CA certificate corresponding to the revocation information in B<indexfile>.
fr: Certificat d’autorité correspondant aux informations de révocations de B<-indexfile>.

source: B<-rsigner file>
fr: B<-rsigner> I<fichier>

source: The certificate to sign OCSP responses with.
fr: Le certificat à utiliser pour signer les réponses OCSP.

source: B<-rother file>
fr: B<-rother> I<fichier>

source: Additional certificates to include in the OCSP response.
fr: Certificats supplémentaires à inclure dans la réponse OCSP.

source: Don't include any certificates in the OCSP response.
fr: Ne pas inclure les certificats dans la réponse OCSP.

source: Identify the signer certificate using the key ID, default is to use the subject name.
fr: Identifier le certificat de signataire en utilisant l'identifiant de clef, par défaut, cela consiste à utiliser le nom d’objet.

source: B<-rkey file>
fr: B<-rkey> I<fichier>

source: The private key to sign OCSP responses with: if not present the file specified in the B<rsigner> option is used.
fr: La clef privée à utiliser pour signer les réponses OCSP : en cas d’absence, le fichier indiqué dans l'option B<-rsigner> est utilisé.

source: B<-port portnum>
fr: B<-port> I<num>

source: Port to listen for OCSP requests on. The port may also be specified using the B<url> option.
fr: Port où écouter les demandes OCSP. Le port peut également être indiqué par l'option B<-url> .

source: B<-nrequest number>
fr: B<-nrequest> I<n>

source: The OCSP server will exit after receiving B<number> requests, default unlimited.
fr: Le serveur OCSP se terminera après avoir reçu I<n> demandes, par défaut sans limite.

source: B<-nmin minutes>, B<-ndays days>
fr: B<-nmin> I<n>, B<-ndays> I<n>

source: Number of minutes or days when fresh revocation information is available: used in the B<nextUpdate> field. If neither option is present then the B<nextUpdate> field is omitted meaning fresh revocation information is immediately available.
fr: Temps en minute ou jour pendant lequel les informations fraîches de révocations ne sont pas disponibles : utilisé dans le champ B<nextUpdate>. Si aucune option n'est présente, alors le champ B<nextUpdate> est omis, ce qui signifie que les informations fraîches de révocations sont disponibles immédiatement.

source: OCSP Response verification.
fr: Vérification de réponse OCSP.

source: OCSP Response follows the rules specified in RFC2560.
fr: La réponse OCSP suit les règles précisées dans la RFC 2560.

source: Initially the OCSP responder certificate is located and the signature on the OCSP request checked using the responder certificate's public key.
fr: Initialement, le certificat de répondeur OCSP est localisé puis la signature de la demande OCSP vérifiée en utilisant la clef publique du certificat de répondeur.

source: Then a normal certificate verify is performed on the OCSP responder certificate building up a certificate chain in the process. The locations of the trusted certificates used to build the chain can be specified by the B<CAfile> and B<CApath> options or they will be looked for in the standard OpenSSL certificates directory.
fr: Ensuite, une vérification normale de certificat est effectuée sur le certificat de répondeur OCSP en construisant une chaîne de certificats dans le processus. Les emplacements de certificats de confiance utilisés pour construire la chaîne peuvent être indiqués par les options B<-CAfile> et B<-CApath> ou ils seront recherchés dans le répertoire standard des certificats OpenSSL.

source: If the initial verify fails then the OCSP verify process halts with an error.
fr: Si la première vérification échoue, alors le processus de vérification OCSP s'arrête avec une erreur.

source: Otherwise the issuing CA certificate in the request is compared to the OCSP responder certificate: if there is a match then the OCSP verify succeeds.
fr: Sinon, le certificat d'autorité de certification émettrice dans la demande est comparé au certificat de répondeur OCSP : en cas de correspondance, la vérification OCSP réussit.

source: Otherwise the OCSP responder certificate's CA is checked against the issuing CA certificate in the request. If there is a match and the OCSPSigning extended key usage is present in the OCSP responder certificate then the OCSP verify succeeds.
fr: Sinon, le certificat d’autorité du répondeur OCSP est comparé au certificat d’autorité émis dans la demande. En cas de correspondance, et que l’utilisation de clef étendue OCSPSigning est présente dans le certificat de répondeur OCSP, la vérification OCSP réussit.

source: Otherwise the root CA of the OCSP responders CA is checked to see if it is trusted for OCSP signing. If it is the OCSP verify succeeds.
fr: Sinon, la confiance de l’autorité de certification racine des autorités de certification des répondeurs OCSP est vérifiée pour la signature OCSP. Si c’est le cas, la vérification OCSP réussit.

source: If none of these checks is successful then the OCSP verify fails.
fr: Si aucune de ces vérifications ne réussit, la vérification OCSP échoue.

source: What this effectively means if that if the OCSP responder certificate is authorised directly by the CA it is issuing revocation information about (and it is correctly configured) then verification will succeed.
fr: Ce que cela signifie effectivement est que si le certificat du répondeur OCSP est autorisé directement par l’autorité de certificat à propos de laquelle il publie des informations de révocations (et qu’il est correctement configuré), alors la vérification réussira.

source: If the OCSP responder is a "global responder" which can give details about multiple CAs and has its own separate certificate chain then its root CA can be trusted for OCSP signing. For example:
fr: Si le répondeur OCSP est un « répondeur global » qui peut donner des précisions sur plusieurs autorités de certification et possède sa propre chaîne de certificats distincte, alors son autorité de certification racine peut être de confiance pour la signature OCSP. Par exemple :

source: openssl x509 -in ocspCA.pem -addtrust OCSPSigning -out trustedCA.pem
fr: openssl x509 -in CAocsp.pem -addtrust OCSPSigning -out CAconfiance.pem

source: Alternatively the responder certificate itself can be explicitly trusted with the B<-VAfile> option.
fr: Alternativement, le certificat de répondeur lui-même peut être approuvé explicitement avec l'option B<-VAfile>.

source: As noted, most of the verify options are for testing or debugging purposes. Normally only the B<-CApath>, B<-CAfile> and (if the responder is a 'global VA') B<-VAfile> options need to be used.
fr: Comme indiqué précédemment, la plupart des options de vérification sont à des fins de test ou de débogage. Normalement, seules les options B<-CApath>, B<-CAfile> et (si le répondeur est un « VA global ») B<-VAfile> doivent être utilisées.

source: The OCSP server is only useful for test and demonstration purposes: it is not really usable as a full OCSP responder. It contains only a very simple HTTP request handling and can only handle the POST form of OCSP queries. It also handles requests serially meaning it cannot respond to new requests until it has processed the current one. The text index file format of revocation is also inefficient for large quantities of revocation data.
fr: Le serveur OCSP n'est utile qu’à des fins de test et de démonstration : il n'est pas vraiment utilisable comme un répondeur OCSP complet. Il ne contient qu'une gestion très basique de la requête HTTP et ne peut que gérer la forme POST des requêtes OCSP. Il gère également les demandes en série, il ne peut donc pas répondre à de nouvelles demandes avant d’avoir traité l’actuelle. Le format de fichier texte d'index de la révocation est également inefficace pour de grandes quantités de données de révocations.

source: It is possible to run the B<ocsp> application in responder mode via a CGI script using the B<respin> and B<respout> options.
fr: L’application B<ocsp> peut être exécutée en mode répondeur à l’aide d’un script CGI en utilisant les options B<-respin> et B<-respout>.

source: Create an OCSP request and write it to a file:
fr: Créer une demande OCSP et écrire dans un fichier :

source: openssl ocsp -issuer issuer.pem -cert c1.pem -cert c2.pem -reqout req.der
fr: openssl ocsp -issuer émetteur.pem -cert c1.pem -cert c2.pem \ -reqout dem.der

source: Send a query to an OCSP responder with URL http://ocsp.myhost.com/ save the response to a file and print it out in text form
fr: Envoyer une requête à un répondeur OCSP avec l'URL http://ocsp.example.com/, sauvegarder la réponse dans un fichier et l’afficher au format texte :

source: openssl ocsp -issuer issuer.pem -cert c1.pem -cert c2.pem \ -url http://ocsp.myhost.com/ -resp_text -respout resp.der
fr: openssl ocsp -issuer émetteur.pem -cert c1.pem -cert c2.pem \ -url http://ocsp.example.com/ -resp_text -respout rep.der

source: Read in an OCSP response and print out text form:
fr: Lire une réponse OCSP et l’afficher au format texte :

source: openssl ocsp -respin resp.der -text
fr: openssl ocsp -respin rep.der -text

source: OCSP server on port 8888 using a standard B<ca> configuration, and a separate responder certificate. All requests and responses are printed to a file.
fr: Serveur OCSP sur le port 8888 utilisant une configuration B<ca> standard et un certificat de répondeur séparé. Toutes les demandes et les réponses sont envoyées dans un fichier :

source: As above but exit after processing one request:
fr: Comme ci-dessus mais en se terminant après traitement d'une demande :

source: Query status information using internally generated request:
fr: Demander des informations d'état en utilisant une demande générée en interne :

source: Query status information using request read from a file, write response to a second file.
fr: Demander des informations d’état en utilisant une demande lue dans un fichier, écrire la réponse dans un second fichier.

source: openssl ocsp -index demoCA/index.txt -rsigner rcert.pem -CA demoCA/cacert.pem -reqin req.der -respout resp.der
fr: openssl ocsp -index demoCA/index.txt -rsigner rcert.pem \ -CA demoCA/cacert.pem -reqin dem.der -respout rep.der

source: passwd - compute password hashes
fr: passwd - Calcul de hachages de mot de passe

source: B<openssl passwd> [B<-crypt>] [B<-1>] [B<-apr1>] [B<-salt> I<string>] [B<-in> I<file>] [B<-stdin>] [B<-noverify>] [B<-quiet>] [B<-table>] {I<password>}
fr: B<openssl passwd> [B<-crypt>] [B<-1>] [B<-apr1>] [B<-salt> I<chaîne>] [B<-in> I<fichier>] [B<-stdin>] [B<-noverify>] [B<-quiet>] [B<-table>] {I<mot_de_passe>}

source: The B<passwd> command computes the hash of a password typed at run-time or the hash of each password in a list. The password list is taken from the named file for option B<-in file>, from stdin for option B<-stdin>, or from the command line, or from the terminal otherwise. The Unix standard algorithm B<crypt> and the MD5-based BSD password algorithm B<1> and its Apache variant B<apr1> are available.
fr: La commande passwd génère le hachage d'un mot de passe saisi lors de l'exécution ou de tous les mots de passe d'une liste. La liste des mots de passe est fournie par le fichier spécifié par l'option B<-in fichier>, par l'entrée standard avec l'option -B<stdin>, par la ligne de commande, ou depuis le terminal autrement. Les algorithmes standard UNIX, B<crypt>, celui des BSD, basé sur MD5, B<1> et la variante d'Apache B<apr1> sont disponibles.

source: Use the B<crypt> algorithm (default).
fr: Utilise l'algorithme B<crypt> (défaut).

source: Use the MD5 based BSD password algorithm B<1>.
fr: Utilise l'algorithme B<1> basé sur MD5 des BSD.

source: Use the B<apr1> algorithm (Apache variant of the BSD algorithm).
fr: Utilise l'algorithme B<apr1> (variante d'Apache de l'algorithme BSD).

source: B<-salt> I<string>
fr: B<-salt> I<chaîne>

source: Use the specified salt. When reading a password from the terminal, this implies B<-noverify>.
fr: Utilise le sel indiqué. Quand le mot de passe est lu sur le terminal, cette option implique l'option B<-noverify>.

source: B<-in> I<file>
fr: B<-in> I<fichier>

source: Read passwords from I<file>.
fr: Lecture des mots de passe à partir de B<fichier>.

source: Read passwords from B<stdin>.
fr: Lecture des mots de passe à partir de l'entrée standard.

source: Don't verify when reading a password from the terminal.
fr: Ne vérifie pas le mot de passe quand il est lu depuis le terminal.

source: Don't output warnings when passwords given at the command line are truncated.
fr: N'affiche pas d'avertissement lorsque des mots de passe donnés comme argument de ligne de commande sont tronqués.

source: In the output list, prepend the cleartext password and a TAB character to each password hash.
fr: Dans la liste de sortie, le mot de passe en clair et un caractère TAB précèdent chaque hachage de mot de passe.

source: B<openssl passwd -crypt -salt xx password> prints B<xxj31ZMTZzkVA>.
fr: B<openssl passwd -crypt -salt xx password> affiche B<xxj31ZMTZzkVA>.

source: B<openssl passwd -1 -salt xxxxxxxx password> prints B<$1$xxxxxxxx$UYCIxa628.9qXjpQCjM4a.>.
fr: B<openssl passwd -1 -salt xxxxxxxx password> affiche B<$1$xxxxxxxx$UYCIxa628.9qXjpQCjM4a.>.

source: B<openssl passwd -apr1 -salt xxxxxxxx password> prints B<$apr1$xxxxxxxx$dxHfLAsjHkDRmG83UXe8K0>.
fr: B<openssl passwd -apr1 -salt xxxxxxxx password> affiche B<$apr1$xxxxxxxx$dxHfLAsjHkDRmG83UXe8K0>.

source: req - PKCS#10 certificate request and certificate generating utility.
fr: req - Utilitaire de génération de certificats et de demandes de certificat PKCS#10

source: B<openssl> B<req> [B<-inform PEM|DER>] [B<-outform PEM|DER>] [B<-in filename>] [B<-passin arg>] [B<-out filename>] [B<-passout arg>] [B<-text>] [B<-pubkey>] [B<-noout>] [B<-verify>] [B<-modulus>] [B<-new>] [B<-rand file(s)>] [B<-newkey rsa:bits>] [B<-newkey alg:file>] [B<-nodes>] [B<-key filename>] [B<-keyform PEM|DER>] [B<-keyout filename>] [B<-keygen_engine id>] [B<-[digest]>] [B<-config filename>] [B<-subj arg>] [B<-multivalue-rdn>] [B<-x509>] [B<-days n>] [B<-set_serial n>] [B<-asn1-kludge>] [B<-no-asn1-kludge>] [B<-newhdr>] [B<-extensions section>] [B<-reqexts section>] [B<-utf8>] [B<-nameopt>] [B<-reqopt>] [B<-subject>] [B<-subj arg>] [B<-batch>] [B<-verbose>] [B<-engine id>]
fr: B<openssl> B<req> [B<-inform> B<PEM>|B<DER>] [B<-outform> B<PEM>|B<DER>] [B<-in> I<nom_fichier>] [B<-passin> I<param>] [B<-out> I<nom_fichier>] [B<-passout> I<param>] [B<-text>] [B<-pubkey>] [B<-noout>] [B<-verify>] [B<-modulus>] [B<-new>] [B<-rand> I<fichier(s)>] [B<-newkey rsa:>I<bits>] [B<-newkey> I<alg>B<:>I<fichier>] [B<-nodes>] [B<-key> I<nom_fichier>] [B<-keyform> B<PEM>|B<DER>] [B<-keyout> I<nom_fichier>] [B<-keygen_engine> I<id>] [B<->[I<condensé>]] [B<-config> I<nom_fichier>] [B<-subj> I<param>] [B<-multivalue-rdn>] [B<-x509>] [B<-days> I<n>] [B<-set_serial> I<n>] [B<-asn1-kludge>] [B<-no-asn1-kludge>][B<-newhdr>] [B<-extensions> I<section>] [B<-reqexts> I<section>] [B<-utf8>] [B<-nameopt>] [B<-reqopt>] [B<-subject>] [B<-subj> I<param>] [B<-batch>] [B<-verbose>] [B<-engine> I<id>]

source: The B<req> command primarily creates and processes certificate requests in PKCS#10 format. It can additionally create self signed certificates for use as root CAs for example.
fr: La commande B<req> crée et traite des demandes de certificats au format PKCS#10. En plus, elle peut créer des certificats autosignés servant par exemple de certificats racine d'autorité de certification.

source: B<-inform DER|PEM>
fr: B<-inform> B<DER>|B<PEM>

source: This specifies the input format. The B<DER> option uses an ASN1 DER encoded form compatible with the PKCS#10. The B<PEM> form is the default format: it consists of the B<DER> format base64 encoded with additional header and footer lines.
fr: Indiquer le format d'entrée. L'option B<DER> utilise l'encodage ASN1 DER compatible avec le format PKCS#10. La forme B<PEM> est le format par défaut : il s'agit du format B<DER> encodé en base64 avec des lignes supplémentaires au début et à la fin.

source: B<-outform DER|PEM>
fr: B<-outform> B<DER>|B<PEM>

source: This specifies the output format, the options have the same meaning as the B<-inform> option.
fr: Indiquer le format de sortie. Les options ont la même signification que pour l'option B<-inform>.

source: This specifies the input filename to read a request from or standard input if this option is not specified. A request is only read if the creation options (B<-new> and B<-newkey>) are not specified.
fr: Indiquer le nom du fichier d'entrée à partir duquel la demande est lue. Par défaut, l'entrée standard sera lue si cette option n'est pas indiquée. Une demande est uniquement lue si les options de création (B<-new> et B<-newkey>) ne sont pas indiquées.
