Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: if set to the value B<no> this disables prompting of certificate fields and just takes values from the config file directly. It also changes the expected format of the B<distinguished_name> and B<attributes> sections.
fr: Si cela vaut B<no>, aucun champ du certificat ne sera demandé à l'utilisateur et les valeurs du fichier de configuration sont prises d'office. Cela change également le format attendu des sections B<distinguished_name> et B<attributes>.

source: if set to the value B<yes> then field values to be interpreted as UTF8 strings, by default they are interpreted as ASCII. This means that the field values, whether prompted from a terminal or obtained from a configuration file, must be valid UTF8 strings.
fr: Si définie à B<yes>, alors les valeurs des champs doivent être interprétées comme des chaînes UTF-8. Par défaut, elles sont interprétées comme des chaînes ASCII. Cela signifie que les valeurs des champs, qu'elles soient demandées sur le terminal ou fournies par le fichier de configuration, doivent être des chaînes UTF-8 valables.

source: this specifies the section containing any request attributes: its format is the same as B<distinguished_name>. Typically these may contain the challengePassword or unstructuredName types. They are currently ignored by OpenSSL's request signing utilities but some CAs might want them.
fr: Indique la section contenant les attributs pour les demandes : son format est identique à celui de la section B<distinguished_name>. Typiquement, ces attributs contiennent les types challengePassword et unstructuredName. Ils sont actuellement ignorés par les utilitaires de signature d'OpenSSL mais peuvent être requis par certaines autorités de certification.

source: This specifies the section containing the distinguished name fields to prompt for when generating a certificate or certificate request. The format is described in the next section.
fr: Indique la section contenant les champs des noms distinctifs (« distinguished name ») à demander lors d'une génération de certificat ou d'une demande de certificat. Le format est décrit dans la section suivante.

source: DISTINGUISHED NAME AND ATTRIBUTE SECTION FORMAT
fr: FORMAT DES SECTIONS DE NOM DISTINCTIF ET D'ATTRIBUT

source: There are two separate formats for the distinguished name and attribute sections. If the B<prompt> option is set to B<no> then these sections just consist of field names and values: for example,
fr: Il y a deux formats différents pour les sections de nom distinctif et d'attribut. Lorsque l'option B<prompt> vaut B<no>, alors ces sections contiennent uniquement les noms des champs et leurs valeurs. Par exemple :

source: CN=My Name OU=My Organization emailAddress=someone@somewhere.org
fr: CN=Mon Nom OU=Mon Organisation emailAddress=quelqu_un@example.org

source: This allows external programs (e.g. GUI based) to generate a template file with all the field names and values and just pass it to B<req>. An example of this kind of configuration file is contained in the B<EXAMPLES> section.
fr: Cela permet aux programmes externes (par exemple des interfaces graphiques) de générer un fichier modèle à passer à B<req>. Un exemple de ce type de fichier de configuration se trouve dans la section B<EXEMPLES>.

source: Alternatively if the B<prompt> option is absent or not set to B<no> then the file contains field prompting information. It consists of lines of the form:
fr: Dans l'absence de l'option B<prompt> ou si celle-ci ne vaut pas B<no>, le fichier contient des informations pour la demande à l'invite de commandes. Cela se présente sous la forme suivante :

source: fieldName="prompt" fieldName_default="default field value" fieldName_min= 2 fieldName_max= 4
fr: nomChamp="invite" nomChamp_default="Valeur du champ par défaut" nomChamp_min= 2 nomChamp_max= 4

source: "fieldName" is the field name being used, for example commonName (or CN). The "prompt" string is used to ask the user to enter the relevant details. If the user enters nothing then the default value is used if no default value is present then the field is omitted. A field can still be omitted if a default value is present if the user just enters the '.' character.
fr: « nomChamp » est le nom du champ à utiliser, par exemple commonName (ou CN, nom commun). La chaîne « invite » est affichée lors de la demande à l'utilisateur. Si l'utilisateur ne saisit rien, alors la valeur par défaut, « nomChamp_default », est utilisée ; en l'absence de valeur par défaut, le champ est omis. Un champ peut toujours être omis, en présence de valeur par défaut, en saisissant uniquement le caractère « . ».

source: The number of characters entered must be between the fieldName_min and fieldName_max limits: there may be additional restrictions based on the field being used (for example countryName can only ever be two characters long and must fit in a PrintableString).
fr: Le nombre de caractères saisis doit être entre les limites de nomChamp_min et nomChamp_max : il peut y avoir d'autres contraintes basées sur le champ utilisé (par exemple, countryName doit toujours avoir une longueur de deux et doit entrer dans un PrintableString).

source: Some fields (such as organizationName) can be used more than once in a DN. This presents a problem because configuration files will not recognize the same name occurring twice. To avoid this problem if the fieldName contains some characters followed by a full stop they will be ignored. So for example a second organizationName can be input by calling it "1.organizationName".
fr: Certains champs (comme organizationName) peuvent être utilisés plus d'une fois dans un DN. Cela pose problème car dans les fichiers de configuration, le même nom de champ ne sera pas pris en compte à deux reprises. Pour éviter ce problème, si le nomChamp contient des caractères suivi d'un point (« . »), ils seront ignorés. Ainsi, par exemple, une deuxième entrée pour organizationName peut être entrée en l'appelant « 1.organizationName ».

source: The actual permitted field names are any object identifier short or long names. These are compiled into OpenSSL and include the usual values such as commonName, countryName, localityName, organizationName, organizationUnitName, stateOrProvinceName. Additionally emailAddress is include as well as name, surname, givenName initials and dnQualifier.
fr: Les noms de champ permis sont les libellés longs ou courts de tous les identifiants d'objet. Ceux-ci sont compilés avec OpenSSL et incluent les libellés longs usuels comme commonName, countryName, localityName, organizationName, organizationUnitName, stateOrProvinceName. En plus, emailAddress est présent tout comme name, surname, givenName, initials et dnQualifier.

source: Additional object identifiers can be defined with the B<oid_file> or B<oid_section> options in the configuration file. Any additional fields will be treated as though they were a DirectoryString.
fr: Des identifiants d'objet supplémentaires peuvent être définis dans un fichier (B<oid_file>) ou une section (B<oid_section>) dans le fichier de configuration. Tous les champs supplémentaires sont traités comme des DirectoryString.

source: Examine and verify certificate request:
fr: Examiner et vérifier une demande de certificat :

source: openssl req -in req.pem -text -verify -noout
fr: openssl req -in dem.pem -text -verify -noout

source: Create a private key and then generate a certificate request from it:
fr: Créer une clef privée et générer la demande de certificat correspondante :

source: openssl genrsa -out key.pem 1024 openssl req -new -key key.pem -out req.pem
fr: openssl genrsa -out clef.pem 1024 openssl req -new -key clef.pem -out dem.pem

source: The same but just using req:
fr: La même chose en utilisant uniquement req :

source: openssl req -newkey rsa:1024 -keyout key.pem -out req.pem
fr: openssl req -newkey rsa:1024 -keyout clef.pem -out dem.pem

source: Generate a self signed root certificate:
fr: Générer un certificat racine autosigné :

source: openssl req -x509 -newkey rsa:1024 -keyout key.pem -out req.pem
fr: openssl req -x509 -newkey rsa:1024 -keyout clef.pem -out clef.pem

source: Example of a file pointed to by the B<oid_file> option:
fr: Exemple d'un fichier indiqué avec l'option B<oid_file> :

source: 1.2.3.4 shortName A longer Name 1.2.3.6 otherName Other longer Name
fr: 1.2.3.4 nomCourt Un nom plus long 1.2.3.6 autreNom Autre nom plus long

source: Example of a section pointed to by B<oid_section> making use of variable expansion:
fr: Exemple d'une section pouvant être référencée par B<oid_section> en utilisant l'expansion de variables :

source: Sample configuration file prompting for field values:
fr: Fichier de configuration type demandant les valeurs des champs :

source: [ req ] default_bits = 1024 default_keyfile = privkey.pem distinguished_name = req_distinguished_name attributes = req_attributes x509_extensions = v3_ca
fr: [ req ] default_bits = 1024 default_keyfile = clefpriv.pem distinguished_name = dem_noms_distinctifs attributes = dem_attributs x509_extensions = v3_ca

source: [ req_distinguished_name ] countryName = Country Name (2 letter code) countryName_default = AU countryName_min = 2 countryName_max = 2
fr: [ dem_noms_distinctifs ] countryName = Nom du pays (code 2 lettres ) countryName_default = FR countryName_min = 2 countryName_max = 2

source: localityName = Locality Name (eg, city)
fr: localityName = Nom du lieu (par exemple, la ville)

source: organizationalUnitName = Organizational Unit Name (eg, section)
fr: organizationalUnitName = Nom d'unité dans l'organisation (sec.)

source: commonName = Common Name (eg, YOUR name) commonName_max = 64
fr: commonName = Nom commun (par exemple, VOTRE nom) commonName_max = 64

source: emailAddress = Email Address emailAddress_max = 40
fr: emailAddress = Adresse électronique emailAddress_max = 40

source: [ req_attributes ] challengePassword = A challenge password challengePassword_min = 4 challengePassword_max = 20
fr: [ dem_attributs ] challengePassword = Un mot de passe challengePassword_min = 4 challengePassword_max = 20

source: Sample configuration containing all field values:
fr: Configuration type contenant toutes les valeurs des champs :

source: [ req ] default_bits = 1024 default_keyfile = keyfile.pem distinguished_name = req_distinguished_name attributes = req_attributes prompt = no output_password = mypass
fr: [ req ] default_bits = 1024 default_keyfile = fichier_clef.pem distinguished_name = dem_noms_distintifs attributes = dem_attributs prompt = no output_password = mon_pass

source: [ req_distinguished_name ] C = GB ST = Test State or Province L = Test Locality O = Organization Name OU = Organizational Unit Name CN = Common Name emailAddress = test@email.address
fr: [ dem_noms_distinctifs ] C = FR ST = Département de test L = Lieu de test O = Nom de l'organisation OU = Nom de l'unité dans l'organisation CN = Nom commun emailAddress = test@adresse.electronique

source: [ req_attributes ] challengePassword = A challenge password
fr: [ dem_attributs ] challengePassword = Un mot de passe

source: The header and footer lines in the B<PEM> format are normally:
fr: Les lignes de début et de fin dans le format B<PEM> sont normalement :

source: some software (some versions of Netscape certificate server) instead needs:
fr: Certains logiciels (certaines versions de Netscape certificate server) nécessitent à la place :

source: which is produced with the B<-newhdr> option but is otherwise compatible. Either form is accepted transparently on input.
fr: qui est produit avec l'option B<-newhdr> mais reste compatible autrement. À l'entrée, les deux versions sont acceptées de façon transparente.

source: The certificate requests generated by B<Xenroll> with MSIE have extensions added. It includes the B<keyUsage> extension which determines the type of key (signature only or general purpose) and any additional OIDs entered by the script in an extendedKeyUsage extension.
fr: Les demandes de certificat générées par B<Xenroll> avec MSIE ont des extensions supplémentaires. Elles incluent une extension B<keyUsage> qui détermine le type de la clef (signature ou général) et tous les OID supplémentaires entrés par le script dans une extension extendedKeyUsage.

source: DIAGNOSTICS
fr: DIAGNOSTIC

source: The following messages are frequently asked about:
fr: Les messages suivants soulèvent souvent des interrogations :

source: This is followed some time later by...
fr: Qui est suivi peu après par :

source: The first error message is the clue: it can't find the configuration file! Certain operations (like examining a certificate request) don't need a configuration file so its use isn't enforced. Generation of certificates or requests however does need a configuration file. This could be regarded as a bug.
fr: Le premier message explique le tout : le fichier de configuration est introuvable ! Certaines opérations (telle que la vérification d'une demande de certificat) ne nécessitent pas de fichier de configuration donc son utilisation n'est pas obligatoire. La génération de certificats ou de demandes, au contraire, nécessite un fichier de configuration. Cela peut être considéré comme un bogue.

source: Another puzzling message is this:
fr: Un autre message portant à confusion est :

source: this is displayed when no attributes are present and the request includes the correct empty B<SET OF> structure (the DER encoding of which is 0xa0 0x00). If you just see:
fr: C'est affiché lorsqu'aucun attribut n'est présent et que la demande inclut la structure vide B<SET OF> correcte (dont l'encodage DER est 0xa0 0x00). S'il n'y a que :

source: then the B<SET OF> is missing and the encoding is technically invalid (but it is tolerated). See the description of the command line option B<-asn1-kludge> for more information.
fr: alors le B<SET OF> manque et l'encodage est techniquement incorrect. Consultez la description de l'option B<-asn1-kludge> pour plus de renseignements.

source: ENVIRONMENT VARIABLES
fr: VARIABLES D'ENVIRONNEMENT

source: The variable B<OPENSSL_CONF> if defined allows an alternative configuration file location to be specified, it will be overridden by the B<-config> command line switch if it is present. For compatibility reasons the B<SSLEAY_CONF> environment variable serves the same purpose but its use is discouraged.
fr: La variable B<OPENSSL_CONF>, si définie, permet d'indiquer un fichier de configuration alternatif. Si l'option B<-config> de la ligne de commande est présente, la variable d'environnement sera ignorée. Pour des raisons de compatibilité, la variable B<SSLEAY_CONF> a la même utilisation, mais son utilisation est déconseillée.

source: OpenSSL's handling of T61Strings (aka TeletexStrings) is broken: it effectively treats them as ISO-8859-1 (Latin 1), Netscape and MSIE have similar behaviour. This can cause problems if you need characters that aren't available in PrintableStrings and you don't want to or can't use BMPStrings.
fr: La gestion des T61Strings (ou TeletexStrings) par OpenSSL est cassée : elles sont traitées effectivement comme des chaînes ISO-8859-1 (Latin 1), Netscape et MSIE ont un comportement similaire. Cela peut poser problème lorsque vous avez besoin de caractères qui ne sont pas disponibles dans les PrintableStrings et que vous ne voulez ou pouvez pas utiliser les BMPStrings.

source: As a consequence of the T61String handling the only correct way to represent accented characters in OpenSSL is to use a BMPString: unfortunately Netscape currently chokes on these. If you have to use accented characters with Netscape and MSIE then you currently need to use the invalid T61String form.
fr: La conséquence de cette gestion de T61String est que la seule façon correcte de représenter des caractères accentués dans OpenSSL est d'utiliser un BMPString : malheureusement, Netscape ne les aime pas. Ainsi, pour utiliser les caractères accentués avec Netscape et MSIE, vous devrez utiliser actuellement le format incorrect des T61Strings.

source: The current prompting is not very friendly. It doesn't allow you to confirm what you've just entered. Other things like extensions in certificate requests are statically defined in the configuration file. Some of these: like an email address in subjectAltName should be input by the user.
fr: La demande à l'invite de commande n'est pas très ergonomique. Vous ne pouvez confirmer les saisies, et les extensions doivent être définies de façon statique dans le fichier de configuration. Quelques-unes, comme une adresse électronique dans le subjectAltName, devraient être données par l'utilisateur.

source: L<x509(1)|x509(1)>, L<ca(1)|ca(1)>, L<genrsa(1)|genrsa(1)>, L<gendsa(1)|gendsa(1)>, L<config(5)|config(5)>, L<x509v3_config(5)|x509v3_config(5)>
fr: L<B<x509>(1)|x509(1)>, L<B<ca>(1)|ca(1)>, L<B<genrsa>(1)|genrsa(1)>, L<B<gendsa>(1)|gendsa(1)>, L<B<config>(5)|config(5)>, L<B<x509v3_config>(5)|x509v3_config(5)>

source: sess_id - SSL/TLS session handling utility
fr: sess_id - Utilitaire de manipulation de sessions SSL/TLS

source: B<openssl> B<sess_id> [B<-inform PEM|DER>] [B<-outform PEM|DER>] [B<-in filename>] [B<-out filename>] [B<-text>] [B<-noout>] [B<-context ID>]
fr: B<openssl sess_id> [B<-inform PEM>|B<DER>] [B<-outform PEM>|B<DER>] [B<-in> I<nom_fichier>] [B<-out> I<nom_fichier>] [B<-text>] [B<-noout>] [B<-context> I<identifiant>]

source: The B<sess_id> process the encoded version of the SSL session structure and optionally prints out SSL session details (for example the SSL session master key) in human readable format. Since this is a diagnostic tool that needs some knowledge of the SSL protocol to use properly, most users will not need to use it.
fr: B<sess_id> analyse la version encodée de la structure de sessions SSL et affiche facultativement les détails de la session SSL (par exemple la clef maîtresse de la session SSL) dans un format lisible. Puisque c'est un outil de diagnostic qui à besoin de certaines connaissances du protocole SSL pour être utilisé correctement, la plupart des utilisateurs n'ont pas besoin de l'utiliser.

source: This specifies the input format. The B<DER> option uses an ASN1 DER encoded format containing session details. The precise format can vary from one version to the next. The B<PEM> form is the default format: it consists of the B<DER> format base64 encoded with additional header and footer lines.
fr: Indiquer le format d'entrée. L'option B<DER> utilise un format d'encodage ASN1 DER, contenant les détails de session. Le format précis peut varier d'une version à l'autre. B<PEM>, est le format par défaut : l'option consiste à encoder le format B<DER> en base64 avec des lignes supplémentaires au début et à la fin.

source: This specifies the input filename to read session information from or standard input by default.
fr: Indiquer le fichier d'information de session à lire en entrée. L'entrée standard est utilisée par défaut.

source: This specifies the output filename to write session information to or standard output if this option is not specified.
fr: Indiquer le fichier de sortie où écrire les informations de session. La sortie standard est utilisée si cette option n'est pas spécifiée.

source: prints out the various public or private key components in plain text in addition to the encoded version.
fr: Afficher les différentes composantes des clefs privées ou publiques au format texte en plus de la version encodée.

source: if a certificate is present in the session it will be output using this option, if the B<-text> option is also present then it will be printed out in text form.
fr: Avec cette option, un certificat sera produit s'il est présent dans la session. Si l'option B<-text> est également présente, alors il sera affiché au format texte.

source: this option prevents output of the encoded version of the session.
fr: Empêcher la sortie de la version encodée de la session.

source: B<-context ID>
fr: B<-context> I<identifiant>

source: this option can set the session id so the output session information uses the supplied ID. The ID can be any string of characters. This option wont normally be used.
fr: Définir l'I<identifiant> de session, de telle sorte que les informations de la session de sortie utilise l'identifiant fourni. L'identifiant peut-être une chaîne de caractères quelconque. Cette option ne sera pas utilisée normalement.

source: OUTPUT
fr: SORTIE

source: Typical output:
fr: Sortie typique :

source: Theses are described below in more detail.
fr: Les champs sont détaillés ci-dessous.

source: this is the protocol in use TLSv1, SSLv3 or SSLv2.
fr: Le protocole utilisé : TLSv1, SSLv3 ou SSLv2.

source: the cipher used this is the actual raw SSL or TLS cipher code, see the SSL or TLS specifications for more information.
fr: L'algorithme de chiffrement utilisé. Il s'agit du code d'algorithme brut SSL ou TLS, consultez les spécifications SSL ou TLS pour plus d'informations.

source: the SSL session ID in hex format.
fr: L'identifiant de session SSL au format hexadécimal.

source: the session ID context in hex format.
fr: Le contexte de l'identifiant de session au format hexadécimal.

source: this is the SSL session master key.
fr: La clef maîtresse de la session SSL.

source: the key argument, this is only used in SSL v2.
fr: Le paramètre de la clef, uniquement utilisé avec SSL v2.

source: this is the session start time represented as an integer in standard Unix format.
fr: La date de démarrage de la session, représentée par un entier, au format UNIX standard.

source: the timeout in seconds.
fr: La durée d'expiration en secondes.

source: this is the return code when an SSL client certificate is verified.
fr: Le code de retour quand un certificat client SSL est vérifié.

source: The PEM encoded session format uses the header and footer lines:
fr: Le format PEM d'encodage des sessions utilise les lignes suivantes au début et à la fin :

source: Since the SSL session output contains the master key it is possible to read the contents of an encrypted session using this information. Therefore appropriate security precautions should be taken if the information is being output by a "real" application. This is however strongly discouraged and should only be used for debugging purposes.
fr: Puisque la sortie de la session SSL contient la clef maîtresse, il est possible de lire le contenu d'une session cryptée en utilisant cette information. Ainsi, des précautions de sécurité appropriées doivent être prises si les informations sont sorties par une application « réelle ». Ce n'est toutefois pas encouragé et ne devrait être utilisé que pour le débogage.

source: The cipher and start time should be printed out in human readable form.
fr: L'algorithme de chiffrement et la date de début devraient être affichés dans une forme lisible.

source: L<ciphers(1)|ciphers(1)>, L<s_server(1)|s_server(1)>
fr: L<B<ciphers>(1)|ciphers(1)>, L<B<s_server>(1)|s_server(1)>

source: speed - test library performance
fr: speed - Tester les performances de la bibliothèque

source: B<openssl speed> [B<-engine id>] [B<md2>] [B<mdc2>] [B<md5>] [B<hmac>] [B<sha1>] [B<rmd160>] [B<idea-cbc>] [B<rc2-cbc>] [B<rc5-cbc>] [B<bf-cbc>] [B<des-cbc>] [B<des-ede3>] [B<rc4>] [B<rsa512>] [B<rsa1024>] [B<rsa2048>] [B<rsa4096>] [B<dsa512>] [B<dsa1024>] [B<dsa2048>] [B<idea>] [B<rc2>] [B<des>] [B<rsa>] [B<blowfish>]
fr: B<openssl speed> [B<-engine> I<id>] [B<md2>] [B<mdc2>] [B<md5>] [B<hmac>] [B<sha1>] [B<rmd160>] [B<idea-cbc>] [B<rc2-cbc>] [B<rc5-cbc>] [B<bf-cbc>] [B<des-cbc>] [B<des-ede3>] [B<rc4>] [B<rsa512>] [B<rsa1024>] [B<rsa2048>] [B<rsa4096>] [B<dsa512>] [B<dsa1024>] [B<dsa2048>] [B<idea>] [B<rc2>] [B<des>] [B<rsa>] [B<blowfish>]

source: This command is used to test the performance of cryptographic algorithms.
fr: Cette commande permet de tester les performances des algorithmes cryptographiques.
