Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: In order for a directory to be processed, the user must have write permissions on that directory, otherwise it will be skipped. The links created are of the form C<HHHHHHHH.D>, where each B<H> is a hexadecimal character and B<D> is a single decimal digit. When processing a directory, B<c_rehash> will first remove all links that have a name in that syntax. If you have links in that format used for other purposes, they will be removed. Hashes for CRL's look similar except the letter B<r> appears after the period, like this: C<HHHHHHHH.rD>.
fr: Pour qu’un répertoire soit traité, l’utilisateur doit avoir le droit d’écrire dedans, sinon il sera sauté. Les liens créés sont de la forme I<HHHHHHHH>B<.>I<D>, où chaque I<H> est un caractère hexadécimal et I<D> un seul chiffre décimal. Lors du traitement d’un répertoire, B<c_rehash> commencera par supprimer tous les liens qui ont un nom correspondant à cette syntaxe. Si des liens de cette forme sont utilisés pour autre chose, ils seront supprimés. Les hachages de listes de révocations de certificat ressemblent à cela, à part que la lettre B<r> est présente après le point, comme ceci : I<HHHHHHHH>B<.r>I<D>.

source: Multiple objects may have the same hash; they will be indicated by incrementing the B<D> value. Duplicates are found by comparing the full SHA-1 fingerprint. A warning will be displayed if a duplicate is found.
fr: Plusieurs objets pourraient avoir le même hachage ; ils seront indiqués en incrémentant la valeur de I<D>. Des duplicatas sont trouvés en comparant l’empreinte SHA-1 complète. Un avertissement sera affiché si un duplicata est trouvé.

source: A warning will also be displayed if there are B<.pem> files that cannot be parsed as either a certificate or a CRL.
fr: Un avertissement sera aussi affiché si un fichier I<.pem> ne peut pas être traité comme un certificat ou comme une liste de révocations de certificat.

source: The program uses the B<openssl> program to compute the hashes and fingerprints. If not found in the user's B<PATH>, then set the B<OPENSSL> environment variable to the full pathname. Any program can be used, it will be invoked as follows for either a certificate or CRL:
fr: Le programme utilise le programme B<openssl> pour calculer les hachages et les empreintes. S’il n’est pas dans le B<PATH> de l’utilisateur, définissez la variable d’environnement B<OPENSSL> à son chemin complet. N’importe quel programme peut être utilisé, il sera invoqué comme ceci pour un certificat ou une liste de révocations de certificat :

source: where B<FFFFFF> is the filename. It must output the hash of the file on the first line, and the fingerprint on the second, optionally prefixed with some text and an equals sign.
fr: où I<FFFFFF> est le nom du fichier. Le résultat doit contenir le hachage du fichier en première ligne et l’empreinte en deuxième ligne, facultativement précédés de texte et d’un signe égal.

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: The path to an executable to use to generate hashes and fingerprints (see above).
fr: Le chemin vers un exécutable à utiliser pour générer des hachages et des empreintes (voir ci-dessus).

source: Colon separated list of directories to operate on. Ignored if directories are listed on the command line.
fr: Liste de répertoires séparés par des deux-points sur lesquels opérer. La liste est ignorée si des répertoires sont fournis sur la ligne de commande.

source: L<openssl(1)|openssl(1)>, L<crl(1)|crl(1)>. L<x509(1)|x509(1)>.
fr: L<B<crl>(1)|crl(1)>, L<B<openssl>(1)|openssl(1)>, L<B<x509>(1)|x509(1)>

source: dgst, sha, sha1, mdc2, ripemd160, sha224, sha256, sha384, sha512, md2, md4, md5, dss1 - message digests
fr: dgst, sha, sha1, mdc2, ripemd160, sha224, sha256, sha384, sha512, md2, md4, md5, dss1 - Condensés de messages

source: B<openssl> B<dgst> [B<-sha|-sha1|-mdc2|-ripemd160|-sha224|-sha256|-sha384|-sha512|-md2|-md4|-md5|-dss1>] [B<-c>] [B<-d>] [B<-hex>] [B<-binary>] [B<-r>] [B<-hmac arg>] [B<-non-fips-allow>] [B<-out filename>] [B<-sign filename>] [B<-keyform arg>] [B<-passin arg>] [B<-verify filename>] [B<-prverify filename>] [B<-signature filename>] [B<-hmac key>] [B<-non-fips-allow>] [B<-fips-fingerprint>] [B<file...>]
fr: B<openssl> B<dgst> [B<-sha> | B<-sha1> | B<-mdc2> | B<-ripemd160> | B<-sha224> | B<-sha256> | B<-sha384> | B<-sha512> | B<-md2> | B<-md4> | B<-md5> | B<-dss1>] [B<-c>] [B<-d>] [B<-hex>] [B<-binary>] [B<-r>] [B<-hmac> I<param>] [B<-non-fips-allow>] [B<-out> I<nom_fichier>] [B<-sign> I<nom_fichier>] [B<-keyform> I<param>] [B<-passin> I<param>] [B<-verify> I<nom_fichier>] [B<-prverify> I<nom_fichier>] [B<-signature> I<nom_fichier>] [B<-hmac> I<clef>] [B<-non-fips-allow>] [B<-fips-fingerprint>] [I<fichier> ...]

source: B<openssl> [I<digest>] [B<...>]
fr: B<openssl> [I<condensé> ...]

source: The digest functions output the message digest of a supplied file or files in hexadecimal. The digest functions also generate and verify digital signatures using message digests.
fr: Les fonctions de condensé génèrent les condensés de message d'un ou plusieurs fichiers fournis sous forme hexadécimale. Les fonctions de condensé créent et vérifient aussi des signatures numériques en utilisant des condensés de message.

source: print out the digest in two digit groups separated by colons, only relevant if B<hex> format output is used.
fr: Afficher le condensé par groupe de deux chiffres séparés par des deux-points, uniquement applicable si le format de sortie B<hex> est employé.

source: print out BIO debugging information.
fr: Afficher les informations de débogage BIO.

source: digest is to be output as a hex dump. This is the default case for a "normal" digest as opposed to a digital signature. See NOTES below for digital signatures using B<-hex>.
fr: Afficher le condensé en hexadécimal brut. C'est le cas par défaut pour les condensés « normaux » par opposition aux signatures numériques. Consultez les B<NOTES> ci-dessous pour des signatures numériques utilisant B<-hex>.

source: output the digest or signature in binary form.
fr: Afficher le condensé sous forme binaire.

source: output the digest in the "coreutils" format used by programs like B<sha1sum>.
fr: Afficher le condensé au format de « coreutils » utilisé par des programmes comme B<sha1sum>.

source: B<-hmac arg>
fr: B<-hmac> I<param>

source: set the HMAC key to "arg".
fr: Définir la clef HMAC à I<param>.

source: Allow use of non FIPS digest when in FIPS mode. This has no effect when not in FIPS mode.
fr: Permettre l’utilisation de condensé non FIPS en mode FIPS. Cela n’a aucun effet hors mode FIPS.

source: B<-out filename>
fr: B<-out> I<nom_fichier>

source: filename to output to, or standard output by default.
fr: Nom du fichier de sortie. Par défaut, la sortie standard est utilisée.

source: B<-sign filename>
fr: B<-sign> I<nom_fichier>

source: digitally sign the digest using the private key in "filename".
fr: Signer numériquement le condensé en utilisant la clef privée de I<nom_fichier>.

source: B<-keyform arg>
fr: B<-keyform> I<param>

source: Specifies the key format to sign digest with. The DER, PEM, P12, and ENGINE formats are supported.
fr: Indiquer le format de clef avec lequel signer le condensé. Seuls les formats DER, PEM, P12 et ENGINE sont pris en charge.

source: B<-engine id>
fr: B<-engine> I<id>

source: Use engine B<id> for operations (including private key storage). This engine is not used as source for digest algorithms, unless it is also specified in the configuration file.
fr: Utiliser le moteur I<id> pour les opérations (y compris le stockage de la clef privée). Ce moteur n'est pas utilisé en source pour les algorithmes de condensé, à moins que cela soit aussi indiqué dans le fichier de configuration.

source: B<-sigopt nm:v>
fr: B<-sigopt> I<nm>B<:>I<v>

source: Pass options to the signature algorithm during sign or verify operations. Names and values of these options are algorithm-specific.
fr: Passer des options à l'algorithme de signature pendant les opérations de signature ou de vérification. Les noms et valeurs de ces options sont spécifiques à l'algorithme.

source: B<-passin arg>
fr: B<-passin> I<param>

source: the private key password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source du mot de passe de la clef privée. Pour plus d'informations sur le format de I<param>, consultez la section B<PARAMÈTRES DE PHRASE SECRÈTE> d'L<B<openssl>(1)|openssl(1)>.

source: B<-verify filename>
fr: B<-verify> I<nom_fichier>

source: verify the signature using the the public key in "filename". The output is either "Verification OK" or "Verification Failure".
fr: Vérifier la signature en utilisant la clef publique de I<nom_fichier>. Le résultat est soit « Verification OK » soit « Verification Failure ».

source: B<-prverify filename>
fr: B<-prverify> I<nom_fichier>

source: verify the signature using the the private key in "filename".
fr: Vérifier la signature en utilisant la clef privée de I<nom_fichier>.

source: B<-signature filename>
fr: B<-signature> I<nom_fichier>

source: the actual signature to verify.
fr: La signature à vérifier.

source: B<-hmac key>
fr: B<-hmac> I<clef>

source: create a hashed MAC using "key".
fr: Créer un MAC haché en utilisant I<clef>.

source: B<-mac alg>
fr: B<-mac> I<alg>

source: create MAC (keyed Message Authentication Code). The most popular MAC algorithm is HMAC (hash-based MAC), but there are other MAC algorithms which are not based on hash, for instance B<gost-mac> algorithm, supported by B<ccgost> engine. MAC keys and other options should be set via B<-macopt> parameter.
fr: Créer un MAC (code d'authentification de message). L'algorithme MAC le plus répandu est HMAC (code d'authentification d'une empreinte cryptographique de message avec clef), mais d'autres algorithmes MAC pas à base de hachage existent, comme l'algorithme B<gost-mac> du moteur B<ccgost>. Les clefs MAC et d'autres options devraient être définies par le paramètre B<-macopt>.

source: B<-macopt nm:v>
fr: B<-macopt> I<nm>B<:>I<v>

source: Passes options to MAC algorithm, specified by B<-mac> key. Following options are supported by both by B<HMAC> and B<gost-mac>:
fr: Passer des options à l'algorithme MAC, indiqué par la clef B<-mac>. Les options suivantes sont permises à la fois par B<HMAC> et B<gost-mac> :

source: B<key:string>
fr: B<key:>I<chaîne>

source: Specifies MAC key as alphnumeric string (use if key contain printable characters only). String length must conform to any restrictions of the MAC algorithm for example exactly 32 chars for gost-mac.
fr: Indique la clef MAC sous forme de chaîne alphanumérique (à n'utiliser que si la clef contient exclusivement des caractères imprimables). La longueur de chaîne doit être conforme à toutes les restrictions de l'algorithme MAC, par exemple exactement 32 caractères pour gost-mac.

source: B<hexkey:string>
fr: B<hexkey:>I<chaîne>

source: Specifies MAC key in hexadecimal form (two hex digits per byte). Key length must conform to any restrictions of the MAC algorithm for example exactly 32 chars for gost-mac.
fr: Indique la clef MAC sous forme hexadécimale (deux chiffres hexadécimaux par octet). La longueur de clef doit être conforme à toutes les restrictions de l'algorithme MAC, par exemple exactement 32 caractères pour gost-mac.

source: B<-rand file(s)>
fr: B<-rand> I<fichier(s)>

source: a file or files containing random data used to seed the random number generator, or an EGD socket (see L<RAND_egd(3)|RAND_egd(3)>). Multiple files can be specified separated by a OS-dependent character. The separator is B<;> for MS-Windows, B<,> for OpenVMS, and B<:> for all others.
fr: Un ou plusieurs fichiers contenant des données aléatoires utilisées pour initialiser le générateur de nombres pseudoaléatoires, ou une socket EGD (consultez L<RAND_egd(3)|RAND_egd(3)>). Plusieurs fichiers peuvent être indiqués en utilisant le séparateur du système d'exploitation : « B<;> » pour Windows, « B<,> » pour OpenVMS et « B<:> » pour tous les autres.

source: enable use of non-FIPS algorithms such as MD5 even in FIPS mode.
fr: Activer l’utilisation d’algorithmes non FIPS comme MD5 même en mode FIPS.

source: compute HMAC using a specific key for certain OpenSSL-FIPS operations.
fr: Calculer HMAC en utilisant une clef spécifique pour certaines opérations OpenSSL-FIPS.

source: B<file...>
fr: I<fichier> ...

source: file or files to digest. If no files are specified then standard input is used.
fr: Le ou les I<fichier>s à traiter. Par défaut, l'entrée standard est utilisée.

source: To create a hex-encoded message digest of a file: openssl dgst -md5 -hex file.txt
fr: Pour créer un condensé de message encodé en hexadécimal d’un fichier : openssl dgst -md5 -hex fichier.txt

source: To sign a file using SHA-256 with binary file output: openssl dgst -sha256 -sign privatekey.pem -out signature.sign file.txt
fr: Pour signer un fichier en utilisant SHA-256 avec un fichier binaire en sortie : openssl dgst -sha256 -sign clef_privée.pem -out signature.sign \ fichier.txt

source: To verify a signature: openssl dgst -sha256 -verify publickey.pem \ -signature signature.sign \ file.txt
fr: Pour vérifier une signature : openssl dgst -sha256 -verify clef_publique.pem \ -signature signature.sign \ fichier.txt

source: The digest of choice for all new applications is SHA1. Other digests are however still widely used.
fr: Le condensé à préférer pour toutes les nouvelles applications est SHA1. D'autres condensés restent cependant largement utilisés.

source: When signing a file, B<dgst> will automatically determine the algorithm (RSA, ECC, etc) to use for signing based on the private key's ASN.1 info. When verifying signatures, it only handles the RSA, DSA, or ECDSA signature itself, not the related data to identify the signer and algorithm used in formats such as x.509, CMS, and S/MIME.
fr: En signant un fichier, B<dgst> déterminera automatiquement l’algorithme (RSA, ECC, etc.) à utiliser pour la signature à partir des informations ASN.1 de la clef privée. Lors de la vérification de signatures, il ne traitera de lui-même que les signatures RSA, DSA ou ECDSA, pas les données associées pour identifier le signataire et l’algorithme utilisé dans des formats comme x.509, CMS et S/MIME.

source: A source of random numbers is required for certain signing algorithms, in particular ECDSA and DSA.
fr: Une source de nombres aléatoires est nécessaire pour certains algorithmes de signature, en particulier ECDSA et DSA.

source: The signing and verify options should only be used if a single file is being signed or verified.
fr: Les options de signature et de vérification ne devraient être utilisées que si un seul fichier est signé ou vérifié.

source: Hex signatures cannot be verified using B<openssl>. Instead, use "xxd -r" or similar program to transform the hex signature into a binary signature prior to verification.
fr: Les signatures hexadécimales ne peuvent pas être vérifiées en utilisant B<openssl>. À la place, utilisez B<xxd -r> ou un programme similaire pour transformer la signature hexadécimale en signature binaire avant la vérification.

source: enc - symmetric cipher routines
fr: enc - Routines de chiffrement symétrique

source: B<openssl enc -ciphername> [B<-in filename>] [B<-out filename>] [B<-pass arg>] [B<-e>] [B<-d>] [B<-a/-base64>] [B<-A>] [B<-k password>] [B<-kfile filename>] [B<-K key>] [B<-iv IV>] [B<-S salt>] [B<-salt>] [B<-nosalt>] [B<-z>] [B<-md>] [B<-p>] [B<-P>] [B<-bufsize number>] [B<-nopad>] [B<-debug>] [B<-none>] [B<-engine id>]
fr: B<openssl enc ->I<nom_algorithme> [B<-in> I<nom_fichier>] [B<-out> I<nom_fichier>] [B<-pass> I<param>] [B<-e>] [B<-d>] [B<-a>|B<-base64>] [B<-A>] [B<-k> I<mot_de_passe>] [B<-kfile> I<nom_fichier>] [B<-K> I<clef>] [B<-iv> I<VI>] [B<-S> I<sel>] [B<-salt>] [B<-nosalt>] [B<-z>] [B<-md>][B<-p>] [B<-P>] [B<-bufsize> I<nombre>] [B<-nopad>] [B<-debug>] [B<-none>] [B<-engine> I<id>]

source: The symmetric cipher commands allow data to be encrypted or decrypted using various block and stream ciphers using keys based on passwords or explicitly provided. Base64 encoding or decoding can also be performed either by itself or in addition to the encryption or decryption.
fr: Les commandes de chiffrement symétrique permettent de chiffrer ou de déchiffrer des données en utilisant divers algorithmes par blocs ou par flux avec des clefs basées sur des mots de passe ou fournies explicitement. L'encodage ou le décodage en base64 peut également être effectué, soit par lui-même, soit en supplément du chiffrement et du déchiffrement.

source: B<-in filename>
fr: B<-in> I<nom_fichier>

source: the input filename, standard input by default.
fr: Le fichier d'entrée. Par défaut c'est l'entrée standard.

source: the output filename, standard output by default.
fr: Le fichier de sortie. Par défaut c'est la sortie standard.

source: B<-pass arg>
fr: B<-pass> I<param>

source: the password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: Le fichier des mots de passe d'entrée. Pour plus de renseignements sur le format de I<param>, consultez la section B<PARAMÈTRES DE PHRASE SECRÈTE> d'L<openssl(1)|openssl(1)>.

source: use a salt in the key derivation routines. This is the default.
fr: Utiliser du sel dans les routines de dérivation de clef. C'est la valeur par défaut.

source: don't use a salt in the key derivation routines. This option B<SHOULD NOT> be used except for test purposes or compatibility with ancient versions of OpenSSL and SSLeay.
fr: Ne pas utiliser de sel dans les routines de dérivation de clef. Cette option ne B<devrait pas> être utilisé à part pour faire des test ou pour assurer la compatibilité avec des versions précédentes d'OpenSSL et SSLeay.

source: encrypt the input data: this is the default.
fr: Chiffrer les données en entrée : c'est effectué par défaut.

source: decrypt the input data.
fr: Déchiffrer les données en entrée.

source: base64 process the data. This means that if encryption is taking place the data is base64 encoded after encryption. If decryption is set then the input data is base64 decoded before being decrypted.
fr: Traitement en base64 des données. Cela signifie que lors d'un chiffrement, les données sont encodées en base64 après le chiffrement et lors d'un déchiffrement, les données sont décodées en base64 avant le déchiffrement.

source: same as B<-a>
fr: Identique à B<-a>.

source: if the B<-a> option is set then base64 process the data on one line.
fr: Avec l'option B<-a>, le traitement en base64 est effectué sur une ligne.

source: B<-k password>
fr: B<-k> I<mot_de_passe>

source: the password to derive the key from. This is for compatibility with previous versions of OpenSSL. Superseded by the B<-pass> argument.
fr: Le mot de passe à partir duquel la clef sera dérivée. C'est pour assurer la compatibilité avec d'anciennes versions d'OpenSSL, mais c'est remplacé par le paramètre B<-pass>.

source: B<-kfile filename>
fr: B<-kfile> I<nom_fichier>

source: read the password to derive the key from the first line of B<filename>. This is for compatibility with previous versions of OpenSSL. Superseded by the B<-pass> argument.
fr: Lire le mot de passe pour la dérivation de la clef à partir de la première ligne de I<nom_fichier>. C'est pour assurer la compatibilité avec d'anciennes versions d'OpenSSL, mais c'est remplacé par le paramètre B<-pass>.

source: do not use a salt
fr: Ne pas utiliser de sel.

source: use salt (randomly generated or provide with B<-S> option) when encrypting (this is the default).
fr: Utiliser du sel (généré aléatoirement ou fourni avec l'option B<-S>) lors du chiffrement (par défaut).

source: B<-S salt>
fr: B<-S> I<sel>

source: the actual salt to use: this must be represented as a string of hex digits.
fr: Le grain de I<sel> à utiliser. Sous forme de chaîne de caractères hexadécimaux.

source: B<-K key>
fr: B<-K> I<clef>

source: the actual key to use: this must be represented as a string comprised only of hex digits. If only the key is specified, the IV must additionally specified using the B<-iv> option. When both a key and a password are specified, the key given with the B<-K> option will be used and the IV generated from the password will be taken. It probably does not make much sense to specify both key and password.
fr: La clef à utiliser : sous forme de chaîne de caractères composée uniquement de caractères hexadécimaux. Si seule la clef est indiquée, le vecteur d'initialisation (« VI ») doit en plus être indiqué avec l'option B<-iv>. Si une clef et un mot de passe sont indiqués, la clef donnée avec l'option B<-K> est prise et le VI est généré à partir du mot de passe. Cela n'a probablement pas de sens d'indiquer à la fois la clef et le mot de passe.

source: B<-iv IV>
fr: B<-iv> I<VI>

source: the actual IV to use: this must be represented as a string comprised only of hex digits. When only the key is specified using the B<-K> option, the IV must explicitly be defined. When a password is being specified using one of the other options, the IV is generated from this password.
fr: Le VI à utiliser : sous forme de chaîne de caractères composée uniquement de caractères hexadécimaux. Si seule la clef est indiquée avec l'option B<-K>, le VI doit être défini explicitement. Si un mot de passe est indiqué, le VI est généré à partir de ce mot de passe.

source: print out the key and IV used.
fr: Afficher la clef et le VI utilisés.

source: print out the key and IV used then immediately exit: don't do any encryption or decryption.
fr: Afficher la clef et le VI utilisés puis sortir immédiatement : aucun chiffrement ou déchiffrement n'est effectué.

source: B<-bufsize number>
fr: B<-bufsize> I<nombre>

source: set the buffer size for I/O
fr: Définir la taille du tampon d'entrée et sortie.

source: disable standard block padding
fr: Désactiver le remplissage (« padding ») de blocs standard.

source: debug the BIOs used for I/O.
fr: Déboguer les BIO utilisés pour l'entrée et la sortie.

source: Compress or decompress clear text using zlib before encryption or after decryption. This option exists only if OpenSSL with compiled with zlib or zlib-dynamic option.
fr: Compresser ou décompresser le texte en clair avec zlib avant le chiffrement ou après le déchiffrement. Cette option n'existe que si OpenSSL a été compilé avec les options zlib ou zlib-dynamic.

source: Use NULL cipher (no encryption or decryption of input).
fr: Utiliser le chiffrement NULL (pas de chiffrement ou de déchiffrement de l'entrée).

source: The program can be called either as B<openssl ciphername> or B<openssl enc -ciphername>. But the first form doesn't work with engine-provided ciphers, because this form is processed before the configuration file is read and any ENGINEs loaded.
fr: Le programme peut être appelé soit comme B<openssl> I<nom_algorithme> soit comme B<openssl enc ->I<nom_algorithme>, mais la première forme ne fonctionne pas avec les chiffrements fournis par un moteur, parce que cette forme est traitée avant de lire le fichier de configuration et de charger les moteurs (« ENGINE »).
