Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: NAME
fr: NOM

source: config - OpenSSL CONF library configuration files
fr: config - Fichiers de configuration de la bibliothèque OpenSSL CONF

source: The OpenSSL CONF library can be used to read configuration files. It is used for the OpenSSL master configuration file B<openssl.cnf> and in a few other places like B<SPKAC> files and certificate extension files for the B<x509> utility. OpenSSL applications can also use the CONF library for their own purposes.
fr: La bibliothèque OpenSSL CONF permet de lire les fichiers de configuration. Elle est utilisée pour le fichier de configuration maître B<openssl.cnf> d’OpenSSL et dans quelques autres endroits comme les fichiers B<SPKAC> et fichiers d'extension de certificat pour l'utilitaire B<x509>. Les applications d’OpenSSL peuvent également utiliser la bibliothèque CONF pour leurs propres fins.

source: A configuration file is divided into a number of sections. Each section starts with a line B<[ section_name ]> and ends when a new section is started or end of file is reached. A section name can consist of alphanumeric characters and underscores.
fr: Un fichier de configuration est divisé en plusieurs sections. Chaque section commence par une ligne B<[ nom_section ]> et se termine quand une autre section commence ou quand la fin de fichier est atteinte. Un nom de section peut contenir des caractères alphanumériques et des caractères de soulignement.

source: The first section of a configuration file is special and is referred to as the B<default> section this is usually unnamed and is from the start of file until the first named section. When a name is being looked up it is first looked up in a named section (if any) and then the default section.
fr: La première section d'un fichier de configuration est spéciale et est appelée la section par défaut (« B<default> »), qui n’est généralement pas nommée et commence au début du fichier jusqu'à la première section nommée. Quand un nom est recherché, il est d'abord recherché dans une section nommée (s’il y en a) puis dans la section par défaut.

source: The environment is mapped onto a section called B<ENV>.
fr: L'environnement est projeté dans une section appelée B<ENV>.

source: Comments can be included by preceding them with the B<#> character
fr: Des commentaires peuvent être inclus, précédés du caractère B<#>.

source: Each section in a configuration file consists of a number of name and value pairs of the form B<name=value>
fr: Chaque section d’un fichier de configuration se compose de plusieurs paires de la forme I<nom>B<=>I<valeur>.

source: The B<name> string can contain any alphanumeric characters as well as a few punctuation symbols such as B<.> B<,> B<;> and B<_>.
fr: La chaîne I<nom> peut contenir des caractères alphanumériques ainsi que quelques symboles de ponctuation comme B<,> B<.> B<;> et B<_>.

source: The B<value> string consists of the string following the B<=> character until end of line with any leading and trailing white space removed.
fr: La chaîne I<valeur> est composée de la chaîne qui suit le caractère B<=> jusqu'à la fin de la ligne avec tous les espaces de début et de fin supprimés.

source: The value string undergoes variable expansion. This can be done by including the form B<$var> or B<${var}>: this will substitute the value of the named variable in the current section. It is also possible to substitute a value from another section using the syntax B<$section::name> or B<${section::name}>. By using the form B<$ENV::name> environment variables can be substituted. It is also possible to assign values to environment variables by using the name B<ENV::name>, this will work if the program looks up environment variables using the B<CONF> library instead of calling B<getenv()> directly.
fr: La chaîne I<valeur> subit un développement de variable. Cela peut être fait en utilisant la forme B<$>I<nom> ou B<${>I<nom>B<}> : cela substituera la valeur de la variable nommée dans la présente section. Une valeur d'une autre section peut aussi être remplacée en utilisant la syntaxe B<$>I<section>B<::>I<nom> ou B<${>I<section>B<::>I<nom>B<}>. Avec la forme B<$ENV::>I<nom>, les variables d'environnement peuvent être substituées. Des valeurs peuvent aussi être attribuées aux variables d'environnement en utilisant le nom B<ENV::>I<nom>, cela fonctionnera si le programme recherche des variables d'environnement en utilisant la bibliothèque B<CONF> au lieu d'appeler B<getenv>() directement.

source: It is possible to escape certain characters by using any kind of quote or the B<\> character. By making the last character of a line a B<\> a B<value> string can be spread across multiple lines. In addition the sequences B<\n>, B<\r>, B<\b> and B<\t> are recognized.
fr: Certains caractères peuvent être protégés à l'aide de n'importe quel type de guillemet ou du caractère B<\> . Si le dernier caractère d'une ligne est B<\>, une chaîne I<valeur> peut être répartie sur plusieurs lignes. De plus, les suites B<\n>, B<\r>, B<\b> et B<\t> sont reconnues.

source: OPENSSL LIBRARY CONFIGURATION
fr: CONFIGURATION DE BIBLIOTHÈQUE OPENSSL

source: In OpenSSL 0.9.7 and later applications can automatically configure certain aspects of OpenSSL using the master OpenSSL configuration file, or optionally an alternative configuration file. The B<openssl> utility includes this functionality: any sub command uses the master OpenSSL configuration file unless an option is used in the sub command to use an alternative configuration file.
fr: Depuis OpenSSL 0.9.7, les applications peuvent configurer automatiquement certains aspects d’OpenSSL en utilisant le fichier de configuration maître d’OpenSSL ou éventuellement un fichier de configuration alternatif. L'utilitaire B<openssl> comprend cette fonctionnalité : une sous-commande utilise le fichier de configuration maître d’OpenSSL sauf si une option est utilisée dans la sous-commande pour utiliser un fichier de configuration alternatif.

source: To enable library configuration the default section needs to contain an appropriate line which points to the main configuration section. The default name is B<openssl_conf> which is used by the B<openssl> utility. Other applications may use an alternative name such as B<myapplicaton_conf>.
fr: Pour activer la configuration de bibliothèque, la section par défaut doit contenir une ligne appropriée qui pointe vers la section de configuration principale. Le nom par défaut est B<openssl_conf>, ce qui est utilisé par l'utilitaire B<openssl>. D'autres applications peuvent utiliser un autre nom comme B<MonApplication_conf>.

source: The configuration section should consist of a set of name value pairs which contain specific module configuration information. The B<name> represents the name of the I<configuration module> the meaning of the B<value> is module specific: it may, for example, represent a further configuration section containing configuration module specific information. E.g.
fr: La section de configuration devrait être composée d'un ensemble de paires nom valeur contenant des informations spécifiques de configuration du module. Le I<nom> représente le nom du I<module de configuration>, la signification de la I<valeur> est spécifique au module : elle peut, par exemple, représenter une autre section de configuration contenant des informations de configuration spécifiques au module. Par exemple :

source: oid_section = new_oids engines = engine_section
fr: oid_section = nouveaux_oid engines = section_moteurs

source: [new_oids]
fr: [nouveaux_oid]

source: ... new oids here ...
fr: ... nouveaux oid ...

source: [engine_section]
fr: [section_moteurs]

source: ... engine stuff here ...
fr: ... ce qui concerne les moteurs ...

source: Currently there are two configuration modules. One for ASN1 objects another for ENGINE configuration.
fr: Actuellement, deux modules de configuration existent, un pour les objets ASN1, un autre pour la configuration du MOTEUR.

source: ASN1 OBJECT CONFIGURATION MODULE
fr: MODULE DE CONFIGURATION D’OBJET ASN1

source: This module has the name B<oid_section>. The value of this variable points to a section containing name value pairs of OIDs: the name is the OID short and long name, the value is the numerical form of the OID. Although some of the B<openssl> utility sub commands already have their own ASN1 OBJECT section functionality not all do. By using the ASN1 OBJECT configuration module B<all> the B<openssl> utility sub commands can see the new objects as well as any compliant applications. For example:
fr: Ce module a le nom de B<oid_section>. La valeur de cette variable pointe vers une section contenant des paires nom valeur d’OID : le nom est le nom court et long d’OID, la valeur est la forme numérique de l'OID. Bien que certaines sous-commandes de l’utilitaire B<openssl> ont déjà leur propre fonctionnalité de section d’OBJET ASN1, ce n’est pas le cas de toutes. En utilisant le module de configuration d’OBJET ASN1 B<all>, les sous-commandes de l’utilitaire B<openssl> peuvent voir les nouveaux objets ainsi que les applications compatibles. Par exemple :

source: [new_oids]
fr: [nouveaux_oid]

source: some_new_oid = 1.2.3.4 some_other_oid = 1.2.3.5
fr: un_nouvel_oid = 1.2.3.4 un_autre_oid = 1.2.3.5

source: In OpenSSL 0.9.8 it is also possible to set the value to the long name followed by a comma and the numerical OID form. For example:
fr: Avec OpenSSL 0.9.8, la valeur peut aussi être définie au nom long suivi d'une virgule et de la forme numérique de l'OID. Par exemple :

source: shortName = some object long name, 1.2.3.4
fr: nomCourt = nom long d'un objet, 1.2.3.4

source: ENGINE CONFIGURATION MODULE
fr: MODULE DE CONFIGURATION DU MOTEUR

source: This ENGINE configuration module has the name B<engines>. The value of this variable points to a section containing further ENGINE configuration information.
fr: Ce module de configuration du MOTEUR a le nom B<engines>. La valeur de cette variable pointe vers une section contenant des informations de configuration du moteur.

source: The section pointed to by B<engines> is a table of engine names (though see B<engine_id> below) and further sections containing configuration information specific to each ENGINE.
fr: La section pointée par B<engines> est un tableau de noms de moteur (consultez B<engine_id> ci-dessous) et d'autres sections contenant les informations de configuration spécifiques à chaque MOTEUR.

source: Each ENGINE specific section is used to set default algorithms, load dynamic, perform initialization and send ctrls. The actual operation performed depends on the I<command> name which is the name of the name value pair. The currently supported commands are listed below.
fr: Chaque section spécifique au MOTEUR est utilisée pour définir des algorithmes par défaut, charger dynamiquement, effectuer l'initialisation et envoyer des contrôles. Le fonctionnement réel effectué dépend du nom de la I<commande> qui est le nom de la paire nom valeur. Les commandes actuellement prises en charge sont répertoriées ci-dessous.

source: For example:
fr: Par exemple :

source: # Configure ENGINE named "foo" foo = foo_section # Configure ENGINE named "bar" bar = bar_section
fr: # Configurer le MOTEUR nommé « truc » truc = section_truc # Configurer le MOTEUR nommé « bidule » bidule = section_bidule

source: [foo_section] ... foo ENGINE specific commands ...
fr: [section_truc] ... commandes spécifiques au MOTEUR truc ...

source: [bar_section] ... "bar" ENGINE specific commands ...
fr: [section_bidule] ... commandes spécifiques au MOTEUR bidule ...

source: The command B<engine_id> is used to give the ENGINE name. If used this command must be first. For example:
fr: La commande B<engine_id> est utilisée pour donner le nom du MOTEUR. Si utilisée, cette commande doit être la première. Par exemple :

source: [engine_section] # This would normally handle an ENGINE named "foo" foo = foo_section
fr: [section_moteurs] # Cela devrait normalement gérer un MOTEUR nommé « truc » truc = section_truc

source: [foo_section] # Override default name and use "myfoo" instead. engine_id = myfoo
fr: [section_truc] # Remplacer le nom par défaut et utiliser « montruc » à la place. engine_id = montruc

source: The command B<dynamic_path> loads and adds an ENGINE from the given path. It is equivalent to sending the ctrls B<SO_PATH> with the path argument followed by B<LIST_ADD> with value 2 and B<LOAD> to the dynamic ENGINE. If this is not the required behaviour then alternative ctrls can be sent directly to the dynamic ENGINE using ctrl commands.
fr: La commande B<dynamic_path> charge et ajoute un MOTEUR à partir du chemin donné. Elle est équivalente à l'envoi des contrôles B<SO_PATH> avec l'argument de chemin suivi par B<LIST_ADD> avec la valeur 2 et B<LOAD> au MOTEUR dynamique. Si ce n'est pas le comportement voulu, des contrôles alternatifs peuvent être envoyés directement au MOTEUR dynamique en utilisant les commandes de contrôle.

source: The command B<init> determines whether to initialize the ENGINE. If the value is B<0> the ENGINE will not be initialized, if B<1> and attempt it made to initialized the ENGINE immediately. If the B<init> command is not present then an attempt will be made to initialize the ENGINE after all commands in its section have been processed.
fr: La commande B<init> détermine s'il faut initialiser le moteur. Si la valeur est B<0>, le moteur ne sera pas initialisé ; si B<1>, une tentative immédiate d’initialiser le moteur est réalisée. Si la commande B<init> n'est pas présente, alors une tentative d’initialiser le moteur sera effectuée après le traitement de toutes les commandes de la section.

source: The command B<default_algorithms> sets the default algorithms an ENGINE will supply using the functions B<ENGINE_set_default_string()>
fr: La commande B<default_algorithms> définit les algorithmes par défaut qu’un MOTEUR fournira en utilisant les fonctions B<ENGINE_set_default_string>()

source: If the name matches none of the above command names it is assumed to be a ctrl command which is sent to the ENGINE. The value of the command is the argument to the ctrl command. If the value is the string B<EMPTY> then no value is sent to the command.
fr: Si le nom ne correspond à aucun des noms de commande ci-dessus, il est supposé être une commande de contrôle envoyée au moteur. La valeur de la commande est l'argument de la commande de contrôle. Si la valeur est la chaîne B<EMPTY>, alors aucune valeur n'est envoyée à la commande.

source: # Configure ENGINE named "foo" foo = foo_section
fr: # Configurer le MOTEUR nommé « truc » truc = section_truc

source: [foo_section] # Load engine from DSO dynamic_path = /some/path/fooengine.so # A foo specific ctrl. some_ctrl = some_value # Another ctrl that doesn't take a value. other_ctrl = EMPTY # Supply all default algorithms default_algorithms = ALL
fr: [section_truc] # Charger le moteur à partir du DSO dynamic_path = /chemin/vers/moteur_truc.so # Un contrôle spécifique à truc un_ctrl = une_valeur # Un autre contrôle qui ne prend pas de valeur autre_ctrl = EMPTY # Fournir tous les algorithmes par défaut default_algorithms = ALL

source: If a configuration file attempts to expand a variable that doesn't exist then an error is flagged and the file will not load. This can happen if an attempt is made to expand an environment variable that doesn't exist. For example in a previous version of OpenSSL the default OpenSSL master configuration file used the value of B<HOME> which may not be defined on non Unix systems and would cause an error.
fr: Si un fichier de configuration tente de développer une variable qui n'existe pas, une erreur est signalée et le fichier ne sera pas chargé. Cela peut se produire si une tentative de développement de variable d’environnement inexistante est réalisée. Par exemple, dans une version précédente d’OpenSSL, le fichier de configuration maître par défaut utilisait la valeur de B<HOME> qui peut ne pas être définie sur les systèmes non UNIX et ainsi provoquer une erreur.

source: This can be worked around by including a B<default> section to provide a default value: then if the environment lookup fails the default value will be used instead. For this to work properly the default value must be defined earlier in the configuration file than the expansion. See the B<EXAMPLES> section for an example of how to do this.
fr: Cela peut être contourné en incluant une section B<default> pour fournir une valeur par défaut : alors, si la recherche d’environnement échoue, la valeur par défaut sera utilisée à la place. Pour que cela fonctionne correctement la valeur par défaut doit être définie avant le développement dans le fichier de configuration. Consultez la section B<EXEMPLES> pour un exemple sur la façon de procéder.

source: If the same variable exists in the same section then all but the last value will be silently ignored. In certain circumstances such as with DNs the same field may occur multiple times. This is usually worked around by ignoring any characters before an initial B<.> e.g.
fr: Si une même variable est présente plusieurs fois dans la même section, alors elles seront toutes ignorées silencieusement sauf la dernière valeur. Dans certains cas, par exemple avec DN, le même champ peut se présenter plusieurs fois. Cela est habituellement contourné en ignorant tous les caractères précédant le premier B<.>, par exemple

source: 1.OU="My first OU" 2.OU="My Second OU"
fr: 1.OU="Premier OU" 2.OU="Second OU"

source: EXAMPLES
fr: EXEMPLES

source: Here is a sample configuration file using some of the features mentioned above.
fr: Voici un exemple de fichier de configuration utilisant certaines caractéristiques mentionnées précédemment.

source: # This is the default section.
fr: # Section par défaut

source: [ section_one ]
fr: [ première_section ]

source: # We are now in section one.
fr: # Contenu de la première section

source: # Quotes permit leading and trailing whitespace any = " any variable name "
fr: # Les guillemets permettent des espaces au début et à la fin truc = " n’importe quel nom de variable "

source: other = A string that can \ cover several lines \ by including \\ characters
fr: bidule = Une chaîne qui peut \ s’étendre sur plusieurs lignes \ en incluant des caractères \\.

source: message = Hello World\n
fr: message = Bonjour tout le monde\n

source: [ section_two ]
fr: [ deuxième_section ]

source: greeting = $section_one::message
fr: salutation = $première_section::message

source: This next example shows how to expand environment variables safely.
fr: L'exemple suivant montre comment développer les variables d'environnement en toute sécurité.

source: Suppose you want a variable called B<tmpfile> to refer to a temporary filename. The directory it is placed in can determined by the the B<TEMP> or B<TMP> environment variables but they may not be set to any value at all. If you just include the environment variable names and the variable doesn't exist then this will cause an error when an attempt is made to load the configuration file. By making use of the default section both values can be looked up with B<TEMP> taking priority and B</tmp> used if neither is defined:
fr: Soit une variable appelée B<tmpfile> référant un nom de fichier temporaire. Le répertoire dans lequel il est placé peut être déterminé par les variables d'environnement B<TEMP> ou B<TMP>, mais aucune valeur ne peut leur être attribuée. Si vous incluez seulement les noms de variables d'environnement et que la variable n'existe pas, cela provoquerait une erreur lorsqu'une tentative de chargement du fichier de configuration est effectuée. En utilisant la section par défaut, les deux valeurs peuvent être recherchées avec B<TEMP>, en priorité, et B</tmp> utilisé si aucune n'est définie :

source: TMP=/tmp # The above value is used if TMP isn't in the environment TEMP=$ENV::TMP # The above value is used if TEMP isn't in the environment tmpfile=${ENV::TEMP}/tmp.filename
fr: TMP=/tmp # Valeur ci-dessus utilisée si TMP n'est pas dans l'environnement TEMP=$ENV::TMP # Valeur ci-dessus utilisée si TEMP n'est pas dans l'environnement tmpfile=${ENV::TEMP}/tmp.nom_fichier

source: BUGS
fr: BOGUES

source: Currently there is no way to include characters using the octal B<\nnn> form. Strings are all null terminated so nulls cannot form part of the value.
fr: Actuellement, aucun moyen ne permet d'inclure des caractères à l'aide de la forme octale B<\nnn>. Les chaînes sont toutes terminées par NULL donc NULL ne peut pas faire partie de la valeur.

source: The escaping isn't quite right: if you want to use sequences like B<\n> you can't use any quote escaping on the same line.
fr: La protection n'est pas tout à fait correcte : si vous voulez utiliser des suites comme B<\n>, vous ne pouvez pas utiliser de guillemets de protection sur la même ligne.

source: Files are loaded in a single pass. This means that an variable expansion will only work if the variables referenced are defined earlier in the file.
fr: Les fichiers sont chargés en une seule passe. Cela signifie qu’un développement de variable ne fonctionnera que si les variables référencées sont définies précédemment dans le fichier.

source: SEE ALSO
fr: VOIR AUSSI

source: L<x509(1)|x509(1)>, L<req(1)|req(1)>, L<ca(1)|ca(1)>
fr: L<B<ca>(1)|ca(1)>, L<B<req>(1)|req(1)>, L<B<x509>(1)|x509(1)>

source: c_rehash - Create symbolic links to files named by the hash values
fr: c_rehash - Créer des liens symboliques vers des fichiers en utilisant une valeur de hachage

source: B<c_rehash> [ I<directory>...]
fr: B<c_rehash> [I<répertoire> ...]

source: B<c_rehash> scans directories and calculates a hash value of each C<.pem> file in the specified directory list and creates symbolic links for each file, where the name of the link is the hash value. This utility is useful as many programs that use OpenSSL require directories to be set up like this in order to find certificates.
fr: B<c_rehash> parcourt les répertoires et calcule une valeur de hachage de chaque fichier I<.pem> dans la liste de répertoires indiqués puis crée des liens symboliques pour chacun de ces fichiers, où le nom du lien est la valeur du hachage. Cet utilitaire permet à beaucoup de programmes qui utilisent OpenSSL de trouver les certificats avec des répertoires configurés de la sorte.

source: If any directories are named on the command line, then those are processed in turn. If not, then the B<SSL_CERT_DIR> environment variable is consulted; this shold be a colon-separated list of directories, like the Unix B<PATH> variable. If that is not set then the default directory (installation-specific but often B</usr/local/ssl/certs>) is processed.
fr: Si des répertoires sont indiqués sur la ligne de commande, alors ils sont traités chacun à leur tour. Sinon, la variable d'environnement B<SSL_CERT_DIR> est consultée ; ce devrait être une liste de répertoires séparés par des deux-points (« : »), comme la variable B<PATH> d’UNIX. Si elle n’est pas définie, alors le répertoire par défaut (spécifique à l’installation, mais probablement I</usr/lib/ssl/certs>) est traité.
