Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: The output is a time stamp token (ContentInfo) instead of time stamp response (TimeStampResp). (Optional)
fr: La sortie est un jeton d'horodatage (ContentInfo) au lieu d’une réponse d’horodatage (TimeStampResp). (Facultatif)

source: B<-engine> id
fr: B<-engine> I<id>

source: Specifying an engine (by its unique B<id> string) will cause B<ts> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms. Default is builtin. (Optional)
fr: Indiquer un moteur (en utilisant son identifiant unique I<id>) forcera B<ts> à essayer d'obtenir une référence fonctionnelle pour le moteur indiqué et l'initialiser si nécessaire. Le moteur sera ensuite utilisé par défaut pour tous les algorithmes disponibles. La valeur par défaut est « builtin ». (Faclutatif)

source: Time Stamp Response verification
fr: Vérification de réponse d’horodatage

source: The B<-verify> command is for verifying if a time stamp response or time stamp token is valid and matches a particular time stamp request or data file. The B<-verify> command does not use the configuration file.
fr: La commande B<-verify> sert à vérifier si une réponse d'horodatage ou un jeton d'horodatage est valable et correspond à une demande d'horodatage ou un fichier de données particuliers. La commande B<-verify> n'utilise pas le fichier de configuration.

source: The response or token must be verified against file_to_hash. The file is hashed with the message digest algorithm specified in the token. The B<-digest> and B<-queryfile> options must not be specified with this one. (Optional)
fr: La réponse ou le jeton doivent être vérifiés par rapport à I<fichier_à_hacher>. Le fichier est haché avec l’algorithme de signature de message indiqué dans le jeton. Les options B<-digest> et B<-queryfile> ne doivent pas être indiquées avec cette option. (Facultatif)

source: The response or token must be verified against the message digest specified with this option. The number of bytes must match the message digest algorithm specified in the token. The B<-data> and B<-queryfile> options must not be specified with this one. (Optional)
fr: La réponse ou le jeton doivent être vérifiés par rapport à la signature de message indiquée par cette option. Le nombre d'octets doit correspondre à l’algorithme de signature de message indiqué dans le jeton. Les options B<-data> et B<-queryfile> ne doivent pas être indiquées avec cette option. (Facultatif)

source: The original time stamp request in DER format. The B<-data> and B<-digest> options must not be specified with this one. (Optional)
fr: La demande originale d’horodatage au format DER. Les options B<-data> et B<-queryfile> ne doivent pas être indiquées avec cette option. (Facultatif)

source: The time stamp response that needs to be verified in DER format. (Mandatory)
fr: La réponse d'horodatage à vérifier au format DER. (Obligatoire)

source: B<-CApath> trusted_cert_path
fr: B<-CApath> I<chemin_cert_confiance>

source: The name of the directory containing the trused CA certificates of the client. See the similar option of L<verify(1)|verify(1)> for additional details. Either this option or B<-CAfile> must be specified. (Optional)
fr: Le nom du répertoire contenant les certificats de l’autorité de confiance du client. Consultez l'option similaire de L<B<verify>(1)|verify(1)> pour plus de précisions. Soit cette option, soit B<-CAfile> doit être indiquée. (Facultatif)

source: B<-CAfile> trusted_certs.pem
fr: B<-CAfile> I<certs_confiance.pem>

source: The name of the file containing a set of trusted self-signed CA certificates in PEM format. See the similar option of L<verify(1)|verify(1)> for additional details. Either this option or B<-CApath> must be specified. (Optional)
fr: Le nom du fichier contenant un ensemble de certificats autosignés de l’autorité de confiance au format PEM. Consultez l'option similaire de L<B<verify>(1)|verify(1)> pour plus de précisions. Soit cette option, soit B<-CApath> doit être indiquée. (Facultatif)

source: B<-untrusted> cert_file.pem
fr: B<-untrusted> I<fichier_cert.pem>

source: Set of additional untrusted certificates in PEM format which may be needed when building the certificate chain for the TSA's signing certificate. This file must contain the TSA signing certificate and all intermediate CA certificates unless the response includes them. (Optional)
fr: Ensemble de certificats supplémentaires qui ne sont pas de confiance au format PEM pouvant être nécessaires lors de la construction de la chaîne de certificats d'un certificat de signature de la TSA. Ce fichier doit contenir le certificat de signature TSA et tous les certificats d’autorité intermédiaires sauf si la réponse les inclut. (Facultatif)

source: CONFIGURATION FILE OPTIONS
fr: OPTIONS DU FICHIER DE CONFIGURATION

source: The B<-query> and B<-reply> commands make use of a configuration file defined by the B<OPENSSL_CONF> environment variable. See L<config(5)|config(5)> for a general description of the syntax of the config file. The B<-query> command uses only the symbolic OID names section and it can work without it. However, the B<-reply> command needs the config file for its operation.
fr: Les commandes B<-query> et B<-reply> utilisent un fichier de configuration défini par la variable d'environnement B<OPENSSL_CONF>. Consultez L<B<config>(5)|config(5)> pour une description générale de la syntaxe du fichier de configuration. La commande B<-query> n’utilise que la section des noms symboliques d’OID et peut fonctionner sans elle. Cependant, la commande B<-reply> a besoin du fichier de configuration pour fonctionner.

source: When there is a command line switch equivalent of a variable the switch always overrides the settings in the config file.
fr: Quand une option de ligne de commande est équivalente à une variable, l'option est toujours prioritaire sur les paramètres du fichier de configuration.

source: B<tsa> section, B<default_tsa>
fr: Section B<tsa>, B<default_tsa>

source: This is the main section and it specifies the name of another section that contains all the options for the B<-reply> command. This default section can be overridden with the B<-section> command line switch. (Optional)
fr: C’est la section principale, qui indique le nom d’une autre section contenant toutes les options pour la commande B<-reply>. Cette section par défaut peut être remplacée par l’option B<-section> en ligne de commande. (Facultatif)

source: See L<ca(1)|ca(1)> for description. (Optional)
fr: Consultez L<B<ca>(1)|ca(1)> pour la description. (Facultatif)

source: The name of the file containing the hexadecimal serial number of the last time stamp response created. This number is incremented by 1 for each response. If the file does not exist at the time of response generation a new file is created with serial number 1. (Mandatory)
fr: Le nom du fichier contenant le numéro de série hexadécimal de la dernière réponse d’horodatage créée. Ce nombre est incrémenté de 1 pour chaque réponse. Si le fichier n'existe pas au moment de la création de réponse d'un nouveau fichier, un nouveau est créé avec le numéro de série 1. (Obligatoire)

source: Specifies the OpenSSL engine that will be set as the default for all available algorithms. The default value is builtin, you can specify any other engines supported by OpenSSL (e.g. use chil for the NCipher HSM). (Optional)
fr: Indiquer le moteur OpenSSL qui sera défini par défaut pour tous les algorithmes disponibles. La valeur par défaut est « builtin », vous pouvez indiquer d'autres moteurs pris en charge par OpenSSL (par exemple, utiliser chil pour le HSM nCipher). (Facultatif)

source: TSA signing certificate in PEM format. The same as the B<-signer> command line option. (Optional)
fr: Certificat de signature TSA au format PEM. Identique à l'option B<-signer> en ligne de commande. (Facultatif)

source: A file containing a set of PEM encoded certificates that need to be included in the response. The same as the B<-chain> command line option. (Optional)
fr: Un fichier contenant un ensemble de certificats encodés PEM qui doivent être inclus dans la réponse. Identique à l'option B<-chain> en ligne de commande. (Facultatif)

source: The private key of the TSA in PEM format. The same as the B<-inkey> command line option. (Optional)
fr: La clef privée de la TSA au format PEM. Identique à l'option B<-inkey> en ligne de commande. (Facultatif)

source: The default policy to use when the request does not mandate any policy. The same as the B<-policy> command line option. (Optional)
fr: La politique par défaut à utiliser quand la demande n'exige pas de politique. Identique à B<-policy> en ligne de commande. (Facultatif)

source: Comma separated list of policies that are also acceptable by the TSA and used only if the request explicitly specifies one of them. (Optional)
fr: Liste des politiques, séparées par des virgules, qui sont aussi acceptables par la TSA et utilisées seulement si la demande indique explicitement l'une d’entre elles. (Facultatif)

source: The list of message digest algorithms that the TSA accepts. At least one algorithm must be specified. (Mandatory)
fr: La liste des algorithmes de signature de message que la TSA accepte. Au moins un algorithme doit être indiqué. (Obligatoire)

source: The accuracy of the time source of the TSA in seconds, milliseconds and microseconds. E.g. secs:1, millisecs:500, microsecs:100. If any of the components is missing zero is assumed for that field. (Optional)
fr: La précision de la source de temps de la TSA en seconde, milliseconde et microseconde. Par exemple secs:1, millisecs:500, microsecs:100. Si l'un des composants est manquant, ce champ est supposé nul. (Facultatif)

source: Specifies the maximum number of digits, which represent the fraction of seconds, that need to be included in the time field. The trailing zeroes must be removed from the time, so there might actually be fewer digits, or no fraction of seconds at all. Supported only on UNIX platforms. The maximum value is 6, default is 0. (Optional)
fr: Indiquer le nombre maximal de chiffres pour représenter la fraction de seconde qui doit être incluse dans champ temporel. Les zéros finaux doivent être supprimés, donc moins de chiffres pourraient être présents ou aucune fraction de seconde du tout. Pris en charge uniquement sur les plateformes UNIX. La valeur maximale est 6, la valeur par défaut est 0. (Facultatif)

source: If this option is yes the responses generated by this TSA can always be ordered, even if the time difference between two responses is less than the sum of their accuracies. Default is no. (Optional)
fr: Si cette option est « yes », les réponses créées par cette TSA peuvent toujours être ordonnées, même si la différence de temps entre deux réponses est inférieure à la somme de leurs précisions. « no » par défaut. (Facultatif)

source: Set this option to yes if the subject name of the TSA must be included in the TSA name field of the response. Default is no. (Optional)
fr: Si cette option est « yes », le nom d'objet de la TSA doit être inclus dans le champ de noms TSA de la réponse. « no » par défaut. (Facultatif)

source: The SignedData objects created by the TSA always contain the certificate identifier of the signing certificate in a signed attribute (see RFC 2634, Enhanced Security Services). If this option is set to yes and either the B<certs> variable or the B<-chain> option is specified then the certificate identifiers of the chain will also be included in the SigningCertificate signed attribute. If this variable is set to no, only the signing certificate identifier is included. Default is no. (Optional)
fr: Les objets SignedData créés par la TSA contiennent toujours l'identifiant de certificat du certificat de signature dans un attribut signé (consultez la RFC 2634, « Enhanced Security Services »). Si cette option est « yes » et que soit la variable B<certs>, soit l'option B<-chain> est indiquée, les identifiants de certificat de la chaîne seront également inclus dans l’attribut SigningCertificate signé. Si cette variable est « no », seul l'identifiant de certificat de signature est inclus. « no » par défaut. (Facultatif)

source: B<OPENSSL_CONF> contains the path of the configuration file and can be overridden by the B<-config> command line option.
fr: B<OPENSSL_CONF> contient l'emplacement du fichier de configuration et peut être modifiée par l'option B<-config> en ligne de commande.

source: All the examples below presume that B<OPENSSL_CONF> is set to a proper configuration file, e.g. the example configuration file openssl/apps/openssl.cnf will do.
fr: Tous les exemples ci-dessous supposent que B<OPENSSL_CONF> est défini vers un fichier de configuration approprié, comme dans le fichier d'exemple de configuration openssl/apps/openssl.cnf.

source: Time Stamp Request
fr: Demande d’horodatage

source: To create a time stamp request for design1.txt with SHA-1 without nonce and policy and no certificate is required in the response:
fr: Pour créer une demande d'horodatage pour design1.txt avec SHA-1 sans nonce, avec la politique et sans certificat nécessaire dans la réponse :

source: To create a similar time stamp request with specifying the message imprint explicitly:
fr: Pour créer une demande d'horodatage similaire en indiquant explicitement l’empreinte du message :

source: To print the content of the previous request in human readable format:
fr: Pour afficher le contenu de la requête précédente en format lisible :

source: To create a time stamp request which includes the MD-5 digest of design2.txt, requests the signer certificate and nonce, specifies a policy id (assuming the tsa_policy1 name is defined in the OID section of the config file):
fr: Pour créer une demande d'horodatage qui comprend la signature MD-5 de design2.txt, demande le certificat du signataire et nonce, indique un identifiant de politique (en supposant que le nom tsa_policy1 est défini dans la section OID du fichier de configuration) :

source: Time Stamp Response
fr: Réponse d’horodatage

source: Before generating a response a signing certificate must be created for the TSA that contains the B<timeStamping> critical extended key usage extension without any other key usage extensions. You can add the 'extendedKeyUsage = critical,timeStamping' line to the user certificate section of the config file to generate a proper certificate. See L<req(1)|req(1)>, L<ca(1)|ca(1)>, L<x509(1)|x509(1)> for instructions. The examples below assume that cacert.pem contains the certificate of the CA, tsacert.pem is the signing certificate issued by cacert.pem and tsakey.pem is the private key of the TSA.
fr: Avant de créer une réponse, un certificat de signature doit être créé pour la TSA qui contient l'extension d’utilisation de clef étendue critique B<timeStamping> sans aucune autre extension d'utilisation de clef. Vous pouvez ajouter la ligne « extendedKeyUsage = critical,timeStamping » à la section de certificat utilisateur du fichier de configuration pour créer un certificat approprié. Consultez L<B<req>(1)|req(1)>, L<B<ca>(1)|ca(1)> et L<B<x509>(1)|x509(1)> pour les instructions. Les exemples ci-dessous supposent que cacert.pem contient le certificat de l’autorité de certification, tsacert.pem est le certificat de signature émis par cacert.pem et tsakey.pem est la clef privée de la TSA.

source: To create a time stamp response for a request:
fr: Pour créer une réponse d'horodatage pour une requête :

source: If you want to use the settings in the config file you could just write:
fr: Pour utiliser les paramètres du fichier de configuration :

source: To print a time stamp reply to stdout in human readable format:
fr: Pour afficher une réponse d’horodatage sur la sortie standard sous forme lisible :

source: To create a time stamp token instead of time stamp response:
fr: Pour créer un jeton d'horodatage au lieu d’une réponse d'horodatage :

source: To print a time stamp token to stdout in human readable format:
fr: Pour afficher un jeton d’horodatage sur la sortie standard sous forme lisible :

source: To extract the time stamp token from a response:
fr: Pour extraire le jeton d'horodatage d'une réponse :

source: To add 'granted' status info to a time stamp token thereby creating a valid response:
fr: Pour ajouter l’information d’état « granted » (accordé) à un jeton d'horodatage créant ainsi une réponse valable :

source: Time Stamp Verification
fr: Vérification d’horodatage

source: To verify a time stamp reply against a request:
fr: Pour vérifier une réponse d’horodatage par rapport à une demande :

source: To verify a time stamp reply that includes the certificate chain:
fr: Pour vérifier une réponse d’horodatage qui comprend la chaîne de certificats :

source: To verify a time stamp token against the original data file: openssl ts -verify -data design2.txt -in design2.tsr \ -CAfile cacert.pem
fr: Pour vérifier un jeton d'horodatage par rapport au fichier de données d'origine : openssl ts -verify -data design2.txt -in design2.tsr \ -CAfile cacert.pem

source: To verify a time stamp token against a message imprint: openssl ts -verify -digest b7e5d3f93198b38379852f2c04e78d73abdd0f4b \ -in design2.tsr -CAfile cacert.pem
fr: Pour vérifier un jeton d'horodatage par rapport à une empreinte de message : openssl ts -verify -digest b7e5d3f93198b38379852f2c04e78d73abdd0f4b \ -in design2.tsr -CAfile cacert.pem

source: You could also look at the 'test' directory for more examples.
fr: D’autres exemples sont aussi disponibles dans le répertoire I<test>.

source: If you find any bugs or you have suggestions please write to Zoltan Glozik <zglozik@opentsa.org>. Known issues:
fr: Les bogues et suggestions peuvent être envoyés à Zoltan Glozik I<E<lt>zglozik@opentsa.orgE<gt>>. Une liste des problèmes connus suit.

source: * No support for time stamps over SMTP, though it is quite easy to implement an automatic e-mail based TSA with L<procmail(1)|procmail(1)> and L<perl(1)|perl(1)>. HTTP server support is provided in the form of a separate apache module. HTTP client support is provided by L<tsget(1)|tsget(1)>. Pure TCP/IP protocol is not supported.
fr: — Pas de prise en charge d’horodatages par SMTP, mais c’est assez facile de mettre en œuvre une TSA automatique à base de courriers électroniques avec L<B<procmail>(1)|procmail(1)> et L<B<perl>(1)|perl(1)>. La prise en charge du serveur HTTP est fournie sous forme d'un module Apache séparé. La prise en charge de client HTTP est assurée par L<B<tsget>(1)|tsget(1)>. Le protocole TCP/IP pur n'est pas pris en charge.

source: * The file containing the last serial number of the TSA is not locked when being read or written. This is a problem if more than one instance of L<openssl(1)|openssl(1)> is trying to create a time stamp response at the same time. This is not an issue when using the apache server module, it does proper locking.
fr: — Le fichier contenant le dernier numéro de série de la TSA n'est pas verrouillé lorsqu'il est lu ou écrit. C’est un problème si plusieurs instances d’L<B<openssl>(1)|openssl(1)> tentent de créer une réponse d'horodatage en même temps. Ce n'est pas un problème si le module de serveur Apache est utilisé : il fait un verrouillage correct.

source: * Look for the FIXME word in the source files.
fr: — Recherchez le mot « FIXME » dans les fichiers source.

source: * The source code should really be reviewed by somebody else, too.
fr: — Le code source devrait vraiment être examiné par quelqu'un d'autre.

source: * More testing is needed, I have done only some basic tests (see test/testtsa).
fr: — Plus de tests sont nécessaires, seuls quelques tests de base ont été effectués (consultez test/testtsa).

source: AUTHOR
fr: AUTEUR

source: Zoltan Glozik <zglozik@opentsa.org>, OpenTSA project (http://www.opentsa.org)
fr: Zoltan Glozik I<E<lt>zglozik@opentsa.orgE<gt>>, projet OpenTSA (I<E<lt>http://www.opentsa.orgE<gt>>)

source: L<tsget(1)|tsget(1)>, L<openssl(1)|openssl(1)>, L<req(1)|req(1)>, L<x509(1)|x509(1)>, L<ca(1)|ca(1)>, L<genrsa(1)|genrsa(1)>, L<config(5)|config(5)>
fr: L<B<tsget>(1)|tsget(1)>, L<B<openssl>(1)|openssl(1)>, L<B<req>(1)|req(1)>, L<B<x509>(1)|x509(1)>, L<B<ca>(1)|ca(1)>, L<B<genrsa>(1)|genrsa(1)>, L<B<config>(5)|config(5)>

source: tsget - Time Stamping HTTP/HTTPS client
fr: tsget - Client d’horodatage HTTP et HTTPS

source: B<tsget> B<-h> server_url [B<-e> extension] [B<-o> output] [B<-v>] [B<-d>] [B<-k> private_key.pem] [B<-p> key_password] [B<-c> client_cert.pem] [B<-C> CA_certs.pem] [B<-P> CA_path] [B<-r> file:file...] [B<-g> EGD_socket] [request]...
fr: B<tsget -h> I<URL_serveur> [B<-e> I<extension>] [B<-o> I<sortie>] [B<-v>] [B<-d>] [B<-k> I<clef_privée.pem>] [B<-p> I<mot_de_passe_clef>] [B<-c> I<cert_client.pem>] [B<-C> I<certs_CA.pem>] [B<-P> I<chemin_CA>] [B<-r> I<fichier>B<:>I<fichier>...] [B<-g> I<socket_EGD>] [I<demande>] ...

source: The B<tsget> command can be used for sending a time stamp request, as specified in B<RFC 3161>, to a time stamp server over HTTP or HTTPS and storing the time stamp response in a file. This tool cannot be used for creating the requests and verifying responses, you can use the OpenSSL B<ts(1)> command to do that. B<tsget> can send several requests to the server without closing the TCP connection if more than one requests are specified on the command line.
fr: La commande B<tsget> permet d’envoyer une demande d'horodatage, comme spécifiée dans la B<RFC 3161>, à un serveur d'horodatage HTTP ou HTTPS et de stocker la réponse d'horodatage dans un fichier. Cet outil ne peut pas être utilisé pour créer les demandes et vérifier les réponses, la commande B<ts>(1) d’OpenSSL permet de le faire. B<tsget> peut envoyer plusieurs requêtes au serveur sans fermer la connexion TCP si plus d'une demande est indiquée sur la ligne de commande.

source: The tool sends the following HTTP request for each time stamp request:
fr: L'outil envoie la requête HTTP suivante pour chaque demande d'horodatage :

source: POST url HTTP/1.1 User-Agent: OpenTSA tsget.pl/<version> Host: <host>:<port> Pragma: no-cache Content-Type: application/timestamp-query Accept: application/timestamp-reply Content-Length: length of body
fr: POST url HTTP/1.1 User-Agent: OpenTSA tsget.pl/<version> Host: <hôte>:<port> Pragma: no-cache Content-Type: application/timestamp-query Accept: application/timestamp-reply Content-Length: taille du corps

source: ...binary request specified by the user...
fr: ... demande binaire indiquée par l'utilisateur ...

source: B<tsget> expects a response of type application/timestamp-reply, which is written to a file without any interpretation.
fr: B<tsget> attend une réponse de type application/timestamp-reply, qui est écrite dans un fichier sans aucune interprétation.

source: B<-h> server_url
fr: B<-h> I<URL_serveur>

source: The URL of the HTTP/HTTPS server listening for time stamp requests.
fr: L'URL du serveur HTTP ou HTTPS qui écoute les demandes d'horodatage.

source: B<-e> extension
fr: B<-e> I<extension>

source: If the B<-o> option is not given this argument specifies the extension of the output files. The base name of the output file will be the same as those of the input files. Default extension is '.tsr'. (Optional)
fr: Si l'option B<-o> n'est pas donnée, cet argument indique l'extension des fichiers de sortie. Le nom de base du fichier de sortie est le même que celui des fichiers d'entrée. L'extension par défaut est « .tsr ». (Facultatif)

source: B<-o> output
fr: B<-o> I<sortie>
