Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: Engines which provide entirely new encryption algorithms (such as ccgost engine which provides gost89 algorithm) should be configured in the configuration file. Engines, specified in the command line using -engine options can only be used for hadrware-assisted implementations of ciphers, which are supported by OpenSSL core or other engine, specified in the configuration file.
fr: Les moteurs qui fournissent de nouveaux algorithmes de chiffrement complets (comme le moteur ccgost qui fournit l'algorithme gost89) devraient être configurés dans le fichier de configuration. Les moteurs indiqués en ligne de commande avec les options B<-engine> ne peuvent être utilisés que pour des implémentations d'algorithmes assistées par le matériel, pris en charge par le noyau d'OpenSSL ou un autre moteur, indiqués dans le fichier de configuration.

source: When enc command lists supported ciphers, ciphers provided by engines, specified in the configuration files are listed too.
fr: Quand la commande B<enc> affiche les algorithmes disponibles, les algorithmes fournis par les moteurs indiqués dans le fichier de configuration sont aussi affichés.

source: A password will be prompted for to derive the key and IV if necessary.
fr: Un mot de passe sera demandé, si besoin est, pour obtenir la clef et le VI.

source: The B<-salt> option should B<ALWAYS> be used if the key is being derived from a password unless you want compatibility with previous versions of OpenSSL and SSLeay.
fr: L'option B<-salt> devrait B<toujours> être utilisée si la clef est dérivée d'un mot de passe sauf si vous souhaitez être compatible avec les versions précédentes d'OpenSSL et de SSLeay.

source: Without the B<-salt> option it is possible to perform efficient dictionary attacks on the password and to attack stream cipher encrypted data. The reason for this is that without the salt the same password always generates the same encryption key. When the salt is being used the first eight bytes of the encrypted data are reserved for the salt: it is generated at random when encrypting a file and read from the encrypted file when it is decrypted.
fr: Sans l'option B<-salt>, il est possible d'effectuer des attaques efficaces sur les mots de passe à partir de dictionnaires et d'attaquer des flux de données chiffrées. Cela vient du fait que sans le grain de sel, le même mot de passe génère toujours la même clef de chiffrement. Si un grain de sel est utilisé, les huit premiers octets des données encodées sont réservés pour le sel : ils sont générés aléatoirement lors du chiffrement d'un fichier et lus lors du déchiffrement.

source: Some of the ciphers do not have large keys and others have security implications if not used correctly. A beginner is advised to just use a strong block cipher in CBC mode such as bf or des3.
fr: Certains algorithmes n'ont pas de clef de taille importante et d'autres ont des implications sur la sécurité en cas de mauvaise utilisation. Un débutant est avisé d'utiliser des encodages en bloc forts en mode CBC comme bf ou des3.

source: All the block ciphers normally use PKCS#5 padding also known as standard block padding: this allows a rudimentary integrity or password check to be performed. However since the chance of random data passing the test is better than 1 in 256 it isn't a very good test.
fr: Tous les algorithmes en mode bloc utilisent la méthode de remplissage PKCS#5, le « standard block padding » : cela permet d'effectuer une vérification rudimentaire de l'intégrité ou du mot de passe. Toutefois, comme la probabilité que des données quelconques passent le test est meilleure que 1 sur 256, ce n'est pas un très bon test.

source: If padding is disabled then the input data must be a multiple of the cipher block length.
fr: Si le remplissage est désactivé, les données en entrées doivent avoir une taille multiple de la taille de bloc de l'algorithme.

source: All RC2 ciphers have the same key and effective key length.
fr: Tous les algorithmes RC2 ont la même longueur de clef et longueur de clef effective.

source: Blowfish and RC5 algorithms use a 128 bit key.
fr: Les algorithmes Blowfish et RC5 utilisent une clef de 128 bits.

source: SUPPORTED CIPHERS
fr: ALGORITHMES PRIS EN CHARGE

source: Note that some of these ciphers can be disabled at compile time and some are available only if an appropriate engine is configured in the configuration file. The output of the B<enc> command run with unsupported options (for example B<openssl enc -help>) includes a list of ciphers, supported by your versesion of OpenSSL, including ones provided by configured engines.
fr: Remarquez que certains de ces algorithmes peuvent être désactivés au moment de la compilation et que certains ne sont disponibles que si le moteur approprié est configuré dans le fichier de configuration. La sortie de la commande B<enc> exécutée avec des fonctions non prises en charge (par exemple B<openssl enc -help>) contient une liste d'algorithmes, pris en charge par votre version d'OpenSSL, y compris ceux fournis par les moteurs configurés.

source: The B<enc> program does not support authenticated encryption modes like CCM and GCM. The utility does not store or retrieve the authentication tag.
fr: Le programme B<enc> ne permet pas les modes de chiffrement authentifié comme CCM ou GCM. L’utilitaire ne garde ni ne récupère l’étiquette d’authentification.

source: bf-cbc Blowfish in CBC mode bf Alias for bf-cbc bf-cfb Blowfish in CFB mode bf-ecb Blowfish in ECB mode bf-ofb Blowfish in OFB mode
fr: bf-cbc Blowfish en mode CBC bf Alias pour bf-cbc bf-cfb Blowfish en mode CFB bf-ecb Blowfish en mode ECB bf-ofb Blowfish en mode OFB

source: cast-cbc CAST in CBC mode cast Alias for cast-cbc cast5-cbc CAST5 in CBC mode cast5-cfb CAST5 in CFB mode cast5-ecb CAST5 in ECB mode cast5-ofb CAST5 in OFB mode
fr: cast-cbc CAST en mode CBC cast Alias pour cast-cbc cast5-cbc CAST5 en mode CBC cast5-cfb CAST5 en mode CFB cast5-ecb CAST5 en mode ECB cast5-ofb CAST5 en mode OFB

source: des-cbc DES in CBC mode des Alias for des-cbc des-cfb DES in CBC mode des-ofb DES in OFB mode des-ecb DES in ECB mode
fr: des-cbc DES en mode CBC des Alias pour des-cbc des-cfb DES en mode CBC des-ofb DES en mode OFB des-ecb DES en mode ECB

source: des-ede-cbc Two key triple DES EDE in CBC mode des-ede Two key triple DES EDE in ECB mode des-ede-cfb Two key triple DES EDE in CFB mode des-ede-ofb Two key triple DES EDE in OFB mode
fr: des-ede-cbc Triple DES EDE à 2 clefs en mode CBC des-ede Triple DES EDE à 2 clefs en mode ECB des-ede-cfb Triple DES EDE à 2 clefs en mode CFB des-ede-ofb Triple DES EDE à 2 clefs en mode OFB

source: des-ede3-cbc Three key triple DES EDE in CBC mode des-ede3 Three key triple DES EDE in ECB mode des3 Alias for des-ede3-cbc des-ede3-cfb Three key triple DES EDE CFB mode des-ede3-ofb Three key triple DES EDE in OFB mode
fr: des-ede3-cbc Triple DES EDE à 3 clefs en mode CBC des-ede3 Triple DES EDE à 3 clefs en mode ECB des3 Alias pour des-ede3-cbc des-ede3-cfb Triple DES EDE à 3 clefs en mode CFB des-ede3-ofb Triple DES EDE à 3 clefs en mode OFB

source: desx DESX algorithm.
fr: desx Algorithm DESX

source: gost89 GOST 28147-89 in CFB mode (provided by ccgost engine) gost89-cnt `GOST 28147-89 in CNT mode (provided by ccgost engine)
fr: gost89 GOST 28147-89 in CFB mode (fourni par moteur ccgost) gost89-cnt `GOST 28147-89 in CNT mode (fourni par moteur ccgost)

source: idea-cbc IDEA algorithm in CBC mode idea same as idea-cbc idea-cfb IDEA in CFB mode idea-ecb IDEA in ECB mode idea-ofb IDEA in OFB mode
fr: idea-cbc Algorithm IDEA en mode CBC idea Alias pour idea-cbc idea-cfb IDEA en mode CFB idea-ecb IDEA en mode ECB idea-ofb IDEA en mode OFB

source: rc2-cbc 128 bit RC2 in CBC mode rc2 Alias for rc2-cbc rc2-cfb 128 bit RC2 in CFB mode rc2-ecb 128 bit RC2 in ECB mode rc2-ofb 128 bit RC2 in OFB mode rc2-64-cbc 64 bit RC2 in CBC mode rc2-40-cbc 40 bit RC2 in CBC mode
fr: rc2-cbc RC2 128 bits en mode CBC rc2 Alias pour rc2-cbc rc2-cfb RC2 128 bits en mode CFB rc2-ecb RC2 128 bits en mode ECB rc2-ofb RC2 128 bits en mode OFB rc2-64-cbc RC2 64 bits en mode CBC rc2-40-cbc RC2 40 bits en mode CBC

source: rc4 128 bit RC4 rc4-64 64 bit RC4 rc4-40 40 bit RC4
fr: rc4 RC4 128 bits rc4-64 RC4 64 bits rc4-40 RC4 40 bits

source: rc5-cbc RC5 cipher in CBC mode rc5 Alias for rc5-cbc rc5-cfb RC5 cipher in CFB mode rc5-ecb RC5 cipher in ECB mode rc5-ofb RC5 cipher in OFB mode
fr: rc5-cbc Algorithme RC5 en mode CBC rc5 Alias pour rc5-cbc rc5-cfb Algorithme RC5 en mode CFB rc5-ecb Algorithme RC5 en mode ECB rc5-ofb RC5 cipher in OFB mode

source: aes-[128|192|256]-cbc 128/192/256 bit AES in CBC mode aes-[128|192|256] Alias for aes-[128|192|256]-cbc aes-[128|192|256]-cfb 128/192/256 bit AES in 128 bit CFB mode aes-[128|192|256]-cfb1 128/192/256 bit AES in 1 bit CFB mode aes-[128|192|256]-cfb8 128/192/256 bit AES in 8 bit CFB mode aes-[128|192|256]-ecb 128/192/256 bit AES in ECB mode aes-[128|192|256]-ofb 128/192/256 bit AES in OFB mode
fr: aes-[128|192|256]-cbc AES 128/192/256 bits en mode CBC aes-[128|192|256] Alias pour aes-[128|192|256]-cbc aes-[128|192|256]-cfb AES 128/192/256 bits en mode CFB 128 bits aes-[128|192|256]-cfb1 AES 128/192/256 bits en mode CFB 1 bit aes-[128|192|256]-cfb8 AES 128/192/256 bits en mode CFB 8 bits aes-[128|192|256]-ecb AES 128/192/256 bits en mode ECB aes-[128|192|256]-ofb AES 128/192/256 bits en mode OFB

source: Just base64 encode a binary file:
fr: Encoder simplement en base64 un fichier binaire :

source: openssl base64 -in file.bin -out file.b64
fr: openssl base64 -in fichier.bin -out fichier.b64

source: Decode the same file
fr: Décoder le même fichier :

source: openssl base64 -d -in file.b64 -out file.bin
fr: openssl base64 -d -in fichier.b64 -out fichier.bin

source: Encrypt a file using triple DES in CBC mode using a prompted password:
fr: Chiffrer un fichier en utilisant le triple DES en mode CBC et en demandant le mot de passe sur le terminal :

source: openssl des3 -salt -in file.txt -out file.des3
fr: openssl des3 -salt -in fichier.txt -out fichier.des3

source: Decrypt a file using a supplied password:
fr: Déchiffrer un fichier avec le mot de passe fourni :

source: openssl des3 -d -salt -in file.des3 -out file.txt -k mypassword
fr: openssl des3 -d -salt -in fichier.des3 -out fichier.txt -k motdepasse

source: Encrypt a file then base64 encode it (so it can be sent via mail for example) using Blowfish in CBC mode:
fr: Chiffrer un fichier, puis l'encoder en base64 (pour pouvoir l'envoyer par mail par exemple), en utilisant l'algorithme Blowfish en mode CBC :

source: openssl bf -a -salt -in file.txt -out file.bf
fr: openssl bf -a -salt -in fichier.txt -out fichier.bf

source: Base64 decode a file then decrypt it:
fr: Décoder un fichier en base64, puis le déchiffrer :

source: openssl bf -d -salt -a -in file.bf -out file.txt
fr: openssl bf -d -salt -a -in fichier.bf -out fichier.txt

source: Decrypt some data using a supplied 40 bit RC4 key:
fr: Déchiffrer des données en utilisant une clef RC4 de 40 bits fournie :

source: openssl rc4-40 -in file.rc4 -out file.txt -K 0102030405
fr: openssl rc4-40 -in fichier.rc4 -out fichier.txt -K 0102030405

source: The B<-A> option when used with large files doesn't work properly.
fr: L'option B<-A> ne fonctionne pas correctement avec les très gros fichiers.

source: There should be an option to allow an iteration count to be included.
fr: Il devrait y avoir une option permettant d'inclure un compteur d'itérations.

source: The B<enc> program only supports a fixed number of algorithms with certain parameters. So if, for example, you want to use RC2 with a 76 bit key or RC4 with an 84 bit key you can't use this program.
fr: Le programme B<enc> gère seulement un nombre fixe d'algorithmes avec certains paramètres. Ainsi, par exemple, pour utiliser RC2 avec une clef de 76 bits ou RC4 avec 84 bits, vous ne pourrez pas utiliser ce programme.

source: nseq - create or examine a netscape certificate sequence
fr: nseq - Créer ou examiner une séquence de certificats Netscape

source: B<openssl> B<nseq> [B<-in filename>] [B<-out filename>] [B<-toseq>]
fr: B<openssl> B<nseq> [B<-in> I<nom_fichier>] [B<-out> I<nom_fichier>] [B<-toseq>]

source: The B<nseq> command takes a file containing a Netscape certificate sequence and prints out the certificates contained in it or takes a file of certificates and converts it into a Netscape certificate sequence.
fr: La commande B<nseq> lit un fichier contenant une séquence de certificats Netscape et affiche les certificats ou convertit un fichier de certificats en une séquence de certificats Netscape.

source: COMMAND OPTIONS
fr: OPTIONS DE LA COMMANDE

source: This specifies the input filename to read or standard input if this option is not specified.
fr: Cela indique le nom du fichier à lire. L'entrée standard est lue lorsque cette option n'est pas spécifiée.

source: specifies the output filename or standard output by default.
fr: Indiquer le fichier de sortie. Par défaut, c'est la sortie standard.

source: normally a Netscape certificate sequence will be input and the output is the certificates contained in it. With the B<-toseq> option the situation is reversed: a Netscape certificate sequence is created from a file of certificates.
fr: Normalement, une suite de certificats Netscape est lue et les certificats contenus sont affichés. Avec l'option B<-toseq>, l'action est inversée : une séquence de certificats Netscape est créée à partir d'un fichier de certificats.

source: Output the certificates in a Netscape certificate sequence
fr: Afficher les certificats d'une séquence de certificats Netscape :

source: Create a Netscape certificate sequence
fr: Créer une séquence de certificats Netscape :

source: The B<PEM> encoded form uses the same headers and footers as a certificate:
fr: La version encodée PEM utilise les mêmes lignes de début et de fin qu'un certificat :

source: A Netscape certificate sequence is a Netscape specific form that can be sent to browsers as an alternative to the standard PKCS#7 format when several certificates are sent to the browser: for example during certificate enrollment. It is used by Netscape certificate server for example.
fr: Une séquence de certificats Netscape est un format propre à Netscape qui peut être envoyé aux navigateurs comme alternative au format standard PKCS#7 lorsque plusieurs certificats sont envoyés, par exemple lors d'une inscription de certificat. Il est utilisé par Netscape certificate server par exemple.

source: This program needs a few more options: like allowing DER or PEM input and output files and allowing multiple certificate files to be used.
fr: Ce programme nécessite quelques options en plus, comme accepter des fichiers d'entrée et de sortie DER ou PEM ainsi que l'utilisation de plusieurs fichiers.

source: ocsp - Online Certificate Status Protocol utility
fr: ocsp - Utilitaire pour le protocole d’état de certificat en ligne

source: B<openssl> B<ocsp> [B<-out file>] [B<-issuer file>] [B<-cert file>] [B<-serial n>] [B<-signer file>] [B<-signkey file>] [B<-sign_other file>] [B<-no_certs>] [B<-req_text>] [B<-resp_text>] [B<-text>] [B<-reqout file>] [B<-respout file>] [B<-reqin file>] [B<-respin file>] [B<-nonce>] [B<-no_nonce>] [B<-url URL>] [B<-host host:n>] [B<-path>] [B<-CApath dir>] [B<-CAfile file>] [B<-VAfile file>] [B<-validity_period n>] [B<-status_age n>] [B<-noverify>] [B<-verify_other file>] [B<-trust_other>] [B<-no_intern>] [B<-no_signature_verify>] [B<-no_cert_verify>] [B<-no_chain>] [B<-no_cert_checks>] [B<-port num>] [B<-index file>] [B<-CA file>] [B<-rsigner file>] [B<-rkey file>] [B<-rother file>] [B<-resp_no_certs>] [B<-nmin n>] [B<-ndays n>] [B<-resp_key_id>] [B<-nrequest n>] [B<-md5|-sha1|...>]
fr: B<openssl> B<ocsp> [B<-out> I<nom_fichier>] [B<-issuer> I<fichier>] [B<-cert> I<fichier>] [B<-serial> I<n>] [B<-signer> I<fichier>] [B<-signkey> I<fichier>] [B<-sign_other> I<fichier>] [B<-no_certs>] [B<-req_text>] [B<-resp_text>] [B<-text>] [B<-reqout> I<fichier>] [B<-respout> I<fichier>] [B<-reqin> I<fichier>] [B<-respin> I<fichier>] [B<-nonce>] [B<-no_nonce>] [B<-url> I<URL>] [B<-host> I<hôte>B<:>I<n>] [B<-path> I<chemin>] [B<-CApath> I<rép>] [B<-CAfile> I<fichier>] [B<-VAfile> I<fichier>] [B<-validity_period> I<n>] [B<-status_age> I<age>] [B<-noverify>] [B<-verify_other> I<fichier>] [B<-trust_other>] [B<-no_intern>] [B<-no_signature_verify>] [B<-no_cert_verify>] [B<-no_chain>] [B<-no_cert_checks>] [B<-port> I<num>] [B<-index> I<fichier>] [B<-CA> I<fichier>] [B<-rsigner> I<fichier>] [B<-rkey> I<fichier>] [B<-rother> I<fichier>] [B<-resp_no_certs>] [B<-nmin> I<n>] [B<-ndays> I<n>] [B<-resp_key_id>] [B<-nrequest> I<n>] [B<-md5>|B<-sha1>|...]

source: The Online Certificate Status Protocol (OCSP) enables applications to determine the (revocation) state of an identified certificate (RFC 2560).
fr: Le protocole d'état de certificat en ligne (OCSP) permet aux applications de déterminer l’état (de révocation) d'un certificat identifié (RFC 2560).

source: The B<ocsp> command performs many common OCSP tasks. It can be used to print out requests and responses, create requests and send queries to an OCSP responder and behave like a mini OCSP server itself.
fr: La commande B<ocsp> effectue de nombreuses tâches OCSP communes. Elle permet d’afficher les demandes et les réponses, créer des demandes et envoyer des requêtes à un répondeur OCSP et se comporter comme un mini serveur OCSP lui-même.

source: OCSP CLIENT OPTIONS
fr: OPTIONS DE CLIENT OCSP

source: specify output filename, default is standard output.
fr: Indiquer le fichier de sortie, par défaut la sortie standard.

source: B<-issuer filename>
fr: B<-issuer> I<fichier>

source: This specifies the current issuer certificate. This option can be used multiple times. The certificate specified in B<filename> must be in PEM format. This option B<MUST> come before any B<-cert> options.
fr: Indiquer le certificat de l'émetteur actuel. Cette option peut être utilisée plusieurs fois. Le certificat mentionné dans le I<fichier> doit être au format PEM. Cette option B<doit> être fournie avant toute option B<-cert>.

source: B<-cert filename>
fr: B<-cert> I<fichier>

source: Add the certificate B<filename> to the request. The issuer certificate is taken from the previous B<issuer> option, or an error occurs if no issuer certificate is specified.
fr: Ajouter le certificat B<fichier> à la demande. Le certificat d’émetteur est pris à partir de l'option B<-issuer> précédente ou une erreur se produit si aucun certificat d’émetteur n’est indiqué.

source: B<-serial num>
fr: B<-serial> I<n>

source: Same as the B<cert> option except the certificate with serial number B<num> is added to the request. The serial number is interpreted as a decimal integer unless preceded by B<0x>. Negative integers can also be specified by preceding the value by a B<-> sign.
fr: Identique à l'option de B<-cert> sauf que le certificat de numéro de série I<num> est ajouté à la demande. Le numéro de série est interprété comme un entier décimal sauf s’il est précédé par B<0x>. Des nombres négatifs peuvent aussi être indiqués par un signe B<-> précédant la valeur.

source: B<-signer filename>, B<-signkey filename>
fr: B<-signer> I<fichier>, B<-signkey> I<fichier>

source: Sign the OCSP request using the certificate specified in the B<signer> option and the private key specified by the B<signkey> option. If the B<signkey> option is not present then the private key is read from the same file as the certificate. If neither option is specified then the OCSP request is not signed.
fr: Signer la demande OCSP à l'aide du certificat indiqué dans l'option B<-signer> et la clef privée indiquée par l'option B<-signkey>. Si l'option B<-signkey> n'est pas présente, alors la clef privée est lue à partir du même fichier que le certificat. Si aucune option n'est indiquée, alors la demande OCSP n'est pas signée.

source: B<-sign_other filename>
fr: B<-sign_other> I<fichier>

source: Additional certificates to include in the signed request.
fr: Certificats supplémentaires à inclure dans la demande signée.

source: Add an OCSP nonce extension to a request or disable OCSP nonce addition. Normally if an OCSP request is input using the B<respin> option no nonce is added: using the B<nonce> option will force addition of a nonce. If an OCSP request is being created (using B<cert> and B<serial> options) a nonce is automatically added specifying B<no_nonce> overrides this.
fr: Ajouter une extension nonce OCSP à une demande ou désactiver l’ajout de nonce OCSP. Normalement, si une demande OCSP est entrée en utilisant l'option B<-respin>, aucun nonce n’est ajouté : utiliser l'option B<-nonce> forcera l’ajout d'un nonce. Si une demande OCSP est créé (avec les options B<-cert> et B<-serial>), un nonce est automatiquement ajouté, indiquer B<-no_nonce> remplace cela.

source: print out the text form of the OCSP request, response or both respectively.
fr: Afficher respectivement au format texte la requête OCSP, la réponse ou les deux.

source: B<-reqout file>, B<-respout file>
fr: B<-reqout> I<fichier>, B<-respout> I<fichier>

source: write out the DER encoded certificate request or response to B<file>.
fr: Écrire la demande ou la réponse de certificat encodée en DER dans B<fichier>.

source: B<-reqin file>, B<-respin file>
fr: B<-reqin> I<fichier>, B<-respin> I<fichier>

source: read OCSP request or response file from B<file>. These option are ignored if OCSP request or response creation is implied by other options (for example with B<serial>, B<cert> and B<host> options).
fr: Lire un fichier de demande ou de réponse OCSP dans B<fichier>. Ces options sont ignorées si la création de demande ou réponse OCSP est implicite grâce à d'autres options (par exemple avec les options B<-serial>, B<-cert> et B<-host>).

source: B<-url responder_url>
fr: B<-url URL>

source: specify the responder URL. Both HTTP and HTTPS (SSL/TLS) URLs can be specified.
fr: Indiquer l’URL de répondeur. Des URL HTTP et HTTPS (SSL ou TLS) peuvent être indiquées.

source: B<-host hostname:port>, B<-path pathname>
fr: B<-host> I<hôte>B<:>I<n>, B<-path> I<chemin>

source: if the B<host> option is present then the OCSP request is sent to the host B<hostname> on port B<port>. B<path> specifies the HTTP path name to use or "/" by default.
fr: Si l'option B<-host> est présente, alors la demande OCSP est envoyée à l’I<hôte> sur le port B<n>. B<chemin> indique le nom de chemin d'accès HTTP à utiliser ou « / » par défaut.

source: B<-timeout seconds>
fr: B<-timeout> I<secondes>

source: connection timeout to the OCSP responder in seconds
fr: Délai de connexion au répondeur OCSP en seconde.

source: B<-CAfile file>, B<-CApath pathname>
fr: B<-CAfile> I<fichier>, B<-CApath> I<rép>

source: file or pathname containing trusted CA certificates. These are used to verify the signature on the OCSP response.
fr: Fichier ou chemin d'accès contenant les certificats de confiance. Ils sont utilisés pour vérifier la signature dans la réponse OCSP.

source: B<-verify_other file>
fr: B<-verify_other> I<fichier>

source: file containing additional certificates to search when attempting to locate the OCSP response signing certificate. Some responders omit the actual signer's certificate from the response: this option can be used to supply the necessary certificate in such cases.
fr: Fichier contenant les certificats supplémentaires où tenter de localiser le certificat de signature de réponse OCSP. Certains répondeurs omettent le certificat du signataire réel de la réponse : cette option permet de fournir le certificat nécessaire dans ces cas là.
