Repository: bigon/manpages-fr-extra
Catalog: openssl/po4a/apps/po/*.po
Languages: fr

source: the input file password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source de mot de passe d'entrée. Pour plus de renseignements sur le format de I<param>, consultez la section B<PARAMÈTRES DE PHRASE SECRÈTE> d'L<B<openssl>(1)|openssl(1)>.

source: This specifies the output filename to write to or standard output by default.
fr: Indiquer le nom du fichier de sortie. La sortie standard est utilisée par défaut.

source: B<-passout arg>
fr: B<-passout> I<param>

source: the output file password source. For more information about the format of B<arg> see the B<PASS PHRASE ARGUMENTS> section in L<openssl(1)|openssl(1)>.
fr: La source de mot de passe pour le fichier de sortie. Pour plus de renseignements sur le format de I<param>, consultez la section B<PARAMÈTRES DE PHRASE SECRÈTE> d'L<B<openssl>(1)|openssl(1)>.

source: prints out the certificate request in text form.
fr: Afficher la demande de certificat au format texte.

source: prints out the request subject (or certificate subject if B<-x509> is specified)
fr: Afficher l'objet de la demande (ou l'objet du certificat si B<-x509> est indiqué)

source: outputs the public key.
fr: Afficher la clef publique.

source: this option prevents output of the encoded version of the request.
fr: Cette option empêche la sortie de la version encodée de la demande.

source: this option prints out the value of the modulus of the public key contained in the request.
fr: Cette option affiche la valeur du modulo de la clef publique contenue dans la demande.

source: verifies the signature on the request.
fr: Vérifier la signature de la demande.

source: this option generates a new certificate request. It will prompt the user for the relevant field values. The actual fields prompted for and their maximum and minimum sizes are specified in the configuration file and any requested extensions.
fr: Cette option génère une nouvelle demande de certificat. Il sera demandé à l'utilisateur de fournir les valeurs des champs nécessaires. Ces champs demandés ainsi que leurs valeurs maximales et minimales sont indiqués dans le fichier de configuration ainsi que dans les extensions.

source: If the B<-key> option is not used it will generate a new RSA private key using information specified in the configuration file.
fr: Si l'option B<-key> n'est pas utilisée, une nouvelle clef privée RSA sera générée en utilisant l'information du fichier de configuration.

source: B<-subj arg>
fr: B<-subj> I<param>

source: Replaces subject field of input request with specified data and outputs modified request. The arg must be formatted as I</type0=value0/type1=value1/type2=...>, characters may be escaped by \ (backslash), no spaces are skipped.
fr: Remplacer le champ d'objet de la demande d'entrée par les données indiquées et afficher la demande modifiée. I<param> doit être formaté comme B</>I<type0>B<=>I<valeur0>B</>I<type1>B<=>I<valeur1>B</>I<type2>B<=>... où les caractères peuvent être protégés par « \ » (barre oblique inversée), aucun espace n'est ignoré.

source: B<-newkey arg>
fr: B<-newkey> I<param>

source: this option creates a new certificate request and a new private key. The argument takes one of several forms. B<rsa:nbits>, where B<nbits> is the number of bits, generates an RSA key B<nbits> in size. If B<nbits> is omitted, i.e. B<-newkey rsa> specified, the default key size, specified in the configuration file is used.
fr: Cette option crée une nouvelle demande de certificat et une nouvelle clef privée. Le paramètre utilise l'une des formes suivantes : B<rsa:>I<nombre_bits>, où I<nombre_bits> est le nombre de bits, génère une clef RSA de taille I<nombre_bits>. Si I<nombre_bits> n'est pas indiqué, c'est-à-dire que B<-newkey rsa> est utilisé, la taille de clef par défaut, indiquée dans le fichier de configuration, est utilisée.

source: All other algorithms support the B<-newkey alg:file> form, where file may be an algorithm parameter file, created by the B<genpkey -genparam> command or and X.509 certificate for a key with approriate algorithm.
fr: Tous les autres algorithmes gèrent la forme B<-newkey> I<alg>B<:>I<fichier>, où I<fichier> peut être un fichier de paramètres d'algorithme, créé par la commande B<genpkey -genparam> ou un certificat X.509 pour une clef avec l'algorithme approprié.

source: B<param:file> generates a key using the parameter file or certificate B<file>, the algorithm is determined by the parameters. B<algname:file> use algorithm B<algname> and parameter file B<file>: the two algorithms must match or an error occurs. B<algname> just uses algorithm B<algname>, and parameters, if neccessary should be specified via B<-pkeyopt> parameter.
fr: B<param:>I<fichier> génère une clef en utilisant le I<fichier> de paramètres ou de certificats, l'algorithme est déterminé par les paramètres. I<alg>B<:>I<fichier> utilise l'I<alg>orithme indiqué et le I<fichier> de paramètres. Les deux algorithmes doivent correspondre sinon cela produit une erreur. I<alg> n'indique que l'algorithme, et les paramètres, si nécessaires, doivent être indiqués avec l'option B<-pkeyopt>.

source: B<dsa:filename> generates a DSA key using the parameters in the file B<filename>. B<ec:filename> generates EC key (usable both with ECDSA or ECDH algorithms), B<gost2001:filename> generates GOST R 34.10-2001 key (requires B<ccgost> engine configured in the configuration file). If just B<gost2001> is specified a parameter set should be specified by B<-pkeyopt paramset:X>
fr: B<dsa:>I<fichier> génère une clef DSA utilisant les paramètres du fichier I<fichier>. B<ec:>I<fichier> génère une clef EC (utilisable à la fois avec les algorithmes ECDSA ou ECDH), B<gost2001:>I<fichier> génère une clef GOST R 34.10-2001 (nécessite que le moteur B<ccgost> soit configuré dans le fichier de configuration). Si seul B<gost2001> est indiqué, un jeu de paramètres devrait être indiqué par B<-pkeyopt> I<jeu_param>B<:>I<X>

source: B<-pkeyopt opt:value>
fr: B<-pkeyopt> I<opt>B<:>I<valeur>

source: set the public key algorithm option B<opt> to B<value>. The precise set of options supported depends on the public key algorithm used and its implementation. See B<KEY GENERATION OPTIONS> in the B<genpkey> manual page for more details.
fr: Définir l'option I<opt> de l'algorithme à clef publique à I<valeur>. L’ensemble exact d'options prises en charge dépend de l'algorithme à clef publique utilisé et de son implémentation. Consultez B<OPTIONS DE GÉNÉRATION DE CLEF> dans la page de manuel B<genpkey>(1) pour plus de précisions.

source: B<-key filename>
fr: B<-key> I<nom_fichier>

source: This specifies the file to read the private key from. It also accepts PKCS#8 format private keys for PEM format files.
fr: Indiquer le fichier de clef privée à lire. Les clefs privées au format PKCS#8 sont aussi acceptées pour les fichiers au format PEM.

source: B<-keyform PEM|DER>
fr: B<-keyform> B<PEM>|B<DER>

source: the format of the private key file specified in the B<-key> argument. PEM is the default.
fr: Le format du fichier de la clef privée indiqué avec l'option B<-key>. PEM est le format par défaut.

source: B<-keyout filename>
fr: B<-keyout> I<nom_fichier>

source: this gives the filename to write the newly created private key to. If this option is not specified then the filename present in the configuration file is used.
fr: Donner le nom de fichier où la clef privée créée sera écrite. Par défaut, le nom indiqué par le fichier de configuration est utilisé.

source: if this option is specified then if a private key is created it will not be encrypted.
fr: Avec cette option, si une clef privée est créée, elle ne sera pas chiffrée.

source: B<-[digest]>
fr: B<->[I<condensé>]

source: this specifies the message digest to sign the request with (such as B<-md5>, B<-sha1>). This overrides the digest algorithm specified in the configuration file.
fr: Indiquer le type de condensé à utiliser pour signer la demande (comme B<-md5> ou B<-sha1>). Si elle est présente, cette option prévaut à celle donnée dans le fichier de configuration.

source: Some public key algorithms may override this choice. For instance, DSA signatures always use SHA1, GOST R 34.10 signatures always use GOST R 34.11-94 (B<-md_gost94>).
fr: Certains algorithmes à clef publique pourraient écraser ce choix. Par exemple, les signatures DSA utilisent toujours SHA1, les signatures GOST R 34.10 utilisent toujours GOST R 34.11-94 (B<-md_gost94>).

source: B<-config filename>
fr: B<-config> I<nom_fichier>

source: this allows an alternative configuration file to be specified, this overrides the compile time filename or any specified in the B<OPENSSL_CONF> environment variable.
fr: Permettre d'utiliser un fichier de configuration alternatif, à la place de celui indiqué lors de la compilation ou avec la variable d'environnement B<OPENSSL_CONF>.

source: sets subject name for new request or supersedes the subject name when processing a request. The arg must be formatted as I</type0=value0/type1=value1/type2=...>, characters may be escaped by \ (backslash), no spaces are skipped.
fr: Définir le nom de sujet pour les nouvelles demandes ou remplace le nom de sujet lors du traitement d'une demande. I<param> doit être formaté comme B</>I<type0>B<=>I<valeur0>B</>I<type1>B<=>I<valeur1>B</>I<type2>B<=>... où les caractères peuvent être protégés par « \ » (barre oblique inversée), aucun espace n'est ignoré.

source: this option causes the -subj argument to be interpreted with full support for multivalued RDNs. Example:
fr: Cette option force l'argument de B<-subj> à être interprété avec une prise en charge complète des RDN multivaleurs. Exemple :

source: I</DC=org/DC=OpenSSL/DC=users/UID=123456+CN=John Doe>
fr: I</DC=org/DC=OpenSSL/DC=users/UID=123456+CN=Jean Dupont>

source: If -multi-rdn is not used then the UID value is I<123456+CN=John Doe>.
fr: Si B<-multi-rdn> est utilisée, alors la valeur de l'UID est I<123456+CN=Jean Dupont>.

source: this option outputs a self signed certificate instead of a certificate request. This is typically used to generate a test certificate or a self signed root CA. The extensions added to the certificate (if any) are specified in the configuration file. Unless specified using the B<set_serial> option B<0> will be used for the serial number.
fr: Cette option génère un certificat autosigné à la place d'une demande de certificat. Elle est utilisée typiquement pour générer des certificats de test ou le certificat autosigné racine d'une autorité de certification. Les extensions à ajouter au certificat, s'il y en a, sont indiquées dans le fichier de configuration. À moins d'être précisé par l'option B<set_serial>, le numéro de série sera B<0>.

source: B<-days n>
fr: B<-days> I<n>

source: when the B<-x509> option is being used this specifies the number of days to certify the certificate for. The default is 30 days.
fr: Lorsque l'option B<-x509> est utilisée, elle indique le nombre de jours pendant lesquels le certificat sera certifié. La valeur par défaut est 30 jours.

source: B<-set_serial n>
fr: B<-set_serial> I<n>

source: serial number to use when outputting a self signed certificate. This may be specified as a decimal value or a hex value if preceded by B<0x>. It is possible to use negative serial numbers but this is not recommended.
fr: Numéro de série à utiliser lors de l'affichage d'un certificat autosigné. Cela peut être indiqué comme une valeur décimale, ou hexadécimale si elle est précédée par B<0x>. Des numéros de série négatifs peuvent être utilisés mais ce n'est pas conseillé.

source: B<-extensions section>
fr: B<-extensions> I<section>

source: B<-reqexts section>
fr: B<-reqexts> I<section>

source: these options specify alternative sections to include certificate extensions (if the B<-x509> option is present) or certificate request extensions. This allows several different sections to be used in the same configuration file to specify requests for a variety of purposes.
fr: Ces options précisent des sections alternatives d'extension de certificat (si l'option B<-x509> est présente), ou de demandes de certificat à inclure. Cela permet d'utiliser des sections différentes du même fichier de configuration servant à des propos variés.

source: this option causes field values to be interpreted as UTF8 strings, by default they are interpreted as ASCII. This means that the field values, whether prompted from a terminal or obtained from a configuration file, must be valid UTF8 strings.
fr: Cette option indique que les valeurs des champs doivent être interprétées comme des chaînes UTF-8. Par défaut, elles sont interprétées comme des chaînes ASCII. Cela signifie que les valeurs des champs, qu'elles soient demandées sur le terminal ou fournies par le fichier de configuration, doivent être des chaînes UTF-8 valables.

source: B<-nameopt option>
fr: B<-nameopt> I<option>

source: option which determines how the subject or issuer names are displayed. The B<option> argument can be a single option or multiple options separated by commas. Alternatively the B<-nameopt> switch may be used more than once to set multiple options. See the L<x509(1)|x509(1)> manual page for details.
fr: Option qui détermine la façon d'afficher les noms de sujet ou d'émetteur. L'argument I<option> peut être une seule option ou plusieurs options séparées par des virgules. Le paramètre B<-nameopt> peut aussi être utilisé plus d'une fois pour définir plusieurs options. Consultez la page de manuel L<x509(1)|x509(1)> pour plus de précisions.

source: customise the output format used with B<-text>. The B<option> argument can be a single option or multiple options separated by commas.
fr: Personnaliser le format de sortie utilisé avec B<-text>. L'argument I<option> peut être une seule option ou plusieurs options séparées par des virgules.

source: See discission of the B<-certopt> parameter in the L<B<x509>|x509(1)> command.
fr: Consultez la discussion sur l'option B<-certopt> dans la page de manuel de la commande L<B<x509>|x509(1)>.

source: by default the B<req> command outputs certificate requests containing no attributes in the correct PKCS#10 format. However certain CAs will only accept requests containing no attributes in an invalid form: this option produces this invalid format.
fr: Par défaut, la commande B<req> génère des demandes de certificats sans attributs dans un format PKCS#10 valable. Toutefois, certaines autorités de certification n'acceptent que des demandes sans attributs sous une forme non valable qui est produite avec cette option.

source: More precisely the B<Attributes> in a PKCS#10 certificate request are defined as a B<SET OF Attribute>. They are B<not OPTIONAL> so if no attributes are present then they should be encoded as an empty B<SET OF>. The invalid form does not include the empty B<SET OF> whereas the correct form does.
fr: Plus précisément, les attributs d'une demande de certificat PKCS#10 sont définies comme un ensemble d'attributs (B<SET OF Attribute>). Ils ne sont B<pas de type OPTIONAL>, ainsi, si aucun attribut n'est présent, une entrée vide B<SET OF> devrait le signaler. La forme non valable n'inclut pas cette entrée alors que la forme valable le fait.

source: It should be noted that very few CAs still require the use of this option.
fr: Remarquez que très peu d'autorités de certification nécessitent encore l'utilisation de cette option.

source: Reverses effect of B<-asn1-kludge>
fr: Inverser l'effet de B<-asn1-kludge>.

source: Adds the word B<NEW> to the PEM file header and footer lines on the outputted request. Some software (Netscape certificate server) and some CAs need this.
fr: Ajouter le mot B<NEW> aux lignes de début et de fin du fichier PEM de la demande de certificat créée. Certains logiciels (Netscape certificate server) et certaines autorités de certification en ont besoin.

source: non-interactive mode.
fr: Mode non interactif.

source: print extra details about the operations being performed.
fr: Afficher des précisions supplémentaires à propos des opérations effectuées.

source: specifying an engine (by its unique B<id> string) will cause B<req> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.
fr: Indiquer un moteur (en utilisant son identifiant unique I<id>) forcera B<req> à essayer d'obtenir une référence fonctionnelle pour le moteur indiqué et l'initialiser si nécessaire. Le moteur sera ensuite utilisé par défaut pour tous les algorithmes disponibles.

source: B<-keygen_engine id>
fr: B<-keygen_engine> I<id>

source: specifies an engine (by its unique B<id> string) which would be used for key generation operations.
fr: Indiquer un moteur (en utilisant son identifiant unique I<id>) à utiliser pour les opérations de génération de clef.

source: CONFIGURATION FILE FORMAT
fr: FORMAT DU FICHIER DE CONFIGURATION

source: The configuration options are specified in the B<req> section of the configuration file. As with all configuration files if no value is specified in the specific section (i.e. B<req>) then the initial unnamed or B<default> section is searched too.
fr: Les options de configuration sont indiquées dans la section B<req> du fichier de configuration. Comme avec tous les fichiers de configuration, si aucune valeur n'est donnée dans la section correspondante (c'est-à-dire B<req>), la section initiale sans nom ou la section B<default> est également parcourue.

source: The options available are described in detail below.
fr: Les options disponibles sont décrites en détail ci-dessous.

source: The passwords for the input private key file (if present) and the output private key file (if one will be created). The command line options B<passin> and B<passout> override the configuration file values.
fr: Les mots de passe pour le fichier de clef privée d'entrée (si présent) et pour le fichier de clef privée de sortie (si une clef est créée). Les options de ligne de commande B<passin> et B<passout> remplacent les valeurs du fichier de configuration.

source: This specifies the default key size in bits. If not specified then 512 is used. It is used if the B<-new> option is used. It can be overridden by using the B<-newkey> option.
fr: Indique la taille par défaut des clefs, en bits. Si elle n'est pas indiquée, la valeur 512 est utilisée. Elle est utilisée lors de l'emploi de l'option B<-new>. Elle peut être écrasée par l'option B<-newkey>.

source: This is the default filename to write a private key to. If not specified the key is written to standard output. This can be overridden by the B<-keyout> option.
fr: C'est le nom de fichier par défaut où la clef privée sera écrite. Si elle n'est pas indiquée, la clef sera écrite sur la sortie standard. Cela peut être écrasé par l'option B<-keyout>.

source: This specifies a file containing additional B<OBJECT IDENTIFIERS>. Each line of the file should consist of the numerical form of the object identifier followed by white space then the short name followed by white space and finally the long name.
fr: Indique le fichier contenant des B<IDENTIFIANTS D'OBJET> supplémentaires. Chaque ligne est constituée de la forme numérique de l'identifiant d'objet suivie d'un espace puis du libellé court suivi à son tour d'un espace et finalement du libellé long.

source: This specifies a section in the configuration file containing extra object identifiers. Each line should consist of the short name of the object identifier followed by B<=> and the numerical form. The short and long names are the same when this option is used.
fr: Indique une section du fichier de configuration contenant d'autres identifiants d'objet. Chaque ligne est constituée du libellé court de l'identifiant d'objet suivi de B<=> et de la forme numérique. Le libellé court et le libellé long sont identiques quand cette option est utilisée.

source: This specifies a filename in which random number seed information is placed and read from, or an EGD socket (see L<RAND_egd(3)|RAND_egd(3)>). It is used for private key generation.
fr: Indique le fichier où les graines pour les nombres aléatoires sont lues et écrites, ou une socket EGD (consultez L<RAND_egd(3)|RAND_egd(3)>). C'est utilisé pour la génération de clef privée.

source: If this is set to B<no> then if a private key is generated it is B<not> encrypted. This is equivalent to the B<-nodes> command line option. For compatibility B<encrypt_rsa_key> is an equivalent option.
fr: Si cela vaut B<no>, lors de la génération d'une clef privée, elle n'est B<pas> chiffrée. Cela équivaut à l'option B<-nodes> de la ligne de commande. Pour assurer la compatibilité, B<encrypt_rsa_key> est une option équivalente.

source: This option specifies the digest algorithm to use. Possible values include B<md5 sha1 mdc2>. If not present then MD5 is used. This option can be overridden on the command line.
fr: Cette option indique l'algorithme à utiliser pour les condensés. B<md5>, B<sha1> et B<mdc2> font partie des valeurs possibles. Si cette option n'est pas présente, MD5 sera utilisé. Cette option peut être écrasée avec l'option correspondante de la ligne de commande.

source: This option masks out the use of certain string types in certain fields. Most users will not need to change this option.
fr: Cette option masque l'utilisation de certains types de chaîne de caractères dans certains champs. La plupart des utilisateurs n'auront pas besoin de modifier cette option.

source: It can be set to several values B<default> which is also the default option uses PrintableStrings, T61Strings and BMPStrings if the B<pkix> value is used then only PrintableStrings and BMPStrings will be used. This follows the PKIX recommendation in RFC2459. If the B<utf8only> option is used then only UTF8Strings will be used: this is the PKIX recommendation in RFC2459 after 2003. Finally the B<nombstr> option just uses PrintableStrings and T61Strings: certain software has problems with BMPStrings and UTF8Strings: in particular Netscape.
fr: Elle peut se voir affecter diverses valeurs : B<default> qui est la valeur par défaut et qui utilise PrintableStrings, T61Strings et BMPStrings. Si la valeur B<pkix> est indiquée, uniquement PrintableStrings et BMPStrings seront utilisées. C'est conforme à la recommandation PKIX dans la RFC 2459. Si l'option B<utf8only> est employée, alors seules les UTF8Strings sont employées : c'est la recommandation PKIX dans la RFC 2459 pour après 2003. Finalement l'option B<nombstr> utilise seulement PrintableStrings et T61Strings : certains logiciels ont des problèmes avec les BMPStrings et les UTF8Strings, en particulier Netscape.

source: this specifies the configuration file section containing a list of extensions to add to the certificate request. It can be overridden by the B<-reqexts> command line switch. See the L<x509v3_config(5)|x509v3_config(5)> manual page for details of the extension section format.
fr: Indique la section du fichier de configuration contenant une liste d'extensions à ajouter à la demande de certificat. Elle peut être remplacée par l'option B<-reqexts> de la ligne de commande. Consultez la page de manuel L<x509v3_config(5)|x509v3_config(5)> pour obtenir des précisions sur le format de la section d'extensions.

source: this specifies the configuration file section containing a list of extensions to add to certificate generated when the B<-x509> switch is used. It can be overridden by the B<-extensions> command line switch.
fr: Indique la section du fichier de configuration contenant une liste d'extensions à ajouter aux certificats générés avec l'option B<-x509>. Elle peut être remplacée par l'option B<-extensions> de la ligne de commande.
